[
  {
    "id": "PRV_2025_001",
    "title": "REVISIÓN DE LIQUIDACIÓN PARA PAGO",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "03/02/2025",
    "endDate": "16/06/2025",
    "observations": "Se notifica por par parte del jefe de unidad inconsistencias en Vistas de las fuentes de información entregadas. Carecen de data necesaria,\n[09/06/2025] :El requerimirneo fue  pausado 12 mayo de 2025\n[10/06/2025]: Hoy se definira si se contunua con el desarrollo o continua pausado.\n[11/06/2025]: Ya se cuenta con los permisos y el query para la vista. Se sincronizan las reclamaciones de Cifren, pero falta integrar las de Plus (montadas en AWS) y ajustar la identificación del origen de cada reclamación.\nSe estima que este requerimiento adicional tomará un día de trabajo Iniciando  el 12 de Junio\n[13/06/2025]: Se obtuvo respuesta positiva sobre permisos para acceder a la vista de Plus. Sin embargo, falta que la vista tenga datos reales para completar la sincronización.\n[16/06/2025] : Se completó la primera fase de validación y hoy se trabaja en la parte de gestión de pagos, cliente  realizara pruebas hoy\n[17/06/2025]: Se realizan en ajustes en la mañana de hallasgoz reportados por el cliente tras las pruebas, y se entregaran al cliente para sus pruebas.\n[18/06/2025]: Se adaptó el grid y los reportes a\nlos distintos roles/permisos. También se incorporaron nuevos campos a solicitud del cliente; pendiente Pruebas  por el cliente.\n[19/06/2025]; supero pruebas del cliente  y se aprueba paso a produccion  para el dia sabado 21 de Junio..\n[24/06/2025]; Fala aplazó el paso a produccion para el 5 de julio, debido a que tenían actualizaciones pendientes. Además, dependemos de la disponibilidad de ciertas vistas en el ambiente de producción para continuar con el proceso.\n [07/07/2025]: Se realiza paso a produccion el 5 de julio.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
  "id": "PRV_2025_004",
  "title": "AUXILIOS FUNERARIOS PAGO AUX. FUNERARIOS",
  "assigned": "MAURICIO",
  "state": "Finalizado",
  "progress": 100,
  "startDate": "19/06/2025",
  "endDate": "03/07/2025",
  "observations": "Cargue de formatos de formalización y consolidado 100%\nOpción de edición y opción de histórico del flujo 100%\nSe notifica por par parte del jefe de unidad inconsistencias en Vistas de las fuentes de información entregadas. Carecen de data necesaria\n[09/06/2025] :El requerimirneo fue  pausado  el 6 de junio de 2025.\n[16/06/2025]: Se comenzarán el jueves 19 de junio. Ya se están creando las vistas necesarias para ese flujo\n[19/06/2025]: Inicio del desarrollo.\n[20/06/2025]:No se pudo avanzar ayer 19 de junio por ajustes requeridos por el cliente para PRV_2025_001 VALIDACIÓN DE LOTE PARA PAGO,NOTIFICACIÓN DE PAGO,  Se retomara  desarrollo 24 de junio.\n[24/06/2025]; Se encuentra sincronizando data, se estiman 2 dias para finalizar.\n[25/06/2025]; Se ajustó la lógica del requerimiento tras diferenciarlo claramente del flujo de pagos. Se avanzó en la creación de vistas y en la sincronización inicial de datos. Se espera tener el desarrollo listo para pruebas el jueves 26. Se planea agregar botones para sincronización (Pago,auxilio y exportar) diferenciada según permisos,crear tabla de auxilios x año, ajustar campos (encabezados)de la vista de gestion y ajustar modulo de consulta.\n[26/06/2025]: Se avanzó satisfactoriamente en la creación de la tabla de auxilios por año, el ajuste de encabezados en la vista de gestión y la incorporación de los botones de sincronización según permisos.\nPENDIENTE la solución del error en la sincronización masiva, lo cual impide avanzar con la exportación y cargue de información. También sigue sin ajustes el módulo de consulta para auxilios \n[01/07/2025]: Se ha avanzado en un 75% del desarrollo, incluyendo funcionalidades principales. El cierre del tema está previsto para hoy, Faltan por implementar la generación de informes, la edición de fecha de siniestro y valor, así como la opción de marcar como pendiente. \n[02/07/2025]: El desarrollo del módulo de auxilios funerarios presenta un avance estimado del 90%. Ya se encuentra implementada la funcionalidad principal, incluyendo la creación de vistas, funciones de sincronización y flujo de radicación hasta aprobación. Se están finalizando los ajustes a los reportes en Excel, Se programó una sesión de revisión hoy a las 2:00 p.m. para validación funcional y ajuste de pendientes.\n[04/07/2025]: Se resolvió un error en la validación de pagos, el módulo ya está funcional. Se finalizó el desarrollo y se ajustaron validaciones necesarias para la gestión masiva y manual. Solo queda pendiente la validación del cliente, ya que la sesión programada fue cancelada.\n[07/07/2025]: Se Pasado a producción el 5 de julio sin habilitar el menú. Faltan validaciones finales por el cliiente.\n[16/07/2025]: Las pruebas no se han culminado por un error en el sistema del cliente al cargar unos registros. Sin estos registros no puedo ver la data que necesitamos en Imagine.\n[29/07/2025]: Se proyecta acompañar al área para realizar pruebas con los recursos existentes para ya dejar cerrado el requerimiento.\n[01/08/2025]: Hoy se retoma el módulo con el cliente, para validar que se tiene hasta el momento, funcionalidad y posibles desviaciones, para dar gestión y cierre del requerimiento.\n[04/08/2025]: Se continúa validaciones y ajustes correspondientes para proyectar paso a producción el viernes 08 de agosto.\n[12/08/2025]: Debido a incidencia presentada en la conexión Plus + UAT , no fue posible el paso a producción el viernes 08 de agosto, por tanto se proyecta el despliegue para el viernes 15 de agosto.\n[20/08/2025]: Despliegue a produccion realizado en 15 de Agosto.",
  "unit": "Fala",
  "detail": "**REQ No.:** NEGOCIO\n**Código:** PRV-2025-004 AUXILIO FUNERARIO\n**RESPONSABLE:** Carlos Eduardo Rodriguez Medina\n\n**OBJETIVO:**\nDesarrollar módulo de flujo de pago de Auxilios funerarios, con formalizaciones recibidas diariamente, integrada con validaciones realizadas a través de vistas generadas por Seguros de Vida Fala SA.\n\n**FLUJO DE AUXILIO FUNERARIO:**\n1. Desarrollar módulo donde intervienen las siguientes personas:\n- Radicación: M.P.C\n- Validación: E.T.G\n- Aprobación: S.P.A\n- Pago y Cierre: E.T.G\n\n2. Tablas entregadas por Seguros de Vida Fala SA\n\n**APLICACIÓN DE VISTAS:**\n- TIPO SINCRONIZACION 1\n- SINCRONIZACION 2 CAMPOS\n- PLUS V_IMAGINE_SINIESTROS_PLUS NUEVO 6:00 a. m.\n- Consulta por FECHA_CREACION para siniestros creados últimamente (2 meses sin siniestro)\n\n**VISTA Fala:**\n- V_TABLA_GENERAL_CARGUE_DIARIO\n- V_TIPO_SINIESTRO_GENERAL\n- V_TIPO_SINIESTRO_PLUS\n- V_IMAGINE_SINIESTROS_PLUS\n\n**TABLAS DE APOYO:**\n- ESTADO AUXILIO\n- MOTIVO DEVOLUCIÓN\n- TIPO AUXILIO\n\n**MODULO DE CONSULTA:**\nConsulta por fechas y filtros de estado del auxilio funerario\n\n**NOTIFICACIONES AUTOMÁTICAS POR ESTADO:**\n1. Estado DEVUELTO → notifica al responsable de radicación\n2. Estado APROBADO → notifica a los de pago\n3. Estado PAGADO → confirma al responsable de cierre\n\n**ROLES INVOLUCRADOS:**\n- Radicador\n- Validador\n- Aprobador\n- Pagador\n- Coordinador Fala",
  "visible": true
},
{
    "id": "PRV_2025_009",
    "title": "DESARROLLO PREVISIONAL INCAPACIDADES",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "09/06/2025",
    "endDate": "12/06/2025",
    "observations": "[09/06/2025]: El  Objetivo Automatizar el cálculo de incapacidades en el sistema Imagine, replicando el proceso manual actual utilizado por los liquidadores y presentando los resultados en un formato claro y compatible con Excel.\niniciara  con el desarrollo\n[11/06/2025]: Mauricio completó la función de cálculo y está terminando el formulario de consulta. Planea entregar el requerimiento completo hoy para subir a pruebas el jueves.\n[13/06/2025]:Ya fue entregado en ambiente de pruebas para validación del cliente. Está funcionando correctamente y aplicando los cálculos según lo solicitado.\n!9/06/2025: Paso a produccion para el 21 de junio.\n[24/06/2025]: Fala aplazó  el paso a produccion para el 5 de julio, debido a que tenían actualizaciones pendientes.\n[07/07/2025]: Igual que Auxilios se paso a producciòn el 5 de julio sin habilitar el menu. Se requiere validación del cliente para habilitar.\n[16/07/2025]: Requerimiento funcional en producción con el menú habitado.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_007",
    "title": "CÁLCULO IBL",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "03/07/2025",
    "endDate": "04/07/2025",
    "observations": "16/06/2025: Se requiere una sesión con Carlos, Jenry, Mauricio y Fabio para entender el detalle de validaciones. Aún no se tiene fecha ni estimación.\n[04/07/2015]:Se inicia desarrollo con  un avance del 20%. Se ajustaron funciones en Postgres para cálculos correctos según las vistas generadas. El siguiente paso es crear la funcionalidad de consulta por cédula o siniestro y desplegar cálculos de acuerdo a la fecha indicada. Se estima finalizar req hoy   para  realizar paso a produccion el  5 de julio.\n[07/07/2025]: Se realizo paso a producciòn el 5 de Julio sin habiitar el menu, Faltan pruebas formales del cliente para habilitación final.\n[11/07/2025]: El 10 de julio se realizó un ajuste para excluir los casos con auxilios funerarios. Ahora, el sistema valida que el origen del caso sea únicamente incapacidad o supervivencia; en caso contrario, se lanza una alerta.\n[16/07/2025]: Se realiza paso a producción el 14 de julio en la noche.",
    "unit": "Fala",
    "detail": "**DESARROLLO PREVISIONALES  IBL**\r\n**OBJETIVO**\r\n1. Realizar calculo IBL de forma automática desde el sistema Imagine de acuerdo con el Origen y factor en consecuencia al año.\r\n**CRUCE IBL**\r\nActualmente la información es descargada desde SIPREN y PLUS para obtener la información de la Historia Laboral.\r\n1.\tDescarga IBL SIPREN \r\n\r\n**DESARROLLO PREVISIONALES  IBL**\r\n\r\n1. Descarga IBL PLUS\r\n\r\n1.Tablas entregadas por Seguros de vida Alfa SA\r\n\r\n**-SIPREN**\r\na.**PENDIENTES:** VISTAS IBL Y CRUZAR CON SINIESTROS PARA OBTENER DATOS \r\n\r\n**2.PLUS**\r\n\r\na.**PENDIENTES:** VISTAS IBL Y CRUZAR CON SINIESTROS PARA OBTENER DATOS \r\n\r\n\r\n1.Realizar cálculos de acuerdo con Plantilla calculo IBL\r\n\r\na.Permitir incluir documento de identificación o siniestro para realizar calculo.\r\nb.Permitir descargar Excel con resultado de cálculo.\r\n\r\n\r\n**Instructivo cálculo IBL**\r\n\r\n\r\n1. Exportar la historia laboral de Sipren (Historia Laboral IBL)\r\n2. Pegar la historia laboral (3650 días)en la hoja de Validación - Columna N a S.\r\n3. Colocar el No. 1, en el campo factor (tabla de actualización - Columna C), en el año de siniestro correspondiente\r\n4. Arrastrar la formula de factor (Columna E) hasta el año de siniestro\r\n5. Copiar las formulas en todos los campos de la tabla de formulación hasta el último registro de la historia laboral\r\n6. Ajustar la formula de suma del IBL hasta el ultimo registro de la HL\r\n6. Actualizar campo \"TOTAL DIAS COTIZADOS\"\r\n",
    "visible": true
  },
  {
    "id": "PRV_2025_005",
    "title": "HISTORIA LABORAL",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "07/07/2025",
    "endDate": "09/07/2025",
    "observations": "[11/06/2025]: Continuará con el desarrollo tras finalizar req PRV_2025_007 CÁLCULO IBL.\n[07/07/2025]: Inicia desarrollo.\n[08/07/2025]: Se reporta un avance del 50 % entre analisis y desarrollo del requerimeinto.\n[09/07/2025]: Se Finaliza desarrollo y se entrega al cliente para pruebas.\n[11/07/2025]: El 10 de julio se ajustó el reporte para incluir periodos que existan en multifondos pero no en Fala. Se agregó una columna adicional para mostrar el salario mensualizado proveniente de Porvenir. Cambios ya implementados y listos para validación.\n[14/07/2025]: El 10 de julio se ajustó el reporte para incluir los períodos que existen en Multifondos pero no en Alfa. Adicionalmente, se incorporó una nueva columna que muestra el salario mensualizado proveniente de Porvenir. Los cambios ya fueron implementados y se encuentran listos para validación.\n[16/07/2025]: Se realiza paso a producción el 14 de julio en la noche.",
    "unit": "Fala",
    "detail": "**REQ No.\tNEGOCIO\r\n2025-005\tPREVISIONALES\r\nRESPONSABLE\r\nCarlos Eduardo Rodriguez Medina\r\nOBJETIVO**\r\n\r\n1.\tRealizar comparación de historia laboral Multifondos Vs SIPREN y PLUS\r\n\r\n\r\n\r\n\r\n**ALCANCE**\r\n\r\n1.\tComparar archivo cargado de multifondos con información registrada en bases de información alfa. Generando la confirmación y/o alerta de diferencias encontradas en la validación. \r\n\r\n**FLUJO DE PAGOS**\r\n\r\n\r\n1.\tRealizar cargue detalle de historia laboral de multifondos en aplicación Imagine.\r\n\r\n2.\tDesarrollar opción donde permita cargar archivo el archivo como vienen de multifondos (csv).\r\n\r\n \r\n\r\n3.\tAl cargar Excel solicitar número de siniestro o identificación y fecha de estructuración. \r\n\r\na.\tLa primera validación debe ser que exista siniestro validando con vistas entregadas por alfa.\r\n-\tPRV.V_IMAGINE_HISTORIA_LABORAL_SIPREN\r\n-\t\r\nb.\tSi el Origen es Sobrevivencia (Muerte) el cálculo de acuerdo con la fecha de estructuración.\r\nc.\tSi el Origen es Invalidez se debe validar los periodos de acuerdo con la fecha de estructuración.\r\nd.\tEl calculo se realiza para los periodos anteriores a la fecha de estructuración.\r\ne.\t**Si la fecha de estructuración tiene días parciales debe fraccionar el periodo para calcular solo hasta la fecha de estructuración. De esta manera permitir exportarlo.**\r\nf.\tTener en cuenta los casos de enfermedades congénitas para invalidez que la fecha es la fecha de nacimiento.\r\n\r\n4.\tLa comparación se debe realizar agrupado por periodo, comparando valores y días.\r\n5.\tPermitir descargar Excel con comparación y en columna adicional mostrar si esta “Correcto” o “Con diferencia”. Ordenado por periodo de menor a mayor.\r\n6.\tPermitir borrar el cálculo realizado.\r\n\r\n\r\n\r\n\r\n**ESTRATEGIA**\r\n\r\n7.\tDescarga IBL SIPREN \r\n\r\n8.\tDescarga IBL PLUS \r\n\r\n \r\n\r\n \r\n",
    "visible": true
  },
  {
    "id": "PRV_2025_001-1",
    "title": "VALIDACIÓN DE LOTE PARA PAGO, NOTIFICACIÓN DE PAGO",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "16/06/2025",
    "endDate": "19/06/2025",
    "observations": "El 16 de junio se inicia desarrollo confecha estimada de finalizacion  18 de junio.\n[18/06/2025]: El 17 de junio  se desarrollan dos informes adicionales: tesorería y porvenir, con definición de estructura en curso.\n[19/06/2025]: Entrega al cliente para pruebas 19 de junio, Cliente solicita ajuste de vistas y campos  necesarios  para el proceso.\n[24/06/2025]; Fala aplazó el paso a produccion para el 5 de julio, debido a que tenían actualizaciones pendientes. \n[07/07/2025:] Se realiza paso a produccion el 5 de julio.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "AJUSTES_REN_2025_001-1",
    "title": "INCLUIR VALIDACION DOCUMENTAL PARA NUEVO ORIGEN SUSTITUCION PENSIONAL",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "10/07/2025",
    "endDate": "10/07/2025",
    "observations": "[11/07/2025]: Dado que ya se crearon las tablas de referencia, se finalizó este proceso el día 10 de julio. Queda pendiente validar el impacto que estas puedan tener en los diferentes módulos y consultas del sistema para que el cliente realice las pruebas. \n[14/07/2025]:El viernes 11 se  valida en ambiente de pruebas los ajustes realizados, confirmando funcionamiento correcto en: cargue de cotización y contratación, gestión telefónica desde call center, exportación del informe de Presidencia y descarga de documentos. Quedan pendientes por validar: envío de correos del portafolio de servicios, envío de comprobantes de nómina y validación de consultas.\n Hoy se trabajará en los informes que deben reflejar esta nueva parametrización y se verificará si afecta portafolios o comprobantes de nómina.\n[15/07/2025]: El lunes 14 de julio se finalizó el desarrollo del ajuste, se realizaron las pruebas correspondientes con resultados exitosos y se procedió con el paso a producción. ",
    "unit": "Fala",
    "detail": "**Requerimiento 2025-001 ajustes Rentas Vitalicias**\n1.\tEn virtud de sesión realizada el 19 de mayo de 2025, se solicita realizar ajustes en la aplicación de rentas vitalicias para mejorar la operatividad y entrega de informes.\n**1.\tINCLUIR VALIDACION DOCUMENTAL PARA NUEVO URIGEN SUSTITUCION PENSIONAL** \n\nSe requiere cargar y cambiar el Origen Sustitución. Esto para cargar documento ACIN (Acta de invalidez) y ACDE (Acta de defunción). Este ajuste se presenta para casos que inicialmente fueron cargados como Invalidez, pero por la muerte del Pensionado, se debe también completar el acta de defunción.\n\na.\tSe debe crear un nuevo Origen “sustitución” en la tabla rentasvitalicias.rentas_origen\n\ncod_origen\tnombre_origen\tabreviatura\tcodigo_origen_super\n1\tMUERTE\tM\t2\n2\tINVALIDEZ\tI\t1\n3\tVEJEZ\tV\t3\n4\tAUXILIO FUNERARIO\tA\t2\n999\tSIN CODIGO\t9\t\n5\tINCAPACIDAD\tINC\t1\n6\tINVALIDEZ SIN SOLICITUD\tISS\t1\n7\tVEJEZ ESPECIAL\tVE\t\n8\tSUSTITUCION\tS\t1\n\nb.\tSe debe crear validación de documentos para nuevo origen, incluyendo el ACDE. Esta validación funciona de la misma manera que INVALIDEZ. Solo se debe agregar para el parentesco EL MISMO el documento ACDE. Tabla rentasvitalicias.rentas_documentos_obligatorios\n\ni.\tTener en cuenta tabla de referencia rentasvitalicias.rentas_clase_documentos para validar códigos de documento ACDE.\n\nsr_doc_obli\torigen\tparentesco\tedad\tdocumento\n83\t8\t1\t0\t2\n84\t8\t1\t0\t9\n85\t8\t11\t0\t5\n86\t8\t11\t0\t9\n87\t8\t11\t0\t1\n88\t8\t11\t0\t14\n89\t8\t11\t0\t10\n90\t8\t11\t0\t2\n91\t8\t11\t0\t6\n92\t8\t19\t0\t10\n93\t8\t19\t0\t2\n94\t8\t19\t0\t5\n95\t8\t19\t0\t9\n96\t8\t3\t0\t9\n97\t8\t3\t0\t3\n98\t8\t3\t0\t2\n99\t8\t4\t>18\t2\n100\t8\t4\t>=7,<=18\t9\n101\t8\t4\t>18\t9\n102\t8\t4\t<7\t9\n103\t8\t4\t>=7,<=18\t2\n\n\nc.\tSe debe validar los siguientes puntos de forma detallada: \n\ni.\tLa Carga de Cotización y contratación\nii.\tLa gestión telefónica realizada por el Call Center. Ver como direcciona las bandejas de llamadas. (Actualizacion invalidez Sobrev) No Efectivos Invalidez Sobrev)\niii.\tEnvío de Portafolios de servicio. “Sobrevivencia”\niv.\tEnvío de Comprobantes de Nomina. “Sobrevivencia”\n\n\nv.\tEl exportar informe de validación documental “Base Total”. Cambiar un JKIcaso real sustitucion (enero – febrero). OK CORRECTO\nvi.\tLa descarga de documentos para el nuevo origen sustitución. “Entrega Ministerio”. OK CORRECTO\n\n\n",
    "visible": true
  },
  {
    "id": "AJUSTES_REN_2025_001-2",
    "title": "INFORME DE PRESIDENCIA (Validación Documental Rentas)",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "10/07/2025",
    "endDate": "10/07/2025",
    "observations":"[10/07/2025]: Se realizaron los ajustes solicitados por el área y estos ya fueron entregados en el ambiente de producción. El cliente efectuó las pruebas correspondientes y confirmó que el ajuste fue aplicado correctamente.",
    "unit": "Fala",
    "detail": "**Requerimiento 2025-001 ajustes Rentas Vitalicias**\n1.\tEn virtud de sesión realizada el 19 de mayo de 2025, se solicita realizar ajustes en la aplicación de rentas vitalicias para mejorar la operatividad y entrega de informes.\n\n**2.INFORME DE PRESIDENCIA (Validación Documental Rentas)**\nActualmente el área solicitar actualizar el mensaje de los documentos al descargar el informe por mensajes más cortos. \n\na.\tAl generar el informe Base Total de Validación documental se genera por\nOpción: Imaginex  Rentas Vitalicias  Informes  1 Validación Documental  2 Informe por: (Base Total)  3 Generar\nb.\tEl sistema al dar clic en Generar actualiza tabla rentasvitalicias.informe_documentacion con informacion de imágenes validadas en la tabla rentasvitalicias.validacion_documental.\n\nc.\tEste análisis es actualizado en rentasvitalicias.informe_documentacion trae un mensaje que ya no es utilizado por el area. De esta manera se debe actualizarse el mensaje entregado:\nMensaje Actual\tNuevo mensaje\nsi-validado-2022-10-13 14:50:22\tREVISADO OK\nno\tNO ESTA EL DOC\nsi-rechazado Documento Antiguo-2019-09-27 17:05:51\tRECHAZADO\nsi-pendiente-2023-12-26 09:12:29\tEN REVISION\n",
    "visible": true
  },
  {
    "id": "AJUSTES_REN_2025_001-3",
    "title": "CAMBIO DE ESTADO DE IMÁGENES PARA RENTAS NO CONTRATADAS",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "16/07/2025",  
    "endDate": "16/07/2025",
    "observations":"[15/07/2025]: Se inician ajustes solicitados.\n[18/07/2025]: Se culminaron los ajustes requeridos por el área, se realiza paso a produccion el 17 de julio.",
    "unit": "Fala",
    "detail": "**Requerimiento 2025-001 ajustes Rentas Vitalicias**\n1.\tEn virtud de sesión realizada el 19 de mayo de 2025, se solicita realizar ajustes en la aplicación de rentas vitalicias para mejorar la operatividad y entrega de informes.\n\n**3.CAMBIO DE ESTADO DE IMÁGENES PARA RENTAS NO CONTRATADAS**\n\nSe requiere marcar como rechazados los documentos relacionados con cotizaciones cargadas nuevamente.\n\ni.\tLa Carga de Cotización y contratación permitir cargar sustitución\n\n\nb.\tAl cargar la base cotizaciones, el sistema Imagine actualiza o inserta nuevos registros en la tabla rentasvitalicias.rentas_cabecera\n\nc.\tSe requiere que al cargar los nuevos casos, si este actualiza un registro “ya existente” también realice un update a la tabla rentasvitalicias.validacion_documental y deje como rechazados los documentos existentes.\n\nd.\tAl cargar la base de cotización en \n\ne.\tTodos los documentos cargados en rentasvitalicias.validacion_documental para el numero_ident o num_doc2 que el campo validación es in (1,0), se debe dejar como validacion =’2’ y usuario =’imagine’\n\n\n\n.",
    "visible": true
  },
  {
    "id": "AJUSTES_REN_2025_001-4",
    "title": "VALIDAR INCONSISTENCIA INFORME RENTAS RCMA – DDEP",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "10/07/2025",
    "endDate": "10/07/2025",
    "observations":"[10/07/2025]: Se inicia desarrollo del ajuste.\n[11/07/2025]: EL 10 de julio Se realizaron pruebas por parte de Carlos. Actualmente, el cambio se encuentra pendiente de ser implementado en el ambiente de producción.\n[15/07/2025]: Se realizó el paso a producción el día 14 de julio.",
    "unit": "Fala",
    "detail": "**Requerimiento 2025-001 ajustes Rentas Vitalicias**\n1.\tEn virtud de sesión realizada el 19 de mayo de 2025, se solicita realizar ajustes en la aplicación de rentas vitalicias para mejorar la operatividad y entrega de informes.\n\n**4.VALIDAR INCONSISTENCIA INFORME RENTAS RCMA – DDEP**\n\n-\tValidar error ya que no está mostrando el DDEP validado. \n-\tSi los dos estén rechazados mostrar los dos en el informe.\nNumero Cotizacion\t Tipo Documento\tNumero Identificacion Nombre Causante\t\n",
    "visible": true
  },
  {
    "id": "AJUSTES_REN_2025_001-5",
    "title": "INCLUIR VALIDACIÓN ADICIONAL PARA RCMA – DDEP.",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "15/07/2025",
    "endDate": "16/07/2025",
    "observations":"[16/07/2025]: Se finaliza ajuste 15 de julio y se realiza despliegue a produccion el 16 de julio en la mañana.",
    "unit": "Fala",
    "detail": " ",
    "visible": true
  },
  {
    "id": "PRV_2025_011",
    "title": "ANS - TABLERO DE CONTROL  - dashboard",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/07/2025",
    "endDate": " 24/07/2025",
    "observations":"\n[18/07/2025]: Se completó el query de base. Se trabaja en selección de librería gráfica compatible con Laravel. Se estima un 20% de avance general.\n[21/07/2025]: Se está trabajando en las gráficas de ANS, se estima terminar el 22/07/2025 para paso a pruebas UAT.\n[23/07/2025]: Se terminan los gráficos del tablero de control.\n[24/07/2025]: El 22/07/2025 se continua en gestión del tablero de control ANS, sacaba error en los gráficos, se estima terminar el 23/07/2025 por compromiso con el cliente.\n[24/07/2025]: Se trabaja en la  exportación de la data de las estadísticas.\n[25/07/2025]. Se entrega al área tablero de ANS finalizado, programado subir los cambios para paso a producción el 25/07/2025 a las 5:00 pm.",
    "unit": "Fala",
    "detail": "**DESARROLLO PREVISIONALES  ANS – TABLERO DE CONTROL**\r\n**OBJETIVO**\r\n1. Mostrar estadísticas de los pagos efectuados a través del flujo. Comparar gráficamente el periodo actual con el mes inmediatamente anterior.\r\nEntregar una herramienta que permita ver el estado de las operaciones en tiempo real\r\n\r\n**ALCANCE**\r\nCrear un tablero de control – dashboard.\r\n\r\n**MODULO INCAPACIDADES**\r\n1. Crear una modulo denominado ANS \r\n2. Permitir seleccionar usuarios quienes al ingresar inmediatamente verán estas estadísticas para el control de las operaciones y toma de decisiones.\r\n**a.\tANS PAGOS:**\r\n-\tSe crea select para agrupar el ANS con el cliente PORVENIR donde se tiene un nivel de servicio de 1 a 8 días.\r\n1. Se toma como fecha inicial de medición la fecha de recibido.\r\n2.\tComo fecha final pera casos pendientes será la fecha actual\r\n3.\tPara casos cerrados se tomará la fecha del estado cerrado como fecha final.\r\n-\tPendiente incluir en esta consulta que solo cuente días hábiles.\r\n-\tPendiente validar que librería grafica podemos utilizar, se debe tener en cuenta los recursos que tenemos disponibles actualmente dentro del servidor.\r\n\r\n1.\tEstados que aplican para el informe de pagos. Según tabla \r\n**id**-\t**name**-\t**agrupación**\r\n1-\tValidación -\tPendiente\r\n2-\tCorrección -\tPendiente\r\n3-\tAprobación -\tPendiente\r\n4-\tRevisado  -\tPendiente\r\n5-\tInconsistente-\tPendiente\r\n6\tPago -\tPendiente\r\n7\tCierre -\tCerrado\r\n\r\n\r\n ",
    "visible": true
  },
  {
    "id": "AJT PRV_2025_001",
    "title": "Ajuste flujo de  pagos ",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/07/2025",
    "endDate": " 22/07/2025",
    "observations":"[21/07/2025]: El 17/07/2025 Se envía correo por parte de Carlos a Seguros Alfa, solicitando modificar 2 vistas:a. Sipren: Ajustes V_consolidado_reclamaciones_img, b. Plus: AjustesV_consolidado_tramites_plus\nPendiente presentarlo a comité para efectuar el cambio correspondiente en las vistas.\n[El 18/07/2025]: Mauricio realizó un ajuste en el módulo de flujo de pagos, mediante el cual se asocia a cada estado del flujo una ruta u opción de acceso específica. Anteriormente, independientemente del permiso asignado, los usuarios podían visualizar los estados a los que contaban con permiso.\n[23/07/2025]: El 22 de Julio se entrega al cliente  para pruebas, al pendiente de aceptación  para paso a produccion.\n[24/07/2025]: Se solicita a Mauricio subir los cambios de flujo de pagos modificados en las vistas que actualizó [Carlos]. Validar los cambios y ajustes requeridos por el cliente en requerimientos ya cerrados para paso a producción.\n[25/07/2025]: Se finalizan los ajustes solicitados por el área (un campo llamado parentesco y mostrarlo en el export, en el Excel que exporta el cliente). Programado subir cambios para paso a producción el 25/07/2025 a las 5:00 pm.\n[28/07/2025]: El viernes 25 de julio sobre las 6:00 pm hasta las 7:30 pm se realiza el despliegue a producción.\nEl día de hoy se encuentra validando que los cambios y ajustes en el paso a producción están funcionando correctamente.\nSe evidencia que hubo una inconsistencia en los datos que Alfa suministra en el cambio a producción. Se encuentra en validación.\n[01/08/2025]: Se vuelve a validar con Alfa la información reportada en el script, sin embargo, se encuentran a la espera de que el área de producción entregue el DLL que se envió en el despliegue. Por parte de Imagine no hay pendientes.\n[08/08/2025]: El 06 de Agosto a raíz de la reunión con el área Previsionales el día 05 de agosto, surgieron ajustes solicitados por parte del vicepresidente de Alfa.\n1.        Incluir el cálculo IBL dentro del flujo. Validar primero el nombre de las etiquetas.\n2. Convertir en cero al exportar el Excel los valores negativos. Solicitud de Patricia Arteaga.\n3. Resaltar el nombre de la columna Pago Total para que se ubiquen los usuarios.\n4. Validar las etiquetas dentro del editar. Falta información.\n5. Revisar información que sale en la parte izquierda en el editar, ya que no se sale un valor.\n[08/08/2025]:El día de hoy 08 de agosto, se trabaja en control de cambios en Flujo de pagos solicitado por el Vicepresidente de Alfa.\n[20/08/2025]: Se pasa a producción el 16 de agosto.",
    "unit": "Fala",
    "detail": " ",
    "visible": true
  },
  {
    "id": "PRV_2025_002",
    "title": "REPORTE ANEXO 1 (Lentantamiento de requerimiento)",
    "assigned": "CARLOS",
    "state": "Pausado",
    "progress": 15,
    "startDate": "21/07/2025",
    "endDate": " ",
    "observations":"[21/07/2025]: Carlos está adelantando el levantamiento del requerimiento, para proyectar entrega.\n[23/07/2025]: La actividad se encuentra en pausa, ya que está en fase de definición con el cliente para establecer las prioridades en los requerimientos siguientes.",
    "unit": "Fala",
    "detail": " ",
    "visible": true
  },
  {
    "id": "PRV_2025_002-1",
    "title": "REPORTE ANEXO 1 (desarrollo )",
    "assigned": "MAURICIO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations":"",
    "unit": "Fala",
    "detail": " ",
    "visible": false
  },
  {
    "id": "PRV_2025_003",
    "title": "AVISO A LA RENTA (Levantamiento del requerimiento)",
    "assigned": "Carlos y Cindy",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/07/2025",
    "endDate": "25/07/2025",
    "observations":"[25/07/2025]: Carlos y Cindy estan trabajando en el levantamiento del requerimiento para pasar a Mauricio y que inicie con el desarrollo para que quede en el paso a producción programado para el 25/07/2025 a las 5:00 pm.\n[28/07/2025]: El viernes 25 de julio se hace socialización del requerimiento con Mauricio y Jairo.",
    "unit": "Fala",
    "detail": " ",
    "visible": true
  },
  {
    "id": "PRV_2025_003-1",
    "title": "AVISO A LA RENTA (Desarrollo)",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/07/2025",
    "endDate": "01/08/2025",
    "observations":"[28/07/2025], el viernes 25 de julio, debido a una inconsistencia en el aplicativo ALFASST del área SST con unas ordenes de servicio, se tuvo que dar prioridad y Mauricio no pudo iniciar el desarrollo de Avisos a la renta.\nEl día de hoy, luego de terminar validaciones de paso a producción de otros requerimientos, se inicia desarrollo de este requerimiento.\n[30/07/2025]: Se reporta un avance del 50% en el desarrollo del módulo de avisos de renta. Ya se visualizan los pagos correctamente y quedan pendientes las funcionalidades de notificación, descarga de Excel y eliminación de registros. Se espera finalizar hoy. \n[01/08/2025]: Al 31 de julio, el reporte se encuentra listo para entrega. El día de hoy, Mauricio presentará su funcionamiento y flujo, con el fin de identificar posibles desviaciones y evaluar la viabilidad de su automatización.\n[04/08/2025]: El 01 de agosto quedo funcional el requerimiento, está proyectado para paso a producción el viernes 08 de agosto. \n[13/08/2025]: Se proyecta paso a producción el sábado 16 de agosto.\n[20/08/2025]: Paso a producción  realizado 16 de Agosto.",
    "unit": "Fala",
    "detail":"**DETALLE SITUACIÓN ACTUAL APLICACIÓN (ES)**\n\n1. Actualmente, el área de Previsionales realiza entre dos y tres cruces mensuales en Excel con el fin de reportar al área de Rentas Vitalicias los siniestros pagados por concepto de Reliquidación, que hayan generado pagos posteriores a la fecha de expedición de la póliza en Rentas.\n\n**OBJETIVO**\n\n2. Desarrollar un módulo funcional que permita al área de Previsionales descargar los siniestros que deben ser reportados al área de Rentas Vitalicias, específicamente aquellos relacionados con pagos por concepto de Reliquidación posteriores a la fecha de expedición de la póliza.\n\nAdemás, el módulo debe incorporar un mecanismo de control y trazabilidad, que registre qué siniestros han sido reportados, junto con la fecha de reporte, para asegurar seguimiento, evitar duplicidades y facilitar auditorías.\n\n**ALCANCE**\n\n3. Diseñar e implementar un módulo dentro del sistema Imagine que permita al área de Previsionales:\na. Descargar los siniestros que deben ser reportados al área de Rentas Vitalicias, específicamente aquellos con pagos por concepto de Reliquidación posteriores a la fecha de expedición de la póliza.\nb. Generar el archivo de descarga con la estructura definida por el área de Previsionales, asegurando compatibilidad con los formatos utilizados en los reportes actuales.\nc. Incorporar un sistema de control y trazabilidad que registre en Imagine los casos reportados, incluyendo la fecha de reporte, el usuario responsable, y el estado del reporte, con el fin de facilitar el seguimiento, evitar duplicidades y garantizar la integridad del proceso.\n\n**MODULO INCAPACIDADES**\n\n4. Crear una modulo denominado Aviso a la Renta.\n5. Tomar los casos que cumplan los siguientes parámetros:\na. Casos del flujo de pagos\nb. Casos de RELIQUIDACION\nc. Donde el pago_total sea mayor a cero\nd. Su estado sea cerrado. (Ya pagado)\n\nSELECT \n    sol.id AS num_solicitud,\n    sol.fecha_solicitud,\n    sol.aplicacion,\n    sol.no_siniestro,\n    sol.nid_numero_identificacion AS id,\n    dsol.afiliado AS nombre,\n    dsol.nombre_tipo AS concepto_reliquidacion,\n    dsol.comentario_lqp AS concepto_final\nFROM solicitud sol\nLEFT JOIN detalle_solicitud dsol \n    ON dsol.id_solicitud = sol.id \nWHERE dsol.status = true\n  AND dsol.nombre_tipo = 'RELIQUIDACION'\n  AND dsol.pago_total > 0\n  AND sol.nid_estado = '7';\n\n-- Falta agregar por ejemplo en la tabla solicitud una marcación fecha.\n\n6. También se debe incluir validación con la tabla de rentasvitalicias.rentas_cabecera que está en la bd img001 esquema rentasvitalicias y debe cumplir lo siguiente:\na. sol.nid_numero_identificacion = rentas…..numero_ident\nb. num_renta > '0'\nc. Parentesco = '11'  -- “EL MISMO” pensionado.\nd. sol.fecha_solicitud >= rentas……fecha_expedicion\n\n7. Evaluar la posibilidad de marcar en la tabla solicitud los casos que hayan sido reportados, registrando la fecha de exportación de los datos. Esta acción deberá estar sujeta a confirmación explícita por parte del usuario, a través de una opción tipo check o validación en el módulo.\nDe esta manera, se permite la generación del reporte en múltiples ocasiones sin afectar el estado de los registros, asegurando que la actualización en la tabla solicitud solo se realice cuando el usuario confirme que la exportación correspondiente.\n\n8. Mostrar log en la parte inferior donde visualice los registros reportados anteriormente.\n\n9. Por favor incluir las validaciones relacionadas en la imagen como recomendaciones.", 
    "visible": true
  },
  {
    "id": "Img_2025_001",
    "title": "Validar servidor de contingencia",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/08/2025",
    "endDate": "08/08/2025",
    "observations":"[01/08/2025]: Se realizarà validación del servidor de contingencia el día de hoy, puesto que en meses pasado se presentaron incidencias y debemos garantizar que toda la información se encuentre sincronizada de forma correcta.\n[04/08/2025]: Se programó sesión con Wilson y Mauricio para validación y acompañamiento en la sincronización de la contingencia.\n[08/08/2025]: Validación de error de la sincronización de contingencia, con Alfa y Claro – Onpremise,2. Validación cambio de llaves AWS.\n[12/08/2025]: Se encuentra pendiente ajuste a permisos de carpetas para la sincronización y notificación por correo del error  en la sincronización o éxito en la misma.\nLa reunión del viernes para cambio de llaves AWS, se reprogramo para hoy a las 9:00 am hasta las 10:15 am aproximadamente.",
    "unit": "Fala",
    "detail":" ", 
    "visible": true
  },
  {
    "id": "PRV_2025_004-1",
    "title": "Ajustes modulo auxilios funerarios",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/08/2025",
    "endDate": " 13/08/2025",
    "observations":"[[08/08/2025]: El 05 de Agosto, se realiza acompañamiento en la sesión del área de Previsionales, por si surgen dudas u observaciones.Se trabaja en informes de Pagos y Auxilios Funerarios.\n[11/08/2025]: A raíz de la sesión del viernes surgieron ajustes adicionales:\n1. Incluir el cálculo del IBL dentro del flujo.\n2. Convertir en cero al exportar el Excel los valores negativos..\n3. Resaltar el nombre de la columna Pago Total para que se ubiquen los usuarios.\n4. Validar las etiquetas dentro del editar. Falta información.\n5. Revisar información que sale en la parte izquierda en el editar, ya que no sale un valor.\nEstos puntos ya quedaron gestionados el día de ayer en un 90%.\nFalta culminar:\n- Control de cambios en flujo de pagos.\n- Incluir el cálculo del IBL dentro del flujo. Validar nombre de las etiquetas.\n[12/08/2025]: El viernes hubo incidencia en el cargue del Excel archivo de formalización de Auxilios Funerarios, sin embargo, este ya quedo solucionado. Se continúa trabajando en los ajustes faltantes requeridos por vicepresidencia de Seguridad Social.\n[13/08/2025]:Reunión con el área de coordinación y desarrollo para instrucciones de entrega de documentación.\n- Creación de documentos técnicos requeridos por Alfa para paso a comité de cambios el día de hoy 13 de agosto y mañana 14. \n- Ajustes por pruebas de usuario en error de cargue de archivo y mejora de la consulta.\n- Se proyecta paso a producción de aviso a la renta y auxilios funerarios el sábado 16 de agosto.\n[20/08/2025]: El día sábado 16 se realiza paso a producción.",
    "unit": "Fala",
    "detail":" ", 
    "visible": true
  },
  {
    "id": "PRV_2025_004-2",
    "title": "Ajustes auxilios funerarios y aviso a la renta",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/08/2025",
    "endDate": " 14/08/2025",
    "observations":"[14/08/2025]: Ajuste a bugs reportados por el cliente para Auxilios Funerarios y Aviso a la Renta (formatos y consultas). Ya el día de hoy se certificó por parte del cliente el paso a producción, el cual se programa realizar por parte de Mauricio el sábado 16 de agosto.\nSe requirió acompañamiento de Mauricio en las sesiones para solucionar de forma inmediata las inconsistencias, durante las horas de la mañana y tarde.\n[20/08/2025]: El día sábado 16 se realiza paso a producción.",
    "unit": "Fala",
    "detail":" ", 
    "visible": true
  },
  {
    "id": "Img_2025_002",
    "title": "Validar servidor de contingencia",
    "assigned": "MAURICIO",
    "state": "En Proceso",
    "progress": 90,
    "startDate": "15/08/2025",
    "endDate": " ",
    "observations":"[15/08/2025]: Se reconfiguraron los permisos y Mauricio estará validando el tema el día de hoy, sincronización y funcionamiento.\n[20/08/2025]: Al 19 de agosto, se encuentra pendiente reporte por parte de Claro informando las actividades realizadas el día viernes de acuerdo al refresh de la llave.",
    "unit": "Fala",
    "detail":" ", 
    "visible": true
  },
  {
    "id": "PRV_2025_004-3",
    "title": "Solicitar acceso a vistas y tablas",
    "assigned": "CARLOS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "15/08/2025",
    "endDate": "19/08/2025",
    "observations":"[15/08/2025]: El día de hoy se tuvo incidencia debido a una restauración de las bases de datos en SIPREN, en ambiente de pruebas, se borraron algunas vistas. Carlos realizó solicitud de nuevo de los permisos para lectura de tablas y vistas en ambiente de pruebas Sipren y Plus de una vez, ya que el día de hoy o mañana también realizaran restauración de bases de datos.\n[20/08/2025]: Al 19 de agosto ya se encuentran los permisos e Imagine se encuentra en proceso de restauración de las vistas y tablas borradas.",
    "unit": "Fala",
    "detail":" ", 
    "visible": true
  }
]