[
  {
    "id": "PRV_2025_001_1",
    "title": "REVISIÓN DE LIQUIDACIÓN PARA PAGO,",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "03/02/2025",
    "endDate": "16/06/2025",
    "observations": "Se notifica por par parte del jefe de unidad inconsistencias en Vistas de las fuentes de información entregadas. Carecen de data necesaria, \n[09/06/2025] :El requerimirneo fue  pausado 12 mayo de 2025\n[10/06/2025]: Hoy se definira si se contunua con el desarrollo o continua pausado.\n[11/06/2025]: Ya se cuenta con los permisos y el query para la vista. Se sincronizan las reclamaciones de Cifren, pero falta integrar las de Plus (montadas en AWS) y ajustar la identificación del origen de cada reclamación.\nSe estima que este requerimiento adicional tomará un día de trabajo Iniciando  el 12 de Junio\n[13/06/2025]: Se obtuvo respuesta positiva sobre permisos para acceder a la vista de Plus. Sin embargo, falta que la vista tenga datos reales para completar la sincronización. \n[16/06/2025] : Se completó la primera fase de validación y hoy se trabaja en la parte de gestión de pagos, cliente  realizara pruebas hoy \n[17/06/2025]: Se realizan en ajustes en la mañana de hallasgoz reportados por el cliente tras las pruebas, y se entregaran al cliente para sus pruebas. \n[18/06/2025]: Se adaptó el grid y los reportes a \nlos distintos roles/permisos. También se incorporaron nuevos campos a solicitud del cliente; pendiente Pruebas  por el cliente.\n[19/06/2025]; supero pruebas del cliente  y se aprueba paso a produccion  para el dia sabado 21 de Junio..\n[24/06/2025]; Alfa aplazó el paso a produccion para el 5 de julio, debido a que tenían actualizaciones pendientes. Además, dependemos de la disponibilidad de ciertas vistas en el ambiente de producción para continuar con el proceso. \n[07/07/2025]: Se realiza paso a produccion el 5 de julio.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_001_2",
    "title": "VALIDACIÓN DE LOTE PARA PAGO,\nNOTIFICACIÓN DE PAGO",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "16/06/2025",
    "endDate": "19/06/2025",
    "observations": "El 16 de junio se inicia desarrollo confecha estimada de finalizacion  18 de junio. \n[18/06/2025]: El 17 de junio  se desarrollan dos informes adicionales: tesorería y porvenir, con definición de estructura en curso.\n[19/06/2025]: Entrega al cliente para pruebas 19 de junio, Cliente solicita ajuste de vistas y campos  necesarios  para el proceso.\n[24/06/2025]; Alfa aplazó el paso a produccion para el 5 de julio, debido a que tenían actualizaciones pendientes\n[07/07/2025]: Se realiza paso a produccion el 5 de julio.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004",
    "title": "AUXILIOS FUNERARIOS\nPAGO AUX. FUNERARIOS",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "03/07/2025",
    "observations": "Cargue de formatos de formalización y consolidado 100%\nOpción de edición y opción de histórico del flujo 100%\n\nSe notifica por par parte del jefe de unidad inconsistencias en Vistas de las fuentes de información entregadas. Carecen de data necesaria\n[09/06/2025] :El requerimirneo fue  pausado  el 6 de junio de 2025.\n[16/06/2025]: Se comenzarán el jueves 19 de junio. Ya se están creando las vistas necesarias para ese flujo\n[19/06/2025]: Inicio del desarrollo.\n[20/06/2025]:No se pudo avanzar ayer 19 de junio por ajustes requeridos por el cliente para PRV_2025_001 VALIDACIÓN DE LOTE PARA PAGO,NOTIFICACIÓN DE PAGO,  Se retomara  desarrollo 24 de junio.\n[24/06/2025]; Se encuentra sincronizando data, se estiman 2 dias para finalizar.\n[25/06/2025]:Se ajustó la lógica del requerimiento tras diferenciarlo claramente del flujo de pagos. Se avanzó en la creación de vistas y en la sincronización inicial de datos. Se espera tener el desarrollo listo para pruebas el jueves 26. Se planea agregar botones para sincronización (Pago,auxilio y exportar) diferenciada según permisos,crear tabla de auxilios x año, ajustar campos (encabezados)de la vista de gestion y ajustar modulo de consulta.\n[26/06/2025]: Se avanzó satisfactoriamente en la creación de la tabla de auxilios por año, el ajuste de encabezados en la vista de gestión y la incorporación de los botones de sincronización según permisos. PENDIENTE, Está pendiente la solución del error en la sincronización masiva, lo cual impide avanzar con la exportación y cargue de información. También sigue sin ajustes el módulo de consulta para auxilios.\n\n[27/06/2025]: \npendiente: 1. asignar opcion de pendientes\n2. Ver consolidado pagos. (se envia masivamente y aprueba por el flujo para pasar a pagos).\n\n3. Generar informe radicacion pagos plus.\n\nSe estima toda la entrega para hoy\n\n[01/07/2025]: Se ha avanzado en un 75% del desarrollo, incluyendo funcionalidades principales. El cierre del tema está previsto para hoy, Faltan por implementar la generación de informes, la edición de fecha de siniestro y valor, así como la opción de marcar como pendiente.\n[02/07/2025]:El desarrollo del módulo de auxilios funerarios presenta un avance estimado del 90%. Ya se encuentra implementada la funcionalidad principal, incluyendo la creación de vistas, funciones de sincronización y flujo de radicación hasta aprobación. Se están finalizando los ajustes a los reportes en Excel, Se programó una sesión de revisión hoy a las 2:00 p.m. para validación funcional y ajuste de pendientes.\n[04/07/2025]: Se resolvió un error en la validación de pagos, el módulo ya está funcional. Se finalizó el desarrollo y se ajustaron validaciones necesarias para la gestión masiva y manual. Solo queda pendiente la validación del cliente, ya que la sesión programada fue cancelada.\n[07/07/2025]: Se Pasado a producción el 5 de julio sin habilitar el menú. Faltan validaciones finales por el cliiente.\n[16/07/2025]: Las pruebas no se han culminado por un error en el sistema del cliente al cargar unos registros. Sin estos registros no puedo ver la data que necesitamos en Imagine.\n[29/07/2025]: Se proyecta acompañar al àrea para realizar pruebas con los recursos existentes para ya dejar cerrado el requerimiento\n[01/08/2025]: Hoy se retoma el módulo con el cliente, para validar que se tiene hasta el momento, funcionalidad y posibles desviaciones, para dar gestion y cierre del requerimiento\n[04/08/2025]: Se continùa validaciones y ajustes correspondientes para proyectar paso a producciòn el viernes 08 de agosto\n[12/08/2025]: Debido a incidencia presentada en la conexión Plus + UAT , no fue posible el paso a producciòn el viernes 08 de agosto, por tanto se proyecta el despliegue para el viernes 15 de agosto\n[20/08/2025]: Despliegue a produccion realizado en 15 de Agosto.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_009",
    "title": "DESARROLLO PREVISIONALES  INCAPACIDADES",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "09/06/2025",
    "endDate": "12/06/2025",
    "observations": "[09/06/2025]: El Objetivo Automatizar el cálculo de incapacidades en el sistema Imagine, replicando el proceso manual actual utilizado por los liquidadores y presentando los resultados en un formato claro y compatible con Excel.\\niniciara  con el desarrollo.\n[11/06/2025]: Mauricio completó la función de cálculo y está terminando el formulario de consulta. Planea entregar el requerimiento completo hoy para subir a pruebas el jueves.\n[13/06/2025]: Ya fue entregado en ambiente de pruebas para validación del cliente. Está funcionando correctamente y aplicando los cálculos según lo solicitado.\n[9/06/2025]: Paso a produccion para el 21 de junio.\n[24/06/2025]: Fala aplazó el paso a produccion para el 5 de julio, debido a que tenían actualizaciones pendientes.\n[07/07/2025]: Igual que Auxilios se paso a producciòn el 5 de julio sin habilitar el menu. Se requiere validación del cliente para habilitar.\n[16/07/2025]: Requerimiento funcional en produccion con el menu habiitado.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_007",
    "title": "CALCULO IBL",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "03/07/2025",
    "endDate": "04/07/2025",
    "observations": "[11/06/2025]: Continuara con el desarrollo tras finalizar  req PRV_2025_001  REVISIÓN DE LIQUIDACIÓN PARA PAGO\n[13/06/2025]:Se programó su inicio para hoy. Mauricio confirmara la estimación del tiempo de desarrollo.\n[16/06/2025]: Se requiere una sesion con Carlos, Jenry, Mauricio y Fabio para entender el detalle de validaciones. Aún no se tiene fecha ni estimación.\n[04/07/2015]:Se inicia desarrollo con  un avance del 20%. Se ajustaron funciones en Postgres para cálculos correctos según las vistas generadas. El siguiente paso es crear la funcionalidad de consulta por cédula o siniestro y desplegar cálculos de acuerdo a la fecha indicada. Se estima finalizar req hoy   para  realizar paso a produccion el  5 de julio.\n[07/07/2025]: Se realizo paso a producciòn el 5 de Julio sin habiitar el menu, Faltan pruebas formales del cliente para habilitación final.\n[11/07/2025]: El 10 de julio se realizó un ajuste para excluir los casos con auxilios funerarios. Ahora, el sistema valida que el origen del caso sea únicamente incapacidad o supervivencia; en caso contrario, se lanza una alerta.\n[16/07/2025]: Se realiza paso a producción el 14 de julio en la noche.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_005",
    "title": "HISTORIA LABORAL",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "07/07/2025",
    "endDate": "09/07/2025",
    "observations": "[11/06/2025]: Continuara con el desarrollo tras finalizar  req  PRV_2025_007 CALCULO IBL\n[07/07/2025]: Inicia desarrollo \n[08/07/2025]: Se reporta un avance del 50 % entre analisis y desarrollo del requerimeinto. \n[09/07/2025]: Se Finaliza desarrollo y se entrega al cliente  para pruebas.\n[14/07/2025]: El 10 de julio se ajustó el reporte para incluir los períodos que existen en Multifondos pero no en Alfa. Adicionalmente, se incorporó una nueva columna que muestra el salario mensualizado proveniente de Porvenir. Los cambios ya fueron implementados y se encuentran listos para validación.\n[16/07/2025]: Se realiza paso a producción el 14 de julio en la noche.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "AJUST_REN_2025_001_1",
    "title": "INCLUIR VALIDACION DOCUMENTAL PARA NUEVO ORIGEN SUSTITUCION PENSIONAL I",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "10/07/2025",
    "endDate": "14/06/2025",
    "observations": "[11/07/2025]: Dado que ya se crearon las tablas de referencia, se finalizó este proceso el día 10 de julio. Queda pendiente validar el impacto que estas puedan tener en los diferentes módulos y consultas del sistema para que el cliente realice las pruebas.\n[14/07/2025]:  El viernes 11 se  valida en ambiente de pruebas los ajustes realizados, confirmando funcionamiento correcto en: cargue de cotización y contratación, gestión telefónica desde call center, exportación del informe de Presidencia y descarga de documentos. Quedan pendientes por validar: envío de correos del portafolio de servicios, envío de comprobantes de nómina y validación de consultas.\\n Hoy se trabajará en los informes que deben reflejar esta nueva parametrización y se verificará si afecta portafolios o comprobantes de nómina.\n[15/07/2025]: El lunes 14 de julio se finalizó el desarrollo del ajuste, se realizaron las pruebas correspondientes con resultados exitosos y se procedió con el paso a producción.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "AJUST_REN_2025_001_2",
    "title": "INFORME DE PRESIDENCIA (Validación Documental Rentas) ",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "10/07/2025",
    "endDate": "10/07/2025",
    "observations": "[10/07/2025]: Se realizaron los ajustes solicitados por el área y estos ya fueron entregados en el ambiente de producción. El cliente efectuó las pruebas correspondientes y confirmó que el ajuste fue aplicado correctamente.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "AJUST_REN_2025_001_3",
    "title": "CAMBIO DE ESTADO DE IMÁGENES PARA RENTAS NO CONTRATADAS",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "16/07/2025",
    "endDate": "17/07/2025",
    "observations": "[15/07/2025]: Se inician ajustes solicitados\n[18/07/2025] Se culminaron los ajustes requeridos por el área, se realiza paso a produccion el 17 de julio.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "AJUST_REN_2025_001_4",
    "title": "VALIDAR INCONSISTENCIA INFORME RENTAS RCMA – DDEP",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "10/07/2025",
    "endDate": "10/06/2025",
    "observations": "[11/07/2025]: EL 10 de julio Se realizaron pruebas por parte de Carlos Rodríguez. Actualmente, el cambio se encuentra pendiente de ser implementado en el ambiente de producción.\n[15/07/2025]:Se realizó el paso a producción el día 14 de julio.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "AJUST_REN_2025_001_5",
    "title": "INCLUIR VALIDACIÓN ADICIONAL PARA RCMA – DDEP.",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "15/07/2025",
    "endDate": "16/07/2025",
    "observations": "[16/07/2025]: Se finaliza ajuste 15 de julio y se realiza despliegue a produccion el 16 de julio en la mañana.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_011",
    "title": "ANS - TABLERO DE CONTROL  - dashboard",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/07/2025",
    "endDate": "24/07/2025",
    "observations": "[18/07/2025]: Se completó el query de base. Se trabaja en selección de librería gráfica compatible con Laravel. Se estima un 20% de avance general.\n[21/07/2025]: Se esta trabajando en las graficas de ANS, se estima terminar el 22 de julio para paso a pruebas UAT\n[24/07/2025]: El [22/07/2025] se continua en gestión del tablero de control ANS, sacaba error en los gráficos, se estima terminar el [23/07/2025] por compromiso con el cliente.\n[23/07/2025]: Se terminan los gráficos del tablero de control.\n[24/07/2025]: Se trabaja en el export de la data de las estadisticas\n[25/07/2025]. Se entrega al área tablero de ANS finalizado, programado subir los cambios para paso a producción el [25/07/2025] a las 5:00 pm",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_002",
    "title": "REPORTE ANEXO 1 (Lentantamiento de requerimiento)",
    "assigned": "CARLOS",
    "state": "Pausado",
    "progress": 60,
    "startDate": "21/07/2025",
    "endDate": "",
    "observations": "[21/07/2025]: Carlos esta adelantando el levantamiento del requerimiento, para proyectar entrega\n[23/07/2025]: Se encuentra en definición con el cliente, para establecer algunas prioridades en los requerimientos siguientes\n[25/08/2025]: Se retoma el levantamiento del requerimiento  y se proyecta entrega a Mauricio para desarrollo el día de mañana, sin embargo, se estan priorizando informes propios de la operación de Imagine.\n[03/09/2025]: Requerimiento en pausa debido a que Imaginex actualmente no cuenta con permisos para creación de vistas, se encuentra en validación por infraestructura para una solución.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_002-1",
    "title": "REPORTE ANEXO 1 (desarrollo )",
    "assigned": "MAURICIO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Fala",
    "detail": "",
    "visible": false
  },
  {
    "id": "PRV_2025_001",
    "title": "Ajuste flujo de  pagos ",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/07/2025",
    "endDate": "22/07/2025",
    "observations": "[21/07/2025]: El [17/07/2025] Se envía correo por parte de Carlos a Seguros Alfa, solicitando modificar 2 vistas:\na. Sipren: Ajustes V_consolidado_reclamaciones_img\nb. Plus: AjustesV_consolidado_tramites_plus\nPendiente presentarlo a comité para efectuar el cambio correspondiente en las vistas.\nEl [18/07/2025], Mauricio realizó un ajuste en el módulo de flujo de pagos, mediante el cual se asocia a cada estado del flujo una ruta u opción de acceso específica. Anteriormente, independientemente del permiso asignado, los usuarios podían visualizar los estados a los que contaban con permiso.\n[23/07/2025]: El 22 de Julio se entrega al cliente  para pruebas, al pendiente de aceptacion  para paso a produccion.\n[24/07/2025]: Se solicita a Mauricio subir los cambios de flujo de pagos modificados en las vistas que actualizò Carlos. Validar los cambios y ajustes requeridos por el cliente en requerimientos ya cerrados para paso a producción.\n[25/07/2025]: Se finalizan los ajustes solicitados por el área (un campo llamado parentesco y mostrarlo en el export, en el Excel que exporta el cliente). Programado subir cambios para paso a producción el [25/07/2025] a las 5:00 pm\n[28/07/2025]: El viernes 25 de julio sobre las 6:00 pm hasta las 7:30 pm se realiza el despliegue a producción.\nEl dìa de hoy se encuentra validando que los cambiosy ajustes en el paso a producciòn están funcionando correctamente.\nSe evidencia que hubo una inconsistencia en los datos que Alfa suministra en el cambio a producción. Se encuentra en validación.\n[01/08/2025]: Se vuelve a validar con Alfa la información reportada en el script, sin embargo, se encuentran a la espera de que el área de producción entregue el DLL que se envió en el despliegue. Por parte de Imagine no hay pendientes.\n[08/08/2025]: El 06 de Agosto a raíz de la reunión con el área Previsionales el día 05 de agosto, surgieron ajustes solicitados por parte del vicepresidente de Alfa.\n1.        Incluir el cálculo IBL dentro del flujo. Validar primero el nombre de las etiquetas.\n2. Convertir en cero al exportar el Excel los valores negativos. Solicitud de Patricia Arteaga\n3. Resaltar el nombre de la columna Pago Total para que se ubiquen los usuarios.\n4. Validar las etiquetas dentro del editar. Falta información\n5. Revisar información que sale en la parte izquierda en el editar, ya que no se sale un valor, según valido Hugo Gómez\n\nEl día de hoy 08 de agosto, se trabaja en en control de cambios en Flujo de pagos solicitado por el Vicepresidente de Alfa.\n[20/08/2025]: Se pasa a producciòn el 16 de agosto",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_003",
    "title": "AVISO A LA RENTA (Levantamiento del requerimiento)",
    "assigned": "Carlos y Cindy",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/07/2025",
    "endDate": "16/08/2025",
    "observations": "[25/07/2025]: Carlos y Cindy estan trabajando en el levantamiento del requerimiento para pasar a Mauricio y que inicie con el desarrollo para que quede en el paso a producción programado para el [25/07/2025] a las 5:00 pm\n[28/07/2025]: El viernes 25 de julio se hace socializaciòn del requerimiento con Mauricio y Jairo.\n[20/08/2025]: El sabado 16 se realizo el paso a producciòn",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_003-1",
    "title": "AVISO A LA RENTA (Desarrollo)",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/07/2025",
    "endDate": "01/08/2025",
    "observations": "[28/07/2025], el viernes 25 de julio, debido a una inconsistencia en el aplicativo ALFASST del área SST con unas ordenes de servicio, se tuvo que dar prioridad y Mauricio no pudo iniciar el desarrollo de Avisos a la renta.\nEl día de hoy, luego de terminar validaciones de paso a producción de otros requerimientos, se inicia desarrollo de este requerimiento.\n[29/07/2025]: Mauricio se enfocarà en terminar el requerimiento completamente.\n[30/07/2025]: Se reporta un avance del 50% en el desarrollo del módulo de avisos de renta. Ya se visualizan los pagos correctamente y quedan pendientes las funcionalidades de notificación, descarga de Excel y eliminación de registros. Se espera finalizar hoy.\n[01/08/2025]: A 31 de julio ya esta por entregar, Mauricio el dìa de hoy mostrara el funcionamiento y el flujo del reporte, para identificar posibles desviaciones y validar si es posible automatizarlo.\n[04/08/2025]: El 01 de agosto quedo funcional el requerimiento, esta proyectado para paso a producción el viernes 08 de agosto\n[13/08/2025]. Se proyecta paso a producción el sabado 16 de agosto.\n[20/08/2025]: Paso a produccion realizado 16 de Agosto.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "Img_2025_001",
    "title": "Validar servidor de contingencia",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/08/2025",
    "endDate": "08/08/2025",
    "observations": "[01/08/2025]: Se realizarà validación del servidor de contingencia el día de hoy, puesto que en meses pasado se presentaron incidencias y debemos garantizar que toda la información se encuentre sincronizada de forma correcta.\n[04/08/2025]: Se programo sesiòn con Wilson y Mauricio para validaciòn y acompañamiento en la sincronización de la contingencia.\n[08/08/2025]: Validación de error de la sincronización de contingencia, con Alfa y Claro - Onpremise\n2. Validación cambio de llaves AWS.\n[12/08/2025]: Se encuentra pendiente ajuste a permisos de carpetas para la sincronización y notificación por correo del error  en la sincronización o éxito en la misma.\nLa reunión del viernes para cambio de llaves AWS, se reprogramo para hoy a las 9:00 am hasta las 10:15 am aproximadamente.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-1",
    "title": "Ajustes modulo auxilios funerario",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/08/2025",
    "endDate": "13/08/2025",
    "observations": "[08/08/2025]: el 05 de Agosto, se realiza acompañamiento en la sesión del área de Previsionales con Blanca Romero, Elizabeth Guerrero y Hugo Gomez, por si surgen dudas u observaciones.\nSe trabaja en informes de Pagos y Auxilios Funerarios.\n\n[11/08/2025]: A raíz de la sesión del viernes surgieron ajustes adicionales:\n1. Incluir el cálculo del IBL dentro del flujo\n2. Convertir en cero al exportar el Excel los valores negativos. Solicitud de Patricia Arteaga\n3. Resaltar el nombre de la columna Pago Total para que se ubiquen los usuarios\n4. Validar las etiquetas dentro del editar. Falta información\n5. Revisar información que sale en la parte izquierda en el editar, ya que no sale un valor, según valido Hugo Gomez.\nEstos puntos ya quedaron gestionados el día de ayer en un 90%, falta culminar:\n- Control de cambios en flujo de pagos\n- Incluir el cálculo del IBL dentro del flujo. Validar nombre de las etiquetas\n\n[12/08/2025]: El viernes hubo incidencia en el cargue del Excel archivo de formalización de Auxilios Funerarios, sin embargo, este ya quedo solucionado. Se continúa trabajando en los ajustes faltantes requeridos por vicepresidencia de Seguridad Social.\n\n[13/08/2025]: Reunión con el área de coordinación y desarrollo para instrucciones de entrega de documentación.\n- Creación de documentos técnicos requeridos por Alfa para paso a comité de cambios el día de hoy 13 de agosto y mañana 14. \n- Ajustes por pruebas de usuario en error de cargue de archivo y mejora de la consulta.\n- Se proyecta paso a producción de aviso a la renta y auxilios funerarios el sabado 16 de agosto.\n[20/08/2025]: El dìa sabado 16 se realiza paso a producciòn",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-2",
    "title": "Ajustes auxilios funerarios y aviso a la renta",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/08/2025",
    "endDate": "14/08/2025",
    "observations": "[14/08/2025]: Ajuste a bugs reportados por el cliente para Auxilios Funerarios y Aviso a la Renta (formatos y consultas). Ya el dìa de hoy se certifico por parte del cliente el paso a producciòn, el cual se progrma realizar por parte de Mauricio el sabado 16 de agosto.\nSe requiriò acompañamiento de Mauricio en las sesiones para solucionar de forma inmediata las inconsistencias, durante las horas de la mañana y tarde.\n[20/08/2025]: EL sabado 16 se realizo paso a producciòn",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-3",
    "title": "Genera  informes generales pagos y auxilios funerarios ",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/08/2025",
    "endDate": "26/08/2025",
    "observations": "[27/08/2025]: El 26 de agosto se trabajo en el desarrollo del informe general de pagos y auxilios funerarios.",
    "unit": "Fala",
    "detail": "Generar un informe con el detalle de mostrar consulta y la trazabilidad de los casos de los procesos entregados a producciòn en semanas anteriores.",
    "visible": true
  },
  {
    "id": "Img_2025_002",
    "title": "Validar servidor de contingencia",
    "assigned": "MAURICIO",
    "state": "En Proceso",
    "progress": 90,
    "startDate": "15/08/2025",
    "endDate": "",
    "observations": "[15/08/2025]: Se reconfiguraron los permisos y Mauricio estarà validando el tema el día de hoy, sincronizaciòn y funcionamiento\n[20/08/2025]: Al 19 de agosto, se encuentra pendiente reporte por parte de Claro informando las actividades realizadas el dìa viernes de acuerdo al refresh de la llave.\nPendiente por parte Mauricio crear .bash para notificar cuando sincronice las bases de datos\n[25/08/2025]: El viernes 22 de agosto se creo el .bash solicitado, sin embargo, se esta presentando una incidencia en la actualización, que no actualiza en la base de datos a diferencia del que corre a las 3 am. Mauricio estará validando otras funcionalidades y en caso de que continue la inconsistencia, se apoyará con Jairo  y Jenry\n[27/08/2025]: El 25 de agosto se valido con tecnologìa el tema de crear una conexión SSH, el día de hoy 27 de agosto, dieron respuesta que se puede realizar sin problema.\n[03/09/2025]: Mauricio indica que queda pendiente el sabado 06 de septiembre validar la sincronizaciòn y Carlos Rodriguez debe realizar la documentación de la sincronización para presentar a Alfa.",
    "unit": "Fala",
    "detail": "Crear .bash para notificar  sincronización en base de datos",
    "visible": true
  },
  {
    "id": "SST_2025_001",
    "title": "Ajustes en servidores QA y PT de ALFASST AWS",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/08/2025",
    "endDate": "28/08/2025",
    "observations": "[29/08/2025]: [25/08/2025]: Los desarrollos para esta aplicación se encontraban detenidos desde el año pasado. Por lo cual los ambientes no se encontraban actualizados y/o con data actualizada para pruebas.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "SST_2025_002",
    "title": "Ajustes en servidores QA y PT de ALFASST AWS",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/08/2025",
    "endDate": "28/08/2025",
    "observations": "[29/08/2025]: [25/08/2025]: Se retomaron las pruebas en los entornos QA y PT para validar nuevos requerimientos y hacer seguimiento al estado de aquellos que aún se encuentran pendientes por ser desplegados en producción.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "SST_2025_003",
    "title": "Ajustes en servidores QA y PT de ALFASST AWS",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/08/2025",
    "endDate": "28/08/2025",
    "observations": "[29/08/2025]: [25/08/2025]: Durante este proceso, se identificaron algunas incidencias en los servidores, por lo que fue necesario realizar ajustes y correcciones técnicas para garantizar un entorno estable que permitiera continuar con la validación de los cambios.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "SST_2025_004",
    "title": "Ajustes en servidores QA y PT de ALFASST AWS",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/08/2025",
    "endDate": "28/08/2025",
    "observations": "[29/08/2025]: [25/08/2025]: Se restablecieron los cronogramas del año vigente en los entornos QA y PT para habilitar el nuevo módulo de profesionales y permitir sus respectivas pruebas.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "SST_2025_005",
    "title": "Validar el modulo de profesionales para que el àrea pueda realizar pruebas",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/08/2025",
    "endDate": "28/08/2025",
    "observations": "[29/08/2025]: [25/08/2025]: Se solucionaron errores en el módulo de profesionales y se realizaron correcciones funcionales.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "SST_2025_006",
    "title": "Accesos y configuración técnica QA ALFASST AWS",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/08/2025",
    "endDate": "28/08/2025",
    "observations": "[29/08/2025]: [25/08/2025]: Se refrescaron claves y accesos, especialmente en el servidor de pruebas, que presentaba problemas de ingreso.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "SST_2025_007",
    "title": "Accesos y configuración técnica QA ALFASST AWS",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/08/2025",
    "endDate": "28/08/2025",
    "observations": "[29/08/2025]: [25/08/2025]: Se ajustó la configuración de pgAdmin para garantizar la conexión con las distintas bases de datos de ALFASST.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_006",
    "title": "Sincronización de estados de casos",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/08/2025",
    "endDate": "28/08/2025",
    "observations": "[29/08/2025]: [25/08/2025]: Se implementó el ajuste para que, al cambiar un caso de estado CORRECCIÓN → REVISADO, se ejecute la sincronización individual del valor, considerando posibles modificaciones.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_0011",
    "title": "Sincronización de estados de casos",
    "assigned": "MAURICIO",
    "state": "Pausado",
    "progress": 60,
    "startDate": "27/08/2025",
    "endDate": "",
    "observations": "[29/08/2025]: [25/08/2025]: Queda pendiente el desarrollo de la sincronización masiva, lo cual implica ajustes en las funciones de sincronización entre bases de datos.\n[03/09/2025]: Requerimiento en pausa debido a que Imaginex actualmente no cuenta con permisos para creación de vistas, se encuentra en validación por infraestructura para una solución.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_008",
    "title": "Flujo de Pagos Control de cambios",
    "assigned": "MAURICIO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "[29/08/2025]: [25/08/2025]: Permitir la modificación del campo VALOR_PAGO en casos específicos, exclusivamente dentro del primer flujo del proceso.\n[03/09/2025]: Requerimiento en pausa debido a que Imaginex actualmente no cuenta con permisos para creación de vistas, se encuentra en validación por infraestructura para una solución.",
    "unit": "Fala",
    "detail": "",
    "visible": false
  },
  {
    "id": "PRV_2025_012",
    "title": "Auxilios Funerarios Control de Cambios",
    "assigned": "MAURICIO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "[29/08/2025]: [25/08/2025]: Sincronizar y actualizar automáticamente la fecha de siniestro según información proveniente de Porvenir.\n[03/09/2025]: Requerimiento en pausa debido a que Imaginex actualmente no cuenta con permisos para creación de vistas, se encuentra en validación por infraestructura para una solución.",
    "unit": "Fala",
    "detail": "",
    "visible": false
  },
  {
    "id": "PRV_2025_010",
    "title": "Aviso a la Renta Control de Cambios",
    "assigned": "MAURICIO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "[29/08/2025]: [25/08/2025]: Incluir en el reporte:\n* fecha_cierre\n* número de solicitud\n* fecha de envío de correo\n[03/09/2025]: Requerimiento en pausa debido a que Imaginex actualmente no cuenta con permisos para creación de vistas, se encuentra en validación por infraestructura para una solución.",
    "unit": "Fala",
    "detail": "",
    "visible": false
  },
  {
    "id": "SST_2025_008",
    "title": "Validación Modulo de Profesionales",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/08/2025",
    "endDate": "28/08/2025",
    "observations": "[29/08/2025]: [25/08/2025]: Se solucionaron errores en el módulo de profesionales y se realizaron correcciones funcionales en ambiente Imagine.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_013",
    "title": "Auxilios Funerarios Control de Cambios Archivo",
    "assigned": "MAURICIO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "[29/08/2025]: [25/08/2025]: Al cargar el archivo de Excel, debe ejecutarse automáticamente el proceso de sincronización asociado.\n[03/09/2025]: Requerimiento en pausa debido a que Imaginex actualmente no cuenta con permisos para creación de vistas, se encuentra en validación por infraestructura para una solución.",
    "unit": "Fala",
    "detail": "",
    "visible": false
  },
  {
    "id": "PRV_2025_014",
    "title": "Aviso a la Renta Control de Cambios Reporte",
    "assigned": "MAURICIO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "[29/08/2025]: [25/08/2025]: Automatizar el envío del informe:\nFrecuencia: todos los viernes a las 6:00 a.m.\nEn caso de festivo, el informe debe enviarse el día hábil anterior.\n[03/09/2025]: Requerimiento en pausa debido a que Imaginex actualmente no cuenta con permisos para creación de vistas, se encuentra en validación por infraestructura para una solución.",
    "unit": "Fala",
    "detail": "",
    "visible": false
  },
  {
    "id": "SST_2025_009",
    "title": "Ajuste modulo profesionales",
    "assigned": "MAURICIO",
    "state": "Pruebas Imagine",
    "progress": 93,
    "startDate": "01/09/2025",
    "endDate": "02/09/2025",
    "observations": "[01/09/2025]: El 30 de agosto Mauricio realizando otras pruebas identifico un error en el modulo de profesionales en el ambiente de pruebas Alfa, por tanto se radica caso el 01 de septiembre para soporte de AWS y se contacta co Oscar Pérez para que nos ayuden con la incidencia reportada. Ya que hasta no sea solucionado no podremos realizar pruebas y el clinte tampoco.\nLa fecha estimada relacionada es solo si nos gestionan en soporte ALFA el día de hoy, de lo contrario se verá afectada y cambiará de acuerdo con la solución del caso radicado.\n[03/09/2025]: El 02 de septiembre queda solucionada la incidencia y queda pendiente realizar pruebas internas antes de entregar a Nohora Carolina de SST para pruebas del área.\n[05/09/2025]: El 04 de septiembre se iniciaron pruebas internas, sin embargo, no fue posible culminarlas debido a una incidenciapresentada con el plan de trabajo en el ambiente QA. \n[08/09/2025]: El viernes 05 de septiembre, Mauricio trabajo en el cronograma en ambiente de pruebas, ya se libero presupuesto pero se esta validando porque no carga actividades y programas.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_015",
    "title": "Creaciòn Vistas en DLL Alfa",
    "assigned": "MAURICIO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "29/08/2025",
    "endDate": "",
    "observations": "[01/09/2025]: El 29 de agosto a Mauricio se le entregaron credenciales por parte de infraestructura Alfa para permisos y creación de vistas en Desarrollo Sipren Plus, sin embargo, permitió coneción preo no la creación de las vistas.\n[03/09/2025]: Requerimiento en pausa debido a que Imaginex actualmente no cuenta con permisos para creación de vistas, se encuentra en validación por infraestructura para una solución.\n",
    "unit": "Fala",
    "detail": "Creaciòn de vistas en ambiente DLL Alfa para desarrollo de requerimientos previsionales",
    "visible": true
  },
  {
    "id": "PRV_2025_016",
    "title": "Actualización Tablero de Estadistica y Cumplimiento",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/09/2025",
    "endDate": "03/09/2025",
    "observations": "[03/09/2025]: [01/09/2025] Mauricio trabaja en la inclusión de la data de Auxilios Funerarios en el tablero de ANS.\n[02/09/2025]: Se trabaja en los graficos de aux funerarios y en la consulta requerida para validar datos de flujo de pagos y aux funerario.\nPendientes pruebas internas para antes de entregar para pruebas por parte del área de previsionales\n[04/09/2025]: el 03 de septiembre el desarrollo del gráfico está en fase final, restando únicamente ajustes de personalización en los tooltips. Se programó una reunión con el cliente para la socialización de avances, debido a que no alcanzo el tiempo, se reprogramo sesión para el jueves 4 de septiembre a las 9:00 am\n\nEl día de hoy 04 de septiembre, se realizan unas pruebas internas antes de entregar al cliente para sus respectivas pruebas y certificaciòn, siendo exitosas. En la sesión al momento de ingresar al aplicativo de pruebas Imagine, el cliente no pudo ya que por politicas de la compañia al parecer les quitaron permisos, se encuentran en validaciòn con el area tecnologica y sin embargo, por parte de Imagine les mostramos el módulo, los graficos, los cambios y los reportes. Se entrega para que apenas tengan acceso puedan validar y confirmar funcionalidad.",
    "unit": "Fala",
    "detail": "Se incluye en las graficas aux funerarios",
    "visible": true
  },
  {
    "id": "Img_2025_004",
    "title": "Conexiones con Ministerio -SAT",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "03/09/2025",
    "endDate": "03/09/2025",
    "observations": "[04/09/2025]: Se identificaron cambios en la configuración, por lo que se programó la reconfiguración de servicios en horas de la tarde.\n",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_017",
    "title": "Consultas y optimización de vistas (Alfa)",
    "assigned": "MAURICIO",
    "state": "En Proceso",
    "progress": 80,
    "startDate": "03/09/2025",
    "endDate": "",
    "observations": "[04/09/2025]: El 03 de septiembre Mauricio trabaja en realizar ajustes en consultas y procesos de automatización. Continúa pendiente la optimización de querys para mejorar el rendimiento general.\n",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "SST_2025_010",
    "title": "Conexiones con Ministerio -SAT Independientes",
    "assigned": "MAURICIO",
    "state": "En Proceso",
    "progress": 90,
    "startDate": "05/09/2025",
    "endDate": "",
    "observations": "[08/09/2025]: El viernes 05 de septiembre, Mauricio trabajo en la restructuración de BD del ambiente local ya que se encuentra desactualizada para realizar pruebas con el Ministerio.\n[10/09/2025]: Durante los días 08 y 09 de septiembre, Mauricio ha trabajado en las conexiones SAT del Ministerio para el requerimiento de independientes.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-8",
    "title": "Solicitar acceso a vistas y tablas",
    "assigned": "CARLOS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "15/08/2025",
    "endDate": "19/08/2025",
    "observations": "[15/08/2025]: El dìa de hoy se tuvo incidencia debido a una restauraciòn de las bases de datos en SIPREN, en ambiente de pruebas, se borraron algunas vistas. Carlos realizó solicitud de nuevo de los permisos para lectura de tablas y vistas en ambiente de pruebas Sipren y Plus de unavez, ya que el dìa de hoy o mañana tambien realizaran restauración de bases de datos.\n[20/08/2025]: Al 19 de agosto ya se encuentran los permisos e Imagine se encuntra en proceso de restauraciòn de las vistas y tablas borradas",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-4",
    "title": "Ajuste Modulo de Pagos 1",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "20/08/2025",
    "endDate": "20/08/2025",
    "observations": "[21/08/2025]: El día 20 de agosto, luego del paso a producciòn y de las pruebas realizadas por el cliente, se identificaron incidencias en los requerimientos que se subiron en el despliegue, para el modulo de pagos, se presentaron las siguientes:\nIncidencia: En el Excel de reportes se estaban duplicando los registros.\nSolución: Se ajustó la consulta  incorporando la condición WHERE status = TRUE para filtrar únicamente los registros válidos.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-5",
    "title": "Ajuste Modulo de Pagos 2",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "20/08/2025",
    "endDate": "20/08/2025",
    "observations": "[21/08/2025]: El día 20 de agosto, luego del paso a producciòn y de las pruebas realizadas por el cliente, se identificaron incidencias en los requerimientos que se subiron en el despliegue, para el modulo de pagos, se presentaron las siguientes:\nIncidencia: Los valores del último pago no coincidían.\nSolución: Se modificó la vista ultimo_pago para incluir el cod_concepto = 2 y se corrigió el cálculo, que anteriormente sumaba pago_total en lugar de valor_concepto.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-6",
    "title": "Ajuste Aviso a la Renta",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "20/08/2025",
    "endDate": "20/08/2025",
    "observations": "[21/08/2025]: El día 20 de agosto, luego del paso a producciòn y de las pruebas realizadas por el cliente, se identificaron incidencias en los requerimientos que se subiron en el despliegue, para aviso a la renta, se presentaron las siguientes:\nIncidencia: Se solicitó revisar el SELECT de la consulta utilizada para el aviso a la renta.\nSolución: Se validó la formulación de la consulta y se confirmó que es correcta.\nNota: Carlos Rodríguez solicitó revisar y analizar el detalle de dicha consulta.\n",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-7",
    "title": "Ajuste Auxilio Funerario",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "20/08/2025",
    "endDate": "20/08/2025",
    "observations": "[21/08/2025]: El día 20 de agosto, luego del paso a producciòn y de las pruebas realizadas por el cliente, se identificaron incidencias en los requerimientos que se subiron en el despliegue, para auxilios funerarios, se presentaron las siguientes:\nIncidencia: Error al cargar el formato Excel de auxilios cuando contiene varias hojas.\nSolución: Se identificó que el sistema solo procesa correctamente la hoja activa. Se intentó ajustar para cargar únicamente esa hoja; sin embargo, por agilidad operativa, se solicita al usuario dejar una sola hoja en el archivo antes del cargue, mediante validación al cargar y un mensaje informativo.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-9",
    "title": "Ajuste Auxilio Funerario",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "20/08/2025",
    "endDate": "20/08/2025",
    "observations": "[21/08/2025]: El día 20 de agosto, luego del paso a producciòn y de las pruebas realizadas por el cliente, se identificaron incidencias en los requerimientos que se subiron en el despliegue, para auxilios funerarios, se presentaron las siguientes:\nIncidencia: Falta de valor del auxilio funerario.\nSolución: Se incluyó un ajuste final que complementa la información con la fecha esto solucionando el 70% del trabajo del analista. Se detectó que no se estaba completando el valor calculado del pago; por ello, se actualizó la condición WHERE para que también actualizara dicho valor.\n",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "PRV_2025_004-10",
    "title": "Ajuste Auxilio Funerario",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "20/08/2025",
    "endDate": "20/08/2025",
    "observations": "[21/08/2025]: El día 20 de agosto, luego del paso a producciòn y de las pruebas realizadas por el cliente, se identificaron incidencias en los requerimientos que se subiron en el despliegue, para auxilios funerarios, se presentaron las siguientes:\nIncidencia: Algunas funciones no fueron desplegadas en producción el día 16 de agosto.\nSolución: Se realizó la creación e implementación de las funciones faltantes en el ambiente productivo.",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "Img_2025_002-1",
    "title": "Validar servidor de contingencia - Tarea 1",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "21/08/2025",
    "endDate": "21/08/2025",
    "observations": "[22/08/2025]: El día 21 de agosto Mauricio se ha encargado de atender tareas asignadas por Jenry para mejorar el tema de control y seguimiento en ambiente de contingencia:\n- Parametrizar el mostrar los tiempos que demora la sincronización",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "Img_2025_002-2",
    "title": "Validar servidor de contingencia - Tarea 2",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "22/08/2025",
    "endDate": "22/08/2025",
    "observations": "[22/08/2025]: El día 21 de agosto Mauricio se ha encargado de atender tareas asignadas por Jenry para mejorar el tema de control y seguimiento en ambiente de contingencia:\n- Crear .bash que muestre los registros de contingencia con producción\n[25/08/2025]: El viernes 22 de agosto se creo el .bash solicitado",
    "unit": "Fala",
    "detail": "Crear .bash para mostrar registros de contingencia en producción",
    "visible": true
  },
  {
    "id": "Img_2025_002-3",
    "title": "Validar servidor de contingencia - Tarea 3",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "21/08/2025",
    "endDate": "21/08/2025",
    "observations": "[22/08/2025]: El día 21 de agosto Mauricio se ha encargado de atender tareas asignadas por Jenry para mejorar el tema de control y seguimiento en ambiente de contingencia:\n- Revisar cada cuanto se sincronizan las imagenes, si cada hora de lunes a viernes",
    "unit": "Fala",
    "detail": "",
    "visible": true
  },
  {
    "id": "Img_2025_003",
    "title": "Restauración BD Pruebas Imagine",
    "assigned": "MAURICIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "21/08/2025",
    "endDate": "23/08/2025",
    "observations": "[22/08/2025]: El día 21 de agosto Mauricio se ha encargado de atender tareas asignadas por Jenry para mejorar el tema de control y seguimiento en ambiente de contingencia:\n- Renombrar las BD en pruebas y restaurar producción\n[25/08/2025]: Entre el viernes 22 y sabado 23 Mauricio realizo la homologaciòn y restauraciòn de las BD",
    "unit": "Fala",
    "detail": "Se requiere realizar la homologación y restauración de las bases de datos en el servidor de pruebas de Imagine, con el fin de garantizar la disponibilidad y consistencia de la información para las validaciones correspondientes, según la solicitud presentada por fala.",
    "visible": true
  }
]