[
  {
    "id": "INTERNO-D001",
    "title": "Radicación Express con IA ",
    "assigned": "DANILO",
    "state": "Pruebas Bolivar",
    "progress": 90,
    "startDate": "27/02/2025",
    "endDate": "",
    "observations": "[28/02/2025]: modificó el script para entrenar con lenguaje natural; el modelo propio (basado en Verner) reconoce respuestas rápidas (ej. segunda opinión médica) tras retirar el destilado. Es ligero y responde rápido. Planea ajustar, subir a dev/test y usar una base preentrenada para optimizar.\n[03/03/2025]: El viernes 28  se subieron las modificaciones  a un repositorio, pero aún falta un cambio que planea terminar y desplegar hoy, tras ajustes adicionales que retrasaron el despliegue inicial a dev y test.\n[04/03/2025]: Ajustó el algoritmo del modelo (impresión y entrenamiento) el día anterior, subiendo los cambios al repositorio, pero falta un ajuste en el API para desplegarlo, ya que se alojará en un servidor distinto al de Oficina Virtual por limitaciones de capacidad; espera terminarlo pronto.\n[05/03/2025]: No ha avanzado más en Radicación Express por priorizar el API de Recobros; habló con Jenry sobre cambios adicionales y planea retomarlo tras finalizar el API esta semana.\n\n[06/03/2025]: Trabajó en una modificación para Radicación Express, pero no la finalizó por requerir más cambios; no dio más detalles ni avances significativos.\n[07/03/2025]: Se detiene ya que se dedicara al API de recobros.\n[10/03/2025]: Detenido ya que se encuentra trabajando en la Lectura de incapacidadaes por Python\n[12/03/2025] : Si es posible y se da el espacio en la sesion de presentación del API de recobros se realizara presentación de este requerimiento. \n[14/03/2025]: Ayer se presentó el avance del proyecto al cliente y Se realizó un ajuste en la implementación, cambiando el modelo de multi-language a una versión en español para mejorar el rendimiento. Este cambio impactó parcialmente el entrenamiento, pero se espera recuperar la estabilidad durante la semana.\n[17/03/2025]: El viernes avanzó en Radicación Express, resolviendo problemas menores, y ajustó la lógica para llevar al usuario al segundo o tercer paso tras confirmar; hoy sigue dedicado a esto, ajustando los datos enviados al formulario para finalizar esa parte.\n[18/03/2025]: Terminó la integración del formulario de Radicación Express con autorizaciones médicas, autocompletando datos (ciudad, IPS, médico) si están completos o dejando en el primer paso si no; hoy subirá los cambios tras reunirse con Jenry para validar o ajustar.\n[19/03/2025]:  Desplegó Radicación Express en test, pero enfrentó problemas de capacidad en el servidor para entrenar el modelo (100 registros fallaron); ajustó el entrenamiento a un registro cada 15 minutos, logrando 3-4 ejemplos ayer, y hoy seguirá entrenando y ajustando.\n[20/03/2025]:Verificó el modelo ayer, ajustó un fallo donde Python mataba el proceso a la mitad, y continuó el entrenamiento (pocos ciclos aún); hoy planea alcanzar 100 ciclos con registros diferentes.\n[21/03/2025]: Revisó el entrenamiento del modelo, que ya superó 100 ejemplos sin problemas ayer; hoy seguirá monitoreando y avanzando en el entrenamiento\n[27/03/2025]: El modelo ya se entrenó con los casos previos y reconoce información; hoy buscará tiempo para añadir 200 registros más para entrenar entre hoy y mañana.\n[28/03/2025]: Ayer  no adiocno\n[28/03/2025]: No revisada ayer por falta de tiempo; hoy planea agregar 500 registros para entrenar y retomar el avance.\n[31/03/2025]: El viernes agregó 173 ejemplos más (total 473 casos); el modelo entrena bien, reconoce 4 de 5 casos con léxico colombiano; hoy o mañana terminará esta tanda y planea sumar 500 registros más.\n[01/04/2025]: Ayer insertó nuevos registros para entrenar el modelo esta semana.\n[09/04/2025]:  Entrenado con 800 casos, listo en test para pruebas por Santiago o usuarios; hoy se entregará oficialmente para pruebas por el cliente, con entrenamiento continuo; estiman 8 días para producción si se prioriza. ",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D002",
    "title": "Lectura de incapacidades por Python",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 95,
    "startDate": "14/02/2025",
    "endDate": "25/02/2025",
    "observations": "[14/02/2025]  Se encuentra ajustando cambio de OCR para minimizar el tiempo de lectura realizando entrenamiento.\n[17/02/2025] Se realizo cambio de OCR, y pruebas\n[18/02/2025] ajustar un modelo diferente a ollama para mejorar la lectura del OCR.\n[19/02/2025] Continuara con los ajustes\n[20/02/2025] Realizar ajustes para hacer una entrega parcial hoy\n[21/02/2025]  En pruebas de entrenamiento al nuevo modelo.\n[24/02/2025]  Organizar datos y consultas e implementarlos en el entrenamiento del modelo para posteriormente pasar a produccion.\n[25/02/2025] Se adelanta las consultas par la construccion del dataset para entrenar el modelo (Bert), despues de terminar la construccion serla a los ambientes y comenzar con el entrenamiento.\n[26/02/2025] Se re ealiza despliegue a produccion el 25 de febrero, se realizara una modificacion  en el dataset  desplegarla  a produccion  para que se encuentre lista para usar, realizar pruebas e iniciar  entrenamiento en las noche.\n[26/02/2025]: Se suben a produccion las modificaciones y al iniciar  el entrenamiento del modelo se presentaron varios inconveniestes encuanto a nombres de facientes y fechas con la data de produccion para lo cual se debio ajustar el dataset.\n[27/02/2025]:se le daran tres ciclos de incapacidades y a medio dia validar cual fue el nivle de aprendizaje.\n[28/02/2025]:Culminó una etapa del modelo, entrenándolo con 2 ciclos (20 registros cada uno), logrando identificar nombre del paciente, fechas y número de incapacidades. Planea entrenar con un dataset más grande en la noche (por uso de RAM) y mejorar la clasificación con datos existentes\n[04/03/2025]: Ayer ajusto los scripts de entrenamiento para que esta semana se pueda entrenar más rápido el modelo.\n[05/03/2025]: Las últimas modificaciones se subieron el viernes 28 de febrero, el modelo se entrena en la noche y los fines de semana cada 6 horas con dataset construido dos horas antes; revisará resultados la próxima semana para evaluar el entrenamiento.\n[10/03/2025]; Se encuentra realizando validaciones a los resutados del entrenamiento de la semana anterior y mejorando el regex mientras el modelo mejora su entrenamiento.\n[11/03/2025]: Está trabajando en un tab para el portal de incapacidades que muestre la información leída por el modelo de IA; planea avanzar lo más posible hoy o terminarlo, sin bloqueos ni dudas reportadas.\n[12/03/2025]: Ya se encuentra ajustado el algorimo de la lectura y se guarda la  información en una tabla para mostrar la información extraida en el aplicativo de incapacidades, hoy se ajustara la vista para mostrar la  información en la consulta de incapacidades.\n[13/03/2025]: Ayer finalizó una vista para mostrar la información procesada por el modelo de IA, con ajustes adicionales completados; hoy espera definir prioridades tras una reunión de las 9 a.m.\n[14/03/2025]: Se presentó el avance del proyecto a un grupo de personas, generando gran interés Se resolvieron dudas sobre la tecnología y se trabajará en una versión más completa.\n[18/03/2025]:  No está trabajando activamente en esto; el modelo se entrena en la noche con un dataset de imágenes, pero con pocos casos aún para mejorar efectividad, y planea revisar pronto el porcentaje de precisión.\n[28/03/2025]: No le dedicó tiempo ayer; hoy buscará agregar más registros para entrenar el modelo. \n[01/04/2025]: Revisó el modelo ayer; avanza poco, pero ajustó el entrenamiento para que sea más rápido sin afectar el servidor; entrena cada 6 horas los fines de semana para aprovechar recursos.\n[09/04/2025]: Entrenado lentamente por recursos limitados (pocos ciclos para no afectar el servidor); lleva 15-20 días así, hoy revisarán su efectividad para decidir si ajustar o buscar alternativas.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-103",
    "title": "Paso de documentos de fs a s3",
    "assigned": "DANILO",
    "state": "Pendiente",
    "progress": 95,
    "startDate": "15/04/2025",
    "endDate": "22/05/2025",
    "observations": "[19/02/2025] se tuvo sesion Con Juan Angel  para validar como hacer la copia de los documentos y se definio un orden para hacer las trasferencias, se programara la tarea para el 20 de Febrero y se validara el 21 de febrero el resultado \n[21/02/2025] La tarea programada para la trasferencia de las imagenes se ejecuto ayer 20 de febrero y hoy se realizara la  validación de  resultados.\n[24/02/2025] Se realizó la validación, pero no se evidenciaron resultados. Se consultará con la persona encargada para determinar la razón por la cual la transferencia no fue exitosa\n[26/02/2025] Se radica ticket MDSB-770619 solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3.\n[27/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[28/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[04/03/2025] No hay avances ni respuestas al ticket  MDSB-770619 sobre el paso de documentos;\n[11/03/2025]: Se comenta el ticket MDSB-770619 solicitando avances en la solicitud o si se requiere alguna información adicional o algún ajuste de nuestra parte para avanzar con la sincronización.\n[13/03/2025]: A un no se obtiene avances del progreso del ticket MDSB-770619.\n[28/03/2025]: Depende de Bolívar para transferir archivos; no hay avances locales por ahora.\n[02/04/2025]: Ayer Infraestructura de Bolivar  realizo la sincronizacion del primer directorio Sincronización de /opt/storage/img04/arp, e indican que seguiran migrando los directorios en las noches ya que generan  afectacion en el servidor.\n[03/04/2025]: Hoy infraestructura  informa la fecha tentativa de finalizacion es el 4 de abril. el dia de hoy estan terminando la carpeta IMG02\n[04/04/2025]: el 3 de abril  en la noche se detuvo la transferencia de documentos debido a que  ocaciono la  caida del servidor a 10:52 pm. \n[07/04/2025]: Confirman finalizacion del paso de documentos, Se solverificar que el tamaño del disco S3 corresponda al mismo del FS.\n[09/04/2025]: De acuerdo a la sesion con infraestructura de bolivar  se  Construira plan de paso Fs a S3, hoy se pasa el faltante y se expone el s3 a producción.\n[10/04/2025]  se confirma paso de toda la informacion MDSB-770619 ",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-64",
    "title": "Api de recobros ",
    "assigned": "DANILO",
    "state": "Detenido Bol",
    "progress": 0,
    "startDate": "27/02/2025",
    "endDate": "07/03/2025",
    "observations": "[24/02/2025] Retomara esta tarea que estaba asignada a Jhoan.\n[26/02/2025] se encuentra pendiente hasta terminnar el desarrollo de la lectura de incapacidadaes por Python\n[27/02/2025]:  Se intentara leer las URLs prefirmadas en T3. y revisar si lo que Joan desarrollo sirve o si se necesita crear una implementación distinta para que funcione bien.\n[28/02/2025]: Avanzó en pruebas; las URL prefirmadas funcionan, pero faltan credenciales completas (Access Key ID y Secret Access Key) para permisos. Dejó un comentario al respecto en el ticket MDSB-766368.\n[03/03/2025]: El viernes se recibe respuesta a un ticket relacionado con credenciales de usuario y una URL prefirmada. Validó que las credenciales funcionaran y logró resolver el tema del usuario quedando pendiente  Implementar la URL prefirmada (o listado de URLs) en la consulta exitosa.\n[04/03/2025]: Avanzó configurando el ambiente en su máquina y revisando la lógica del API; hoy planea implementar el consumo de URLs prefirmadas y dejarlo listo si es posible.\n[05/03/2025] ajustó la recepción de parámetros y consultas del API, corrigiendo errores como la confusión entre siniestro y cédula, y añadió claves \"not found\" para identificar imágenes no disponibles en S3; falta terminar la consulta de facturas y revisar un PATH en tipologías, planeando compartir resultados de incapacidades hoy a las 10 y avanzar en facturas.\n\n[05/03/2025]: No permite conectar al ambiente de desarrollo por el Administrador de Sesiones de AWS se radica ticket MDSB-774334\n\n[06/03/2025]: Ayer por la mañana tuvo problemas de acceso al ambiente por un agente, pero en la tarde probó los cambios en incapacidades, generando URLs prefirmadas con claves \"found\" y \"not found\" (código 200), indicando imágenes no disponibles en S3; hoy planea avanzar en facturas, revisar tipologías y un posible Paht.\n[07/03/2025]: Estandarizó consultas corrigiendo errores de sintaxis y añadió una validación para mostrar un mensaje genérico en errores 500 (con logs internos detallados); ya funciona la búsqueda de facturas, y hoy ajustará y compartirá la búsqueda de tipologías que usa la tabla Nexos para URLs prefirmadas.\n[10/03/2025]: El viernes 7 de marzo finalizo el  requerimiento y reslizo entrega al cliente para  pruebas.\n[12/03/2025] :  Se escala solicitud MDSB-778771 implementar un control de acceso al dominio de imaginex-dev-recobros.segurosbolivar.com.para que únicamente se permita la comunicación desde los siguientes orígenes:\nAPI Gateway de AWS Seguros Bolívar Refactoring ARL:\nSegurosBolivar-Bienestar-ARL-DEV\nSegurosBolivar-Bienestar-ARL-STG\nSegurosBolivar-Bienestar-ARL-PROD\n[13/03/2025]: La solicitud  MDSB-778771 escalada a infraestructura se en cuentra en estado en proceso.\n[18/03/2025]: ayer infroman que los ajustes fueron realizados.\n[20/03/2025]: Dedicó tiempo ayer a privatizar el dominio tras un ticket previo; DEV ya funciona con reglas, y hoy solicitará el dominio de test para avanzar. \n[20/03/2025]: Solicita dominio en el ticket MDSB-783892\n[21/03/2025]: Ayer radicó el ticket MDSB-783892 para solicitar el dominio de test, ya que DEV funciona bien sin errores reportados, Realizara paso a test tan pronto se reciba una respuesta positiva  de la solicitud.\n[26/03/2025]: En el  ticket MDSB-783892 solictan diligenciamiento de información, Danilo envia formato solicitado, confirman la generación del registro.\n[27/03/2025]: Si todo sale bien con Autorizaciones Médicas esta mañana, por la tarde iniciará la implementación del host virtual en test.\n[28/03/2025]: Ayer implementó el host virtual para test y validó reglas con el ticket MDSB-787645, restringiendo acceso al dominio; está avanzado, pendiente de pruebas finales.\n[01/04/2025]:Ticket MDSB-787645 ejecutado con exito, y se escala Ticket MDSB-789767 solicitando  la creación del subdominio imaginex-recobros.segurosbolivar.com. (Produccion).\n[03/04/2025]: Bolívar detuvo el requerimiento hasta aprobar fase 2; sigue avanzando el ticket MDSB-789767 para el DNS, falta completar el formato solicitado con el dato \"value\" (buscará apoyo de Edgar hoy).\n[04/04/2025]: Se resolvió el ticket MDSB-789767  pendiente para la creación del DNS en producción, aunque la funcionalidad aún no está habilitada, Esto se hizo para evitar retrasos cuando se autorice el paso a producción.",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "INTERNO-D003",
    "title": "Comprimir información del body de la tabla cola_correos",
    "assigned": "DANILO",
    "state": "Detenido Bol",
    "progress": 0,
    "startDate": "31/03/2025",
    "endDate": "",
    "observations": "[01/04/2025]: Ayer trabajó en comprimir el body de la tabla cola_correos; una extensión externa logró un 25-26% de compresión (32 GB en producción), pero no tiene soporte para Postgres 15.5; propuso un script en Python que reduce hasta 50%, aunque se evita depender de scripts por ser implementación adicional; sigue en evaluación.  \n[02/04/2025]: Se define que antes de implementar cualquier cambio, se debe consultar con el cliente (Bolívar). Se discutirán los resultados obtenidos y se determinará si la solución es aceptable. Se sugiere la alternativa de utilizar un trigger en la base de datos, lo que permitiría comprimir y descomprimir automáticamente los datos sin necesidad de modificaciones en el código de la aplicación. Esto simplificaría la implementación y reduciría la carga de desarrollo.\n[03/04/2025]: De acuerdo a la sesion con Bolivar, quedó pendiente enviar la especificación técnica a Leidy para escalarla a tecnología y aprobar la solución propuesta por imagine (compresión del 25-26% o script al 50%); redactará el correo hoy con Jenry.  \n[09/04/2025]: Pendiente de confirmación de Bolívar sobre la solución propuesta; Jenny sugirió pasarlo a producción, pero requiere una implementación (1 semana estimada)",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": " MDSB-707440/GD772-74",
    "title": "Portal reembolsos ARL (FLUJO YII)",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "02/05/2025",
    "endDate": "14/05/2025",
    "observations": "[03/03/2025]: Iniciara despues de finalizar el req GD772-83 Boton Glosa parcial del total de la factura \n[10/03/2025]; Inicia con el desarrollo.\n[11/03/2025] : Inicio bajando el sitio, pero no avanzó mucho debido a que  Jenry le asignó otro requerimiento (Captura de datos e informe).\n[21/03/2025]:Se iniciara con el desarrollo despues de cerrar el req GD772-72 Requerimiento Captura de datos e informe (Reembolsos).\n[27/03/2025]: Continuará con este requerimiento tras subir GD772-72 a test; no reportó avances ayer.\n[28/03/2025]: Iniciará hoy tras subir GD772-72 a test; no avanzó ayer.\n[02/04/2025]: Espera reiniciar despues del medio dia con el req. \n[10/04/2025]: Se realizaron cambios menores previos a la activación. Se planea iniciar la activación hoy del req.\n[11/04/2025]:  tiene el ambiente listo pero no ha iniciado código; espera mostrar avances esta tarde.\n[14/04/2025]: tiene el ambiente listo pero no ha iniciado código,Informa que a un no ha reactivado el req.\n[11/08/2025]: Aprueban control de cambios en comite de cambios digitales y se ejecutara hoy 11 de agosto a las 4:20pm\n[20/08/2025]: El requerimiento ya fue implementado y migrado a producción el jueves 14 de agosto. Se estabilizó el viernes y quedó consolidado en la rama máster.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-780227",
    "title": " Duplicación de actividades en Nativo",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/03/2025",
    "endDate": "16/06/2025",
    "observations": "[18/03/2025]: No alcanzo a revisar la duplicación de casos; hoy analizará los radicados por buzón (flujo correcto pero con actividades duplicadas), y podría crear un comando si no encuentra la causa.\n[19/03/2025]: Revisó ayer por la mañana la duplicación de actividades en Nativo sin encontrar errores en el código; hoy continuará investigando la causa.\n[20/03/2025]: Se detiene para darle pioridad al req GD772-92 - Malla CUPS en Nativo.\n[03/04/2025]: Continua detenida ya que se debe dar prioridad al Req GD772-84 Comunicaciones gestión de aportes sin afiliacion (masivos).",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-87",
    "title": "Implementar en laravel  la autenticación con QR ",
    "assigned": "JESUS",
    "state": "Paso A Produccion",
    "progress": 97,
    "startDate": "31/01/2025",
    "endDate": "12/02/2025",
    "observations": "[03/02/2025]  Generacion de la Vista del codigo de 2 pasos en login de Bolivar\n[05/02/2025]  Se mostraran avances para el 7 de Febrero\n[07/02/2025] Inicia encriptación de datos, sesion  a 4pm hoy  para mostrar  avances en dev \n[10/02/2025] Quitar  la  autorecuperación  del QR.\n[12/02/2025] Se sube a dev el login de laravel\n[21/02/2025]: se debe incluir a donde se envia el correo de recuperación.\n[24/02/2025]:  se escaló el control de cambios a test con el ticket MDSB-768688.\n[25/02/2025]:   Se encuentra pendiente creacion de req caja para asociarlo al control de cambios y se de la aprobacion de QA.\n[28/02/2025]: Pendiente creacion de requerimiento caja de parte de Bolivar, Imagine reaizara el envio del manual de usuario. \n[03/03/2025] : El dia viernes 28 de febrero  Bolivar crea el requerimiento caja GD772-87 para adjuntarlo al control de cambios MDSB-768688 en test y continuar con el proceso.\n[04/03/2025]: Control de cambios MDSB-768688 se encuentra en estado aprobacion QA de Bolivar.\n[05/03/2025]: Control aprobado por QA, Control de cambios ejecutado con éxito \n[06/03/2025]: Subió el doble factor a test ayer, pero no compara bien el código del Authenticator; sospecha confusión por claves en Develop o un fallo en la librería, y lo revisará hoy.\n[07/03/2025]: El doble factor no valida bien el código; ayer descartó conflictos en Develop borrando registros, y hoy investigará si es la librería o el dominio compartido.\n[10/03/2025]. El viernes 7 de marzo identifico que la hora del servidor de tets esta adelantada respecto a la hora del celular, quedo ajustado.\n[21/03/2025]: Pendiente resultado de pruebas de Bolivar y el visto bueno para realizar  paso a produccion.\n[26/03/2025]: Bolivar informa que el resultado de las pruebas las enviaran la semana del 31 de marzo y confirman la  implementación en los 2 aplicativos (Nativo y Yii)\n[03/04/2025]:Bolivar tiene  programadas para el 3 y 4 de abril con diferentes perfiles de usuario, de acuerdo al resultado solicitaran  paso a producción la próxima semana.\n[10/04/2025]: Bolívar autorizó ayer iniciarlo en test para los ambientes de Yii y nativo\n",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-87 ",
    "title": "Implementar en Yii y Nativo  la autenticación con QR ",
    "assigned": "JESUS",
    "state": "Paso A Produccion",
    "progress": 97,
    "startDate": "14/04/2025",
    "endDate": "24/04/2025",
    "observations": "[14/04/2025]: Se estima iniciar con la implementación tras terminar con los ajustes del req GD772-84.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-116",
    "title": "Requerimiento gestión Medicamentos fase 2 - Sprint 2",
    "assigned": "JESUS",
    "state": "Pruebas Imagine",
    "progress": 95,
    "startDate": "18/06/2025",
    "endDate": "11/07/2025",
    "observations": "   [09/06/2025]: Estimación inicial de desarrollo  9 dias\n[16/06/2025]: Se acordó iniciar el desarrollo el 18 de junio, una vez se finalicen tareas pendientes de giras\n[20/06/2025]:El 19 de junio finalizó el punto 2,continuara con el punto 3.\n[25/06/2025]:El desarrollo avanza en el punto 4 de la fase 2 (creación de tipología y actividades). Se ha completado aproximadamente el 40% del requerimiento \n[27/06/2025]: [27/06/2025]: Se reporta un avance del  60%.\n[02/07/2025]:Se avanza en un 75% del desarrollo de la Fase 2 de Medicamentos. Ya se encuentra funcional la creación individual de casos con su trazabilidad completa cuando un proveedor indica no entrega. Se han realizado pruebas exitosas en flujo y visualización. Actualmente se trabaja en la gestión masiva desde Excel para validar múltiples casos simultáneamente y asegurar la correcta apertura e identificación de cada uno. Pendiente finalizar el manejo masivo y ajustes en bandejas administrativas.\n[04/07/2025]: El desarrollo alcanza un 85% de avance. Ya se construyó la generación de carta para proveedor nuevo. Queda pendiente recibir el modelo de carta de cancelación y completar dos botones adicionales. La validación masiva vía Excel fue pospuesta para el final \n[07/07/2025]: Avance parcial durante el viernes 4 de julio en una nueva funcionalidad vinculada a botones de acción. Se priorizó el análisis de flujos con doble actividad y se atenderá el requerimiento de medicamentos durante la jornada de hoy, se estima entrega de desarrollo 8 de julio.\n[09/07/2025]: El desarrollo se encuentra en su fase final, aunque ha experimentado algunos retrasos debido a revisiones relacionadas con otros temas. Actualmente, hay una duda funcional pendiente sobre el comportamiento del botón “Copiar y Reabrir Caso”, la cual está en revisión.Se solicitará el respectivo control de cambios para realizar las pruebas en el ambiente de test.\n[09/07/2025]: Se escala control de cambios en test bajo el jira MDSB-844308.\n[10/07/2025]: Control de cambios MDSB-844308 ejecutado con éxito.\n[11/07/2025]: : El desarrollo fue completado y subido a TES. Se agregó retroalimentación para la carga masiva de Excel. Está pendiente desarrollar la pestaña de trazabilidad y adjuntos, que fue solicitada en reunión con el cliente. Las plantillas de correo fueron entregadas y se está integrando para las pruebas.\n[16/07/2025]: Avanza la estabilización con enfoque en mejoras de experiencia de usuario. Faltan validaciones en gestión y pequeñas correcciones funcionales. Plantillas ya están disponibles.\n[18/07/2025]: Se completó el flujo y ajustes hallados en las pruebas de medicamentos.\n[23/07/2025]: Se realizaron los ajustes solicitados, los cuales incluyen la separación de vistas en pestañas para mejorar la organización de la información, así como la inclusión de botones para la gestión de casos relacionados.\n[30/07/2025]: El día 28 de julio se realizó la entrega del desarrollo al cliente, quien iniciará el proceso de pruebas.\n[14/08/2025]: El cliente ha dado su visto bueno para realizar el paso a producción del requerimiento.\n[15/08/2025]: Se solicita al cliente proporcionar un listado similar al que habitualmente cargan los proveedores, preferiblemente con un volumen considerable, con el fin de realizar pruebas de carga en el aplicativo.\n[20/08/2025]: Cliente envia Archivo solicitado.\n[25/08/2025]: Se identificó riesgo de saturación del sistema si se procesa en línea. Se propuso implementar un proceso en segundo plano con validaciones y notificación por correo al finalizar.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-116_2",
    "title": "Encolar cargue de reporte de entrega efectiva  mayor a 1000 registros ( Medicamentos fase 2 - Sprint 2)",
    "assigned": "JESUS",
    "state": "En Proceso",
    "progress": 0,
    "startDate": "25/08/2025",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "Se recibió un archivo con 13.000 registros para actualización masiva. Se identificó riesgo de saturación del sistema si se procesa en línea. Se propuso implementar un proceso en segundo plano con validaciones y notificación por correo al finalizar.",
    "visible": true
  },
  {
    "id": "INTERNO-JE001",
    "title": "Realizar Imagen de docker de nativo para Jesus",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "[27/02/2025]: No se ha podido realizar  debido que se encuentra en otras tareas asignadas.",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "GD772-100",
    "title": " Cambio de flujo radicación de facturas EPS",
    "assigned": "JAIRO",
    "state": "Detenido Bol",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "INTERNO-JA001",
    "title": "Mejora informe glosa req GD772-104 Campos glosa aceptada y glosa conciliación",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "23/05/2025",
    "endDate": "17/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA002",
    "title": "Restablecimiento de contraseña en Laravel",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/06/2025",
    "endDate": "27/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-81",
    "title": "Calificador automático (1) ",
    "assigned": "JESUS",
    "state": "Pruebas Bolivar",
    "progress": 90,
    "startDate": "28/04/2025",
    "endDate": "",
    "observations": "[13/08/2025]: El 8 de agosto, el cliente reporta una incidencia en el envío físico. Tras la validación, no se evidencia el error, por lo cual se solicita una sesión para realizar una prueba conjunta y evidenciar la situación. La sesión queda programada para el 14 de agosto a las 10:00 a.m.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D004",
    "title": "Migración S3 y aplicaciones a EBS",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "29/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D005",
    "title": "Ajustar los portales para ser responsive ",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 5,
    "startDate": "05/05/2025",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-109",
    "title": "Lectura de nuevos datos de ordenes medicas  con IA",
    "assigned": "DANILO",
    "state": "Entrenamiento",
    "progress": 70,
    "startDate": "14/05/2025",
    "endDate": "",
    "observations": "[11/08/2025]: El viernes 8 de agosto se agregan nuevos registros para entrenamiento. Se prevé entregar esta semana un porcentaje estimado de precisión del modelo.\n[20/08/2025]: El 15 de agosto se agregó nueva información de órdenes médicas para entrenamiento. El modelo ya alcanza más del 70% de efectividad en lecturas. Se prevé que con poca información adicional quede listo para uso.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE002",
    "title": "Desarrollo clasificador de imágenes en Python (IA)",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 80,
    "startDate": "15/05/2025",
    "endDate": "",
    "observations": "[16/05/2025] : Ya se encuentra  funcional en local, Se planteó la necesidad de buscar imágenes similares almacenadas en el disco compartido (IMG04) para   realizar  pruebas\n[19/05/2025] : el clasificador de imágenes está en ambiente de prueba, pero aún se requieren imágenes para probarlo adecuadamente. Se discute la posibilidad de generar imágenes desde archivos PDF si no se encuentran imágenes reales\n[26/05/2025]: El Viernes 23 de mayo se implemento en el lector de PDF,  clasifica correctamente los archivos visuales, pero aún no segmenta adecuadamente los PDFs por tipo, agrupándolos en una sola carpeta. Se continuarán pruebas con PDFs diversos para refinar la lógica de clasificación.\n[28/05/2025]: Las pruebas realizadas con el clasificador de archivos PDF no han alcanzado los resultados esperados. Se evalúan otras opciones, pero el enfoque actual está en la funcionalidad de Sistematización con IA (Segunda vista de incapacidades en portal).",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-812862",
    "title": "Jira dia a dia Descarga masiva de imágenes (Nativo)",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "INTERNO-JE003",
    "title": "Implementar cambio de contraseña a 30 dias en los tres aplicativos",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "INTERNO-JE004",
    "title": "Sistematización con IA (Segunda vista de incapacidades en portal)",
    "assigned": "JESUS",
    "state": "En Proceso",
    "progress": 60,
    "startDate": "26/05/2025",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA003",
    "title": "Validación Informes de cuentas medicas y colas de procesamiento",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "29/05/2025",
    "endDate": "27/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-69_4",
    "title": "Hacer contrato api incapacidades",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/06/2025",
    "endDate": "26/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE005",
    "title": "Validaciòn CASO 31016845, no pasa  de estado radicaciòn (Incapacidades)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "10/07/2025",
    "endDate": "10/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-69_1",
    "title": "TEST Extraccion de Imagenes ( API) (Incapacidades)",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 95,
    "startDate": "02/07/2025",
    "endDate": "07/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-69_2",
    "title": "DEV Extraccion de Imagenes ( API) (Incapacidades)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "09/06/2025",
    "endDate": "26/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": " MDSB-707440/GD772-74_1",
    "title": "Generación de plantillas de cartas (glosa total, glosa parcial, devolución) Para Reembolsos ARL",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "07/07/2025",
    "endDate": "11/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA004",
    "title": "Automatización cuentas medicas con IA",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 20,
    "startDate": "03/06/2025",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA005",
    "title": "Mejoras informe  total  producto Salud ",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "15/07/2025",
    "endDate": "21/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA006",
    "title": "Mejoras informes  por radicado producto Salud ",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/06/2025",
    "endDate": "03/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-60",
    "title": "Descarga automatica de informes",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "11/06/2025",
    "endDate": "25/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D006",
    "title": "Monitoreo de carga y alertas del servidor",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 90,
    "startDate": "10/06/2025",
    "endDate": "12/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "CNTI-271",
    "title": "Vulnerabilidad, CVE-2016-4055 – DoS por expresiones regulares ineficientes en Moment.js (< v2.11.2)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "13/06/2025",
    "endDate": "24/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-69",
    "title": "Error de acceso en test con TLS y certificados ( Api incapacidades)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/07/2025",
    "endDate": "02/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "CNTI-195",
    "title": "Vulnerabilidad, Implementación insegura de la integridad de los recursos secundarios (SRI) / imaginex",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/06/2025",
    "endDate": "09/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-69_3",
    "title": "Documentacion APi incapacidades (Seguridad)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/07/2025",
    "endDate": "27/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "CNTI-96",
    "title": "Vulnerabilidad,La política de seguridad de los contenidos contiene la directiva “unsafe” / imaginex",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "13/06/2025",
    "endDate": "29/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-W001",
    "title": "Sistema automatizado de clasificación de correos médicos con IA",
    "assigned": "WILSON",
    "state": "En Proceso",
    "progress": 85,
    "startDate": "05/06/2025",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-114",
    "title": "ADICIONAR INFORMACIÓN DE TENGO DUDAS DE MIS REEMBOLSOS AL INFORME CONSOLIDADO",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-F3",
    "title": "Crear cuenta en GitHub con correo corporativo",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/08/2025",
    "endDate": "19/08/2025",
    "observations": "[19/08/2025]: Se crea cuenta \" PruebasImagine\"",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-833556",
    "title": "CDC-T, req GD772-60 Descarga automatica de informes",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "19/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "CNTI-271_1",
    "title": "Pruebas,Vulnerabilidad, CVE-2016-4055 – DoS por expresiones regulares ineficientes en Moment.js (< v2.11.2)",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "19/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-F001",
    "title": "Desarrollo de informe interactivo de requerimientos",
    "assigned": "FABIO",
    "state": "En Proceso",
    "progress": 80,
    "startDate": "12/06/2025",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-F002",
    "title": "Pruebas listas blancas para factor de doble autenticación",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-F003",
    "title": "Solicitud accesos ambiente Dev y Test (Jenry)",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "25/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-835580 ",
    "title": "Jira dia a dia  ajustar actividades caso  31012936 incapacidades",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/06/2025",
    "endDate": "25/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE006",
    "title": "Apertura de flujo  de 4 casos de Preautorizaciones poliza salud - delegacion analistas creados con una sola actividad",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/06/2025",
    "endDate": "25/06/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-F004",
    "title": "Pruebas Sistematización con IA (Segunda vista de incapacidades en portal)",
    "assigned": "FABIO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "MDSB-837144",
    "title": "CDC-P, req GD772-60 Descarga automatica de informes",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/06/2025",
    "endDate": "03/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE007",
    "title": "Validaciòn apertura de dos actividades en un mismo caso en Nativo",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 80,
    "startDate": "04/07/2025",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-838905",
    "title": "Jiras dia dia Inhabilitar 3 tipologias a 3 usuarios ",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "03/07/2025",
    "endDate": "03/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-842592",
    "title": "jira dia a dia, Cambiar planilla de ingresos en oficina virtual ARL",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "07/07/2025",
    "endDate": "07/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-835432",
    "title": "Jira dia a dia Error en cargue de anexos de casos",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "04/07/2025",
    "endDate": "07/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA007",
    "title": "Levantamiento nueva máquina virtual,",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/07/2025",
    "endDate": "09/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA008",
    "title": "Devolver a Seguimiento para firmeza el radicado 30949303",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/07/2025",
    "endDate": "08/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA009",
    "title": "Corregir CC a los  casos 31010548 - 31010549 en pensiones",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/07/2025",
    "endDate": "08/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA010",
    "title": "Revisión  devolución de facturas pensionados",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 20,
    "startDate": "21/08/2025",
    "endDate": "",
    "observations": "[20/08/2025]: Requiere retomarse. Se definió como prioridad continuar después de finalizar el req GD772-123 Asignación y Gestión de Tareas en la Solución de Cuentas Médicas, ya que implica rehacer parte de la tabla de facturas de devolución y validar nuevamente con control de cambios.\n[22/08/2025]: Avance estimado en 20%. Se fusionó rama de máster y se está ajustando la consulta para filtrar correctamente los casos listos para evolución.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-116_1",
    "title": "Pruebas  gestión Medicamentos fase 2 - Sprint 2",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "11/07/2025",
    "endDate": "17/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D007",
    "title": "Validaciòn del CRONTAB / Tareas duplicadas",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/07/2025",
    "endDate": "14/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D008",
    "title": "Vlidaciòn de herramientas IA (Google Cloud / Bolivar)",
    "assigned": "DANILO",
    "state": "Pendiente",
    "progress": 15,
    "startDate": "18/07/2025",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-119",
    "title": "Hablador ficha de solicitudes médicas",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "21/07/2025",
    "endDate": "21/07/2025",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-120",
    "title": "Bloqueo de facturas radicadas con información sensible y de manejo confidencialº",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 90,
    "startDate": "30/07/2025",
    "endDate": "04/08/2025",
    "observations": " Se implementó una restricción inicial para que ciertas facturas solo sean visibles por usuarios autorizados; se requiere un módulo administrativo para gestionar esta configuración.\n[30/07/2025]: Se tiene previsto iniciar el desarrollo el día de hoy\n[01/08/2025]: Se encuentra en desarrollo un administrador para gestionar el bloqueo de facturas. Se ha implementado la lógica, pero falta probar la interfaz administrable. El avance fue estimado en un 60%\n[04/08/2025]:Se escaló el control de cambios MDSB-858377 al ambiente de pruebas (test) y fue ejecutado correctamente. A continuación, se procederá con las pruebas en dicho entorno.\n[06/08/2025]: Desarrollo en el ambiente de pruebas desde 4 de agosto.\n[11/08/2025]: Pendiente implementación de otro control para asignar permisos solo a usuarios autorizados; se espera completarlo para pasar a pruebas en TEST.\n[12/08/2025]: Se escala a test el control de cambios MDSB-862990, el cual se encontraba pendiente. Control de cambios ejecutado con exito.\n[13/08/2025]: Se realizó un cambio en el bloqueo de facturas y se tiene pendiente subir un ajuste de código adicional antes de enviarlo a pruebas\n[20/08/2025]: Se encuentra en fase de pruebas. Se ajustó la validación para permitir el ingreso de múltiples usuarios asociados a una factura. Se evalúa la mejor forma de almacenar esta relación (tabla relacional o arreglo).\n[22/08/2025]: Pendiente modificación de query para permitir múltiples usuarios por factura (actualmente solo admite uno).\n[25/08/2025]: Se identificó la necesidad de crear una tabla de relación muchos-a-uno para habilitar acceso de múltiples usuarios a una factura. El avance depende de la radicación de un ticket en JIRA.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-121",
    "title": "Identificar notas crédito radicadas por los prestado como estado nota crédito",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": " Se planteó la creación de un nuevo estado llamado “Cruce de notas crédito” para mejorar la clasificación y control de estos registros.",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "INTERNO-D009",
    "title": "Script para uso de aplicaciones ",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/07/2025",
    "endDate": "24/07/2025",
    "observations": "Se reallizar un script para analizar el uso de las aplicaciones por sitio.\n[21/07/2025]: Se revisar el contexto del script y confirmar con Alejandro si ya está implementado correctamente en proteccion.\n[30/07/2025]: Script implementado  en produccion el 24 de julio ",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D010",
    "title": "Carga excesiva en servidor de portales",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "22/07/2025",
    "endDate": "23/07/2025",
    "observations": "[23/07/2025]: Se ha detectado una saturación de recursos en el servidor durante la ejecución de procesos masivos, particularmente durante el cargue de incapacidades. Este es un problema de comportamiento intermitente, asociado al procesamiento en tiempo real que realiza la aplicación. Actualmente, se está evaluando la posibilidad de enviar estos procesos a colas asíncronas como alternativa para reducir el impacto en los recursos del sistema. Sin embargo, esta solución podría afectar negativamente la experiencia del usuario final al introducir demoras perceptibles. Como medida prioritaria, se recomienda solicitar una ampliación de los recursos de infraestructura (memoria RAM y CPU), lo cual se considera la solución más adecuada para mantener la eficiencia del sistema sin comprometer la experiencia del usuario.\n[30/07/2025]: El alto consumo de recursos en el portal ya fue analizado y explicado. No se requiere intervención adicional, por lo que este punto se considera cerrado.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA011",
    "title": "Mejoras informe EPS",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "22/07/2025",
    "endDate": "25/07/2025",
    "observations": "[23/07/2025]: Se inició la validación del query asociado al informe EPS, con el objetivo de optimizar las consultas SQL involucradas. Esta optimización busca reducir el consumo de recursos y mejorar los tiempos de respuesta, manteniendo al mismo tiempo una estructura común y reutilizable para todos los informes. Como parte del plan de trabajo, se espera que el informe EPS esté ajustado y en producción antes del viernes.\n[25/07/2025]: Se completó el query principal del informe EPS y se encuentra en fase de pruebas, con un avance estimado del 50%.\n[28/07/2025]: Query principal terminado, se espera subirlo a producción para pruebas con datos reales hoy  antes del mediodía.\n[30/09/2025]: El informe fue desplegado en producción con formato de prueba. Se corrigieron errores detectados durante la validación (especialmente en el formato de horas). Actualmente se encuentra en fase final de pruebas para habilitar completamente su funcionamiento.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE008",
    "title": "Inconsistencia en cargue de proveedores Yii",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "23/07/2025",
    "endDate": "24/07/2025",
    "observations": "Al cargar un archivo que contiene varias filas con la misma cédula de ciudadanía (CC), solo se conserva o registra la última fila, y las anteriores se pierden del sistema.\n[25/07/2025]:El día 24 de julio se realizaron los ajustes correspondientes a las validaciones, quedando el proceso de cargue completamente funcional en test",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-851497",
    "title": "Jiras dia dia  Validar tipologia  Gestion Tercero Sin Poliza\" no Genera informe por tipologia.",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "23/07/2025",
    "endDate": "23/07/2025",
    "observations": "[25/07/2025]: El 23 de julio se realizó la validación correspondiente y se identificó que el módulo no muestra información disponible para descarga, debido a que la tipología \"Gestión Tercero Sin Póliza\" no incluye en su flujo la actividad de generación de respuesta. Esta actividad es una condición necesaria para que una tipología sea considerada dentro del informe de tipologías",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE009",
    "title": "Funcionalidad para inhabilitar modificación de tipologías en Nativo",
    "assigned": "JESUS",
    "state": "En Proceso",
    "progress": 70,
    "startDate": "",
    "endDate": "",
    "observations": "Es necesario restringir cambios en tipologías una vez el portal esté activo, para evitar errores en procesos dependientes.\n[04/08/2025]: El juenes 31 de julio se inactiva el menú de modificación de tipologías ubicado en Radicador > Administración, dejando habilitada únicamente la opción disponible en Radicación Workflow para un conjunto específico de cédulas de ciudadanía (CC). La intención es crear o mejorar la funcionalidad de administración de tipologías en la nueva aplicación de Nativo, la cual se planea actualizar próximamente",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE010",
    "title": "Ajuste cargue masivo de marcacion  efectiva ",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/07/2025",
    "endDate": "25/07/2025",
    "observations": "[25/07/2025]: Se identificó que el proceso de cargue masivo de marcación efectiva no estaba tomando la línea 2 del archivo. Ante esta situación, se realizaron las modificaciones necesarias y, tras los ajustes, el cargue quedó funcional.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE011",
    "title": "Queries de informacion gestion tipologia ",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/07/2025",
    "endDate": "",
    "observations": "[25/07/2025]: Se generaron los queries solicitados para cinco datos claves y están listos para ser revisados en conjunto con el equipo.\n[28/07/2025]:La información requerida fue generada en su totalidad el día viernes 25 de julio.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-F005",
    "title": "Creacion manual medicamentos fase 2 sprint 2",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/07/2025",
    "endDate": "25/07/2025",
    "observations": "[25/07/2025]: Se culminó la elaboración del manual de usuario, el cual será entregado junto con el requerimiento el día 28 de julio, se envia a Jenry y Liyibet para su validaciòn ",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D011",
    "title": "Trasferencia de imagenes pendientes del S3  al FS",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/07/2025",
    "endDate": "25/07/2025",
    "observations": "[28/07/2025]: Se identificaron imágenes pendientes en S3 que no estaban en el FS; se realizó validación y transferencia para corregir la sincronización.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA012",
    "title": "Gestión de imágenes en módulo Cartera",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/07/2025",
    "endDate": "25/07/2025",
    "observations": "[28/07/2025]: Se identificó que al mover archivos a la carpeta de fecha no se completaba el proceso; se implementó un script para validar y restaurar imágenes,",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA013",
    "title": "Gestión de imagenes buzón ARL",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/07/2025",
    "endDate": "29/07/2025",
    "observations": "[28/07/2025]: El dia viernes 25 de julio  a Danilo le escalaron  un error donde casos radicados el 25 no cargaron imágenes ni se registraron en base de datos; se revisaron logs sin hallar causa, Jairo  iniciara validaciòn  para la implementaciòn del script implementado en las imagenes del modulo de cartera.\n[30/07/2025]: Las imágenes fueron adjuntadas manualmente por el cliente, por lo tanto, se da por cerrada la incidencia reportada",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D012",
    "title": " Plan de trabajo IA – Radicación Express",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/07/2025",
    "endDate": "28/07/2025",
    "observations": "[28/07/2025]: Pendiente reunión con Jairo y Liyibet para definir plan de trabajo, tema prioritario que requiere asignación clara de tareas y etapas.\n[30/07/2025]: Plan ya redactado y revisado por Jenry y Jairo. Solo falta envío formal.\n\n",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-849170",
    "title": "Modalidades de trabajo – error en cargue\n",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/07/2025",
    "endDate": "29/07/2025",
    "observations": "Usuaria indica que al momento de realizar el cargue masivo de trabajadores en el portal de arl le presenta un error cuando carga el documento de Excel\n[29/07/2025]: Después de realizar varias validaciones, se identificó que el error que impedía el cargue del archivo correspondía a que el sistema estaba considerando el campo \"Teléfono\" como obligatorio. Como medida correctiva, se eliminó dicha obligatoriedad, y con ello el cargue del archivo ya puede realizarse correctamente.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-844641",
    "title": "Jiras dia a dia (Eliminar funcionarios inactivos - Informe Efectividad)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "29/07/2025",
    "endDate": "29/07/2025",
    "observations": "De la manera más atenta agradezco su apoyo con la eliminación de los funcionarios relacionados a continuación en el informe de efectividad, estos usuarios ya fueron inactivados y se eliminaron del área, sin embargo sigue evidenciándose.\n[29/07/2025]: Se realizó la corrección en la consulta del informe, ya que anteriormente no discriminaba si el usuario se encontraba activo o desactivado.Para solucionar esto, se adicionó la condición que permite identificar a los usuarios desactivados, asegurando así la correcta generación del informe.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-849734",
    "title": "Jiras dia a dia (Caso 38709479 sigue en la badeja del usuario despues de gestionado)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "29/07/2025",
    "endDate": "29/07/2025",
    "observations": "[29/07/2025]: Se realizó la validación correspondiente y se identificó que el caso se visualizaba en la bandeja de pendientes debido a la existencia de actividades pendientes. Dado que la gestión del caso ya había finalizado, se procedió con el cierre de dichas actividades, permitiendo así que el caso fuera retirado de la bandeja",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-853919",
    "title": "Jiras dia a dia (Reaperturar caso 39308376)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "29/07/2025",
    "endDate": "29/07/2025",
    "observations": "[29/07/2025]: De acuerdo a  la  solicitud  se abre actividad Gestiona Caso para el  caso 39308376",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE012",
    "title": "Creación de Script para Anulación de Casos Asociados a un Cargue Masivo",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "30/07/2025",
    "endDate": "01/08/2025",
    "observations": "Se requiere desarrollar un script que permita anular automáticamente todos los casos individuales creados a partir de un proceso de cargue masivo, en los escenarios en que dicho cargue masivo sea anulado por el usuario o administrador.\n[30/07/2025]: Se tiene previsto iniciar el desarrollo el día de hoy, Jenry indica que se deben elinimar los casos de la bd  y no dejarlos  ocupando espacio.\n[04/08/2025]:El viernes 1 de agosto se finalizó el query que elimina correctamente el caso y su imagen para los casos nuevos de masivos. Actualmente, se está construyendo el script que permitirá realizar un borrado controlado de las imágenes asociadas a casos antiguos en estado 'Anulado'..\n[06/08/2025]: Se desarrolló comando para eliminar 300.000 casos anulados uno a uno. El proceso está en ejecución y ha eliminado más de 100.000 registros en el ambiente producctivo.\n[11/08/2025]: Anulacion de casos completa en produccion, se iniciara  paso a  produccion de la  funcionalidad.\n[12/08/2025]: Se realiza el paso a producción y se ejecutan pruebas, las cuales arrojan resultados exitosos",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D013",
    "title": "Caso radicado desde el portal sin registros (archivo faltante reportado por Leidy)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 50,
    "startDate": "29/07/2025",
    "endDate": "",
    "observations": "[30/07/2025]: Ayer se identificó un caso radicado sin registros asociados. Se presume que pudo haberse presentado una falla durante el guardado de archivos por problemas de horario. El análisis quedó pendiente para continuar hoy, validando si los archivos fueron cargados y asociarlos manualmente si corresponde.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-853188",
    "title": "Jiras dia a dia ( Se Cambian los archivos adjuntos al caso 39349883 y 39345375",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "29/07/2025",
    "endDate": "30/07/2025",
    "observations": "[30/07/2025]: se evidenció que, durante el cargue de anexos, el sistema recibió de manera simultánea dos archivos asociados a casos diferentes, lo que provocó un conflicto de escritura en la carpeta correspondiente al día. E. la opción que permite adjuntar documentos en el momento de radicar el caso. Como medida correctiva, se implementó un ajuste en el sistema para que, en adelante, los documentos se guarden uno por uno y en el orden exacto en que se reciben, evitando así cualquier sobrescritura o cruce de archivos entre casos.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D014",
    "title": "Repositorio y comunicación por host virtual (Actualizaciòn nativo)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "29/07/2025",
    "endDate": "06/08/2025",
    "observations": "[30/07/2025]: Se tiene un avance del 80% en la configuración del repositorio de despliegue y del esquema de publicación mediante host virtual. Faltan ajustes finales de redirección y certificados para habilitar la publicación formal\n[01/08/2025]: Ayer  31 de julio se dejó funcionando una nueva aplicación en un contenedor Docker con una versión de PHP distinta a la del servidor principal. Este entorno está destinado a pruebas del nuevo desarrollo liderado por Jesús. Se presentaron errores de conexión por falta del archivo .env, que deben solucionarse antes de avanzar.\n[06/08/2025]:Se identificó pérdida de permisos al reconstruir el contenedor. Se analizó la causa y se tiene claridad en la solución. Se continuará con su ajuste en el transcurso del día, Alfinalizar  el dia confirma finalizacion del ambiente y funcional.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D015",
    "title": "Modelo híbrido De almacenamiento de archivos (FS + S3)",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 20,
    "startDate": "29/07/2025",
    "endDate": "",
    "observations": "[30/07/2025]: Se está explorando un modelo híbrido de almacenamiento entre FS y S3. FS almacenaría temporalmente, S3 como histórico (>30 días).\n[01/08/2025]: El tema aún no ha sido abordado ni discutido con Bolívar. Se está a la espera de su decisión respecto a la implementación de días hábiles y detalles del modelo.\n[04/08/2025]:  Se dejó en pausa para atender el requerimiento del informe de reembolsos.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-123",
    "title": "Asignación y Gestión de Tareas en la Solución de Cuentas Médicas",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 65,
    "startDate": "12/08/2025",
    "endDate": "",
    "observations": "[13/08/2025]: Se inició el 12 de agosto con la adaptación de la bandeja a un formato más interactivo según los requerimientos solicitados. La prioridad está en entregar la funcionalidad de asignación antes que otros entregables. Se continúa con ajustes a consultas y pruebas.\n[20/08/2025]: Se trabajó en la bandeja, realizando ajustes visuales y validaciones con Henry. Falta incluir los registros antiguos y revisar a fondo la parte de asignación, por lo que el avance se estima en un 50%.\n[22/08/2025]: Se presentó la vista inicial con filtros y gráficas. Avance inicial, pendiente la implementación de la lógica de asignación de casos.\n\n[25/08/2025]: Se avanzó en la mejora de la bandeja y se incluiran dos temas pendientes relacionados con inconsistencias: “sí” e “inconsistencias: no”. \n",
    "unit": "Varbo",
    "detail": "**Requisitos de Asignación y Gestión de Tareas en la Solución de Cuentas Médicas**\n\nEste documento detalla los requisitos específicos para la funcionalidad de asignación y gestión de tareas dentro de la solución de cuentas médicas, El objetivo es asegurar una distribución eficiente, equitativa y trazable de las solicitudes de cuentas médicas, optimizando los tiempos de respuesta y la operatividad.\n\n**1. Configuración de ANS y Priorización de Solicitudes**\n\nLa solución debe permitir:\n\n**● Parametrizar el Acuerdo de Nivel de Servicio (ANS)** para cada tipo de solicitud de cuentas médicas (ej. Pronto Pago, Glosa), asegurando que el sistema priorice las tareas según estos parámetros.\n\n**● Priorizar la asignación en bandeja por fecha de radicado**, mostrando desde el más antiguo al más reciente en la primera vista y manteniendo los pendientes ordenados de lo más antiguo a lo más nuevo. Esta priorización debe ser rápida y eficiente, sin demoras en la búsqueda u ordenamiento, reflejando la fecha de radicado de Sisalud.\n\n**● Priorizar las solicitudes próximas a vencer** según el ANS parametrizado, considerando la fecha de radicación.\n\n**2. Asignación de Tareas por Radicado**\n\nLa solución debe asegurar que la asignación de tareas se realice de la siguiente manera:\n\n**● Generar la asignación por número de radicado**, no por factura individual.\n\n**● Asignar sin fraccionar las facturas**: Todos los radicados asociados a una misma factura deben ser asignados a una única persona, garantizando la continuidad en la gestión.\n\n**● Parametrizar el tiempo de cada actividad** para incorporarlo en el plan de trabajo y en la asignación.\n\n**● Respuestas a glosa**: Deben asignarse automáticamente al usuario que generó la glosa (o al área correspondiente, como auditoría médica). Si el usuario está inhabilitado (ej. por vacaciones), el sistema debe reasignar a otra persona del mismo perfil, considerando la carga de trabajo pendiente.\n\n**3. Filtrado y Visualización de Bandejas**\n\nLa plataforma debe contar con las siguientes capacidades de filtrado y visualización:\n\n**● Crear un filtro de cantidad** que muestre el número de facturas con respuesta a glosa, escalados, pronto pago y los pendientes de cuentas médicas.\n\n**● Permitir filtrar la bandeja por la condición deseada** (ej. fecha de radicación, del más antiguo al más reciente), manteniendo el filtro activo hasta que el usuario desee desactivarlo.\n\n**● Habilitar filtros por rango de fechas** en todas las pantallas.\n\n**4. Reasignación Flexible y Equitativa**\n\nLas bandejas de trabajo deben permitir la reasignación con las siguientes características:\n\n**● Reasignar sin perder la equidad** en la distribución de la carga de trabajo.\n\n**● Reasignar de forma individual o masiva por**: perfil, usuario, proveedor, complejidad, ramo, tipo de servicio, valor, fechas de radicación y pronto pago.\n\n**● Reasignar por distribución de cargas o no**, sin existir bloqueante para el administrador.\n\n**● Permitir asignar a una persona específica o distribuir equitativamente** entre usuarios correspondientes al mismo perfil.\n\n**● Los casos reasignados deben visualizarse en la bandeja respetando la antigüedad y ** original del registro.\n\n**5. Depuración y Actualización de Bandejas (Imagine)**\n\nSe requiere que la solución realice una depuración automática de las bandejas de Imagine de la siguiente manera:\n\n**● Realizar depuración de las bandejas de Imagine solo dejando las facturas en periodo vigente.**\n\n**● Si la factura fue pagada según reporte de Sisalud en un 90%**, dejarla en estado inactivo. En caso de que llegue una conciliación, reactivar y reasignar.\n\n**● Si la factura está en estado pagado en Sisalud totalmente**, dejarla en estado pagado.\n\n**● Si la factura está en estado glosado en Sisalud**, dejarla en estado glosado.\n\n**Si la factura está en estado pagado glosado**, dejarla en estado glosado.\n\n**● Si el radicado se encuentra en estado anulado en Sisalud**, realizar el cruce con Sisalud para conocer el número de radicado con el que se pagó.\n\n**● Todas las facturas deben continuar con los perfiles actuales** del administrador (como reasignar facturas, cambios de ramo según usuario), sin que exista ningún bloqueante.\n\n**● Permitir habilitar y deshabilitar los ramos para cada usuario**, incluyendo la opción de tener acceso a dos ramos si es necesario, bajo gestión del administrador.\n\n**● Permitir la habilitación del capacity por usuario y por perfil**: el administrador podrá parametrizar cuántos casos puede gestionar el usuario por día. Si se supera el capacity definido, se deberá generar una alerta.\n\n**● Los perfiles deben estar atados al ramo a trabajar**. El administrador debe poder asignar o reasignar facturas según necesidad. En el momento en que se cambie de ramo, no puede continuar habilitado para que se le asignen facturas que no corresponden a este. A partir de la asignación del ramo por parte del administrador, Imagine no debe asignar un ramo diferente al perfil.\n\n**6. Equidad en la Asignación y Control de Reglas\n\nLa asignación debe garantizar:**\n\n**● Equidad**: Es decir, igual o similar número de radicados para cada analista, teniendo en cuenta el tipo de servicio y la complejidad en la asignación sin perder las reglas de negocio establecidas. El contador debe considerar el acumulado para lograr radicados similares.\n\n**● Validación de Reglas del Motor**: Se deben validar nuevamente las reglas del motor para baja, media y alta complejidad según monto y tipo de servicio. Se revisará la tabla de reglas del motor que trabaja Imagine.\n\n**7. Tableros de Control y Reportería Detallada**\n\nLa solución debe ofrecer las siguientes herramientas de monitoreo:\n\n**● Tableros de control y gestión con base en reportes de Sisalud.** Se buscaría acceso a Sisalud Salud.\n\n**● Permitir que el administrador pueda actualizar los radicados** sin necesidad de solicitar apertura a la factura y que quede la traza de los dos radicados, definiendo una regla para decidir de forma automática con cuál se pagó.\n\n**● Reportes para administrador y analistas** del número de casos realizados, en tiempo real, acumulado, día, mes, año. Se basarán en el cruce de Imagine y Sisalud para lo gestionado y lo escalado. Deben indicar cuántos casos le faltan para cumplir la meta.\n\n**● Para cartera, que se pueda visualizar una marca y filtrar** por la misma de facturas ya conciliadas y/o con paz y salvo.\n\n**● Debe existir un tablero o un informe** que indique cuántos radicados está gestionando cada usuario por día, que muestre los tiempos de gestión para cada\n\nradicado, poder validar los pendientes al momento de la consulta y una gráfica de la gestión realizada día a día.\n\nDe forma atenta me permito enviar solicitud de creación de carpetas para cada uno de los auditores con el fin de que las distribuciones de las facturas sean equitativas para los que tienen perfil de enfermería y a los médicos les sean asignadas las cuentas iguales o mayores a $50.000.000.\n\nCon respecto a la respuesta a glosa, lo ideal es que le sea asignada a la persona que revisó. En sus inicios debería ser asignada a mi bandeja ya que el usuario que está revisando las facturas es el mío y posterior cuando empiecen a llegar las respuestas de las vistas por cada uno de los usuarios, a ellos mismos.\n\n**A continuación, relaciono los perfiles con la parametrización requerida.**\n\nCARGOCCNOMBREPerfilProfesional en enfermería55069610Claudia Lorena Montealegre GarciaAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería53108492Sandra Patricia Aranzales OchoaAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería1010204648Diego Ferney Castellanos FlórezAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería39813915Maria Marcela Bermudez TautivaAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería93.237.264Edwin Giovanni Ayala PavaAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería53048074Leidy Tatiana Figueroa MorenoAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en medicina1020792806Brandon Arevalo BernalAuditor de cuentas iguales o > $50.00.000 de forma aleatoria indiferente del proveedorProfesional en medicina36068234Astrid Lliana Muñoz AñazcoAuditor de cuentas iguales o > $50.00.000 de forma aleatoria indiferente del proveedorProfesional en medicina39789340Sandra Zoraya Munevar AvilaAuditor de cuentas iguales o > $50.00.000 de forma aleatoria indiferente del proveedor",
    "visible": true
  },
  {
    "id": "MDSB-856002",
    "title": "jiras dia a dia (Generar listado de usuarios de cada aplicativo)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "30/07/2025",
    "endDate": "31/07/2025",
    "observations": "[31/07/2025]: Se genera informaciòn solicitada.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-122",
    "title": "habilitar la extensiónes xls, xlsx, xlsm, xltx, xltm y xlt  para la tipología tengo dudas reembolsos, internacional y nacional",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/08/2025",
    "endDate": "05/08/2025",
    "observations": "[05/08/2025]: Se habilitan las extensiones .xls y .xlsx en la tipología 'Tengo dudas - Reembolsos', en ambiente de producción",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-124",
    "title": "Creación Ficha de actualización de datos y quiero ser proveedor al portal de cuentas médicas",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "**CREACIÓN DE TIPOLOGÍAS PORTAL CUENTAS MÉDICAS**\\r\\n\\r\\n\\r\\nSe requiere agregar a una ficha de actualización de datos y quiero ser proveedor al portal de cuentas médicas.\\r\\n\\r\\nPortal de proveedores: \\r\\n \\r\\nSe requiere que cuando se de clic en el portal de proveedores al escoger la lista de tipologías  se agregue una denominada “ Actualice sus datos”\\r\\n\\r\\n\\r\\n\\r\\nAl seleccionar la opción actualice sus datos en el segundo paso se deben ver los siguientes campos:\\r\\n\\r\\n**2.1 INFORMACIÓN PERSONAL: ( Botón actualizar datos )**\\r\\n\\r\\n2.1.1; Nit del proveedor ( Solo caracteres numéricos sin dígito de verificación)*\\r\\n2.1.1 Nombre Comercial ( Sólo caracteres alfanuméricos)\\r\\n2.1.2 Dirección ( Campo alfanuméricos) En este campo debe existir un hablador que indique lo siguiente “ Incluya barrio, carrera, calle, número o cualquier otra información relevante para la ubicación “\\r\\n\\r\\n**2.2 TELÉFONOS DE CONTACTO**\\r\\n\\r\\n2.2.1 Teléfono personal ( Campo numéricos)\\r\\n2.2.2 Celular personal (Campo numéricos)\\r\\n2.3.2 Correo electrónico personal\\r\\n\\r\\n**2.3 CANALES DIGITALES**\\r\\n\\r\\n2.3.1 Lineas de whatsapp ( este campo debe permitir agregar más datos) ( Campo numérico)\\r\\n2.3.2 Teléfono consultorio ( Esta opción debe permitir agregar más teléfonos ) ( Campo numéricos)\\r\\n2.3.3 Correo de agendamiento\\r\\n2.3.4 Link de agendamiento\\r\\n2.3.5 Comentarios adicionales \\r\\n\\r\\n\\r\\nLos datos de gestión son los mismo relacionados anteriormente?\\r\\n\\r\\n\\r\\nEsta tipología en el segundo paso se debe ver de la siguiente manera:\\r\\n\\r\\n\\r\\n\\r\\nal dar clic en siguiente debe habilitar el campo de adjuntos, para esta tipología se requiere que el adjunto sea opcional no lleva nombre puede denominarse otros adjuntos.\\r\\n\\r\\n**FLUJO EN IMAGINE**\\r\\nUna vez el proveedor actualice la información o diligencie los datos debe suceder lo siguiente: (yii)\\r\\n\\r\\nAbrir un caso en imagine indicando cual es el dato que cambia del proveedor( este dato se debe marcar en un color diferente a la bandeja)\\r\\n\\r\\nImagine debe almacenar la información de los proveedores en un informe , en este informe debe visualizarse la información por fechas:\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\nEn el portal se debe precargar la información de los proveedores para la primera consulta bajo la siguiente estructura.\\r\\n\\r\\n\\r\\n\\r\\nUna vez el proveedor realice la modificación de datos en el aplicativo el sistema imagine almacenará el más reciente y este será el que le mostrará al proveedor para las siguientes consultas.\\r\\n\\r\\nEn la generación de respuesta se debe habilitar un campo en el que el actor responsable de respuesta pueda indicar en un campo de texto la respuesta tal como funciona actualmente en el aplicativo dudas reembolso:   \\r\\n\\r\\nRespuesta Generica\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n\\r\\n**QUIERO SER PROVEEDOR (flujo 2)**\\r\\n\\r\\n\\r\\nSe requiere agregar al portal de cuentas médicas la opción quiero ser proveedor, en el cual al escoger esta opción deberá mostrar los siguientes datos:\\r\\n\\r\\n\\r\\n**Producto o servicio ofrecido:** campo text area- Obligatorio\\r\\n\\r\\n**tipo de documento : Campo desplegable con :** C.C, C.E, NIT, PP, - Obligatorio\\r\\n\\r\\n**Número de documento :** Campo numérico - Obligatorio\\r\\n\\r\\n**Nombres y apellidos o razón social:** campo alfanumérico - Obligatorio\\r\\n\\r\\n**Teléfono de contacto:**  Campo numérico - Obligatorio\\r\\n\\r\\n**Correo de contacto:**  campo alfanumérico - Obligatorio\\r\\n\\r\\n\\r\\nUna vez el proveedor  diligencie los datos debe dar clic en siguiente y pasar al paso de adjuntos: \\r\\n\\r\\n\\r\\nAl dar clic en siguiente debe habilitar el campo de adjuntos, para esta tipología se requiere que el adjunto sea obligatorio y debe denominarse propuesta de servicios , puede agregar más adjuntos.\\r\\n\\r\\n\\r\\nA nivel de flujos : \\r\\n\\r\\nAbrir un caso en imagine con un flujo predeterminado el cual debe ser parametrizable en cuanto actores\\r\\n\\r\\nel usuario en la bandeja debe poder ver todos los datos que fueron diligenciados por el proveedor en el portal \\r\\n\\r\\nEn la gestión del caso se debe poder almacenar en un campo el servicio ofrecido por el proveedor a campo de texto, en la gestión del caso\\r\\n\\r\\nEn la generación de respuesta se debe habilitar un campo en el que el actor responsable de respuesta pueda indicar en un campo de texto la respuesta tal como funciona actualmente en el aplicativo dudas reembolso:   \\r\\n\\r\\n\\r\\n\\r\\n\\r\\nadicional a esto debe permitir adjuntar archivos los cuales se relacionarán en la respuesta , este adjunto no es obligatorio\\r\\n",
    "visible": false
  },
  {
    "id": "CNTI-96-1",
    "title": "Validar rechazo Vulnerabilidad CNTI-96  en cuanto a unsafe-inline y unsafe-eval ",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/08/2025",
    "endDate": "11/08/2025",
    "observations": "[01/08/2025]: El 31 de julio se recibió un rechazo a la respuesta de la  vulnerabilidad CNTI-96 mitigada anteriormente. Se acordó revisar el caso nuevamente y gestionar la situación con las personas encargadas del tema de seguridad (SSP) para obtener validación.\n[04/08/2025]: El día viernes se respondió indicando que es necesario validar con la persona encargada de infraestructura, ya que no contamos con el JIRA de aprobación solicitado.\n[11/08/2025]: Se revisará nuevamente con el cliente debido a inconformidad con la respuesta inicial, justificando técnicamente las medidas tomadas.\n[20/08/2025]: El 11 de agosto el requerimiento quedó resuelto. Se implementaron componentes de seguridad adicionales y el área de seguridad validó la solución.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D016",
    "title": "Implementacion de almacenamiento temporal de imágenes",
    "assigned": "DANILO",
    "state": "En Test",
    "progress": 85,
    "startDate": "01/08/2025",
    "endDate": "12/08/2025",
    "observations": "[01/08/2025]:  Se detectó pérdida de imágenes al realizar cambios de infraestructura. Se propuso implementar un almacenamiento temporal de imágenes (buffer de contingencia por al menos 5 días) para evitar pérdida de información crítica en futuras contingencias.\n[04/08/2025]: El viernes 1 de agosto se trabajó parcialmente en la radicación ARL y autorizaciones, pero fue interrumpido por otras tareas.\n[11/08/2025]: Tarea pendiente de ejecución; se espera completarla en la jornada actual.\n[12/08/2025]: Se realiza implementaciòn en ambiente de pruebas.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-855985",
    "title": "Jiras día a día (Corrección de casos radicados del buzón ARL sin trazabilidad)",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 0,
    "startDate": "31/07/2025",
    "endDate": "01/08/2025",
    "observations": "[01/08/2025]: Se identificaron 78 casos (de un total de 306 observados) que quedaron en estado incompleto debido a una falla en la trazabilidad del sistema. Se desarrollo un script para completar la asignación de tipología y restablecer su curso normal.\n\n",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-126",
    "title": " Bloquear la radicación de facturas por primera vez Colsubsidio",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "04/08/2025",
    "endDate": "04/08/2025",
    "observations": "Se solicita bloquear la radicación de facturas por primera vez al NIT 860007336, Colsubsidio, lo anterior por cierre de EPS.\n[04/08/2025]:Se realiza el bloqueo del NIT 860007336 (Colsubsidio) y se despliega en los ambientes de prueba (test) y producción.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-127",
    "title": "Bloqueos radicación prestadores, paz y salvo",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/08/2025",
    "endDate": "06/08/2025",
    "observations": "Por cierre de EPS Bolívar se requiere que se bloquee la radicación de primera vez y respuesta a glosa para este ramo EPS de los prestadores relacionados en adjunto, con dichos prestadores se cuenta con paz y salvo por todo concepto.\n[05/08/2025]: Se esacla control de  cambios para ambiente de pruebas MDSB-859020. Control de cambios ejecutado con exito.\n[06/08/2025]: Se desarrollo se encuentra en ambiente de test para pruebas y aprobaciòn del cliente.\n[08/08/2025]: Se escala control de cambios MDSB-861215 para producciòn. \n[11/08/2025]: Control de cambios en proceso de Aprobación QA / PO / Jefatura.\n[13/08/2025]: Control de cambios aprobado por comite y se ejcutara el 13 de Agosto a las 4 pm:\n[19/08/2025]: El 13 de agosto se ejecuta con exito el control de cambios en produccion\n[20/08/2025]: El requerimiento fue migrado a producción el 14 de agosto y se encuentra estable en operación.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA014",
    "title": "Mejoras Informe consolidado ARL",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 30,
    "startDate": "21/08/2025",
    "endDate": "",
    "observations": "[11/08/2025]: Estima iniciar con las mejoras.\n[13/08/2025]: Se pausa  para continuar con req GD772-123 Bloqueo de facturas.\n[20/08/2025]: No se ha iniciado el desarrollo, aunque se identificó que el informe actual presenta tiempos de descarga altos (13–21 minutos). Se mantiene pendiente por priorización.\n[22/08/2025]: Se organizó el query, avance 30%. Faltan pruebas para validar resultados y definir ajustes.",
    "unit": "Varbo",
    "detail": "Se solicita la validación del informe debido a demoras identificadas en su tiempo de ejecución",
    "visible": true
  },
  {
    "id": "INTERNO-JA015",
    "title": "Mejoras Informe consolidado SALUD",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "Se solicita la validación del informe debido a demoras identificadas en su tiempo de ejecución",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "INTERNO-D017",
    "title": "Ajuste en Radicación Express",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/08/2025",
    "endDate": "01/08/2025",
    "observations": "[04/08/2025]:  El viernes 1 de agosto se detectaron causísticas no contempladas; se ajustó el modelo para mejorar la detección. Se validó el modelo, se reentrenó y se probaron registros.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D018",
    "title": "Mejoras del analisis  informe de reembolsos Salud",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 70,
    "startDate": "01/08/2025",
    "endDate": "",
    "observations": "[04/08/2025]: El viernes 1 de agosto se construyó un script para envío diario de análisis a correos configurables. Aún requiere depuración.\nMejorar analisis en pdf \n[11/08/2025]: Pendiente de mejora: generar el informe en PDF con información organizada y gráficos, reemplazando el archivo plano actual, Se retomara tan pronto finalice la Implementacion de almacenamiento temporal de imágenes.\n[22/08/2025]: Implementación en un 70%. Ya se mejoró la presentación y estilos (PDF), se añadieron KPIs y metas SLA, pero faltan ajustes finales antes de liberar a producción.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "CNTI-488",
    "title": " Big Redirect Detected (Potential Sensitive Information Leak)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "04/08/2025",
    "endDate": "05/08/2025",
    "observations": "[04/08/2025]: Se recibió información técnica sobre las vulnerabilidades (Redirect). No se han validado completamente pendiente de análisis\n Resuelto en produccion \n[06/08/2025]:Se resolvió la vulnerabilidad reportada en el manejo del error 302. La solución fue implementada el 05 de agosto y ya está en producción. Se enviaron las evidencias correspondientes.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JA016",
    "title": "Restringir la creación de usuarios en yii con igual correo",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/08/2025",
    "endDate": "08/08/2025",
    "observations": "[06/08/2025]: Se definió implementar validación en Yii para prevenir creación de nuevos usuarios con correos existentes. Afectará solo nuevos registros\n[11/08/2025]: El viernes 8 de agosto se implementó en el ambiente de pruebas (test) la restricción para la creación de usuarios con el mismo correo en YII. Se confirma paso a produccion.\n[22/08/2025]: Se realizan pruebas en produccion y se verifica que a un no está implementada la restricción.\n[22/08/2025]: Se realiza paso a produccion.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE013",
    "title": "Validar recuperacipon de contraseña para el  usuario 101010",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 60,
    "startDate": "06/08/2025",
    "endDate": "",
    "observations": "[08/08/2025]: El 6 de agosto se realizó la validación y se identificó que, en el ambiente de pruebas (test), al momento de efectuar la recuperación de contraseña, el sistema redirige directamente al login. Este comportamiento será revisado en conjunto con Danilo.\n[11/08/2025]: La redirreciòn ya no se presenta, Funcionalidad operativa en otros entornos, pero sin retroalimentación visual en TEST. Pendiente revisión para evitar que el error pase a producción.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-856527",
    "title": "jiras dia a dia (Error en cargue de adjuntos nativo)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/08/2025",
    "endDate": "05/08/2025",
    "observations": "[05/08/2025]:  La incidencia se originó debido a que el aplicativo reemplazaba los adjuntos al momento de su cargue, por coincidencias en los nombres de archivo. Como medida correctiva, se implementó la adición de un identificador único en el nombre de cada adjunto, lo que evita la sobrescritura y asegura que cada documento se almacene de forma independiente.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE014",
    "title": "Optimización de reporte \"General de pendientes\" en Nativo",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 0,
    "startDate": "11/08/2025",
    "endDate": "",
    "observations": "[06/08/2025]: Se identificó problema de rendimiento en el código. Se solicitará apoyo a Jairo para reutilizar funciones existentes y optimizar el informe.\n[08/08/2025]: La optimizaciòn se realizara en la nuenva version de nativo  tras realizar la Actuallizaciòn nativo a PHP 8 en local.\n[11/08/2025]: Inicia optimización del informe.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-860939",
    "title": "jiras dia a dia (Inactivación de 266 usuarios en Nativo)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/08/2025",
    "endDate": "08/08/2025",
    "observations": "[08/08/2025]: Se realiza la inhabilitación de los usuarios solicitados.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE015",
    "title": "Actuallizaciòn nativo a PHP 8 local",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/08/2025",
    "endDate": "08/08/2025",
    "observations": "[08/08/2025]: Se está realizando la instalación de la nueva aplicación en el entorno local\n[11/08/2025]: El viernes 8 de Agosto se configuró entorno local y Docker con nueva versión de PHP",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-861385",
    "title": "Jiras día a día (Reemplaza adjunto cargado en la radicación)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/08/2025",
    "endDate": "11/08/2025",
    "observations": "[11/08/2025]: Se identificó que el problema se debía a que, al cargar un nuevo archivo, este quedaba con el mismo nombre del archivo utilizado en la radicación, lo que provocaba su reemplazo. Como medida correctiva, se implementó la adición de un identificador único al nombre de cada archivo al momento de su cargue, con el fin de evitar coincidencias y sobrescritas.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE016",
    "title": "Control y Validación de Correos ARL vs Casos Radicados en Imagine",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "13/08/2025",
    "endDate": "14/08/2025",
    "observations": "[12/08/2025]: Se asigna el requerimiento y se solicita proporcionar una estimación para su desarrollo.\n[14/08/2025]: Se implementa un reporte vía correo que informa la cantidad de correos ingresados al buzón, los que fueron radicados en YII, los excluidos y la diferencia con error. Esta diferencia con error corresponde a los correos cuyo estado debe ser validado. \n[15/08/2025]: El paso a producción permanece pendiente debido a que, al momento de realizar el despliegue, se presentan bloqueos en la URL\n[20/08/2025]: Actualmente se trabaja en el ajuste del query de validación, dado que se identificó una interpretación errónea en la exclusión de correos.\n[22/08/2025]: En revisión. El informe se está generando, aunque con retraso (pedido de un mes hacia atrás). Pendiente verificación de resultados.\n[25/08/2025]: Reporte encuentra en produccion y llega a diario a las 6 am.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-D019",
    "title": "Pruebas de carga en entorno simulado de producción",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "12/08/2025",
    "endDate": "13/08/2025",
    "observations": "[12/08/2025]: Se prepararon scripts para mantener usuarios activos y simular apertura/cierre de sesiones, consultas y consumo de API. Se adaptó el API para las pruebas, incluyendo pre-firmado de URL con Apache. Se programó la ejecución de la prueba integral para la tarde, con consumo de 500 imágenes en un escenario que replica las condiciones del servidor de producción.\n[20/08/2025]: El miercoles 13 de agosto se ejecutaron y entregaron los reportes con resultados y evidencias. Hubo un inconveniente con pérdida de archivos temporales, pero se repitió el proceso y quedó cerrado.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "INTERNO-JE017",
    "title": "Adicionar usuario a Informe de Casos con una sola actividad",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/08/2025",
    "endDate": "14/08/2025",
    "observations": "[14/08/2025]: Se adiciona el campo 'usuario' al reporte recibido por correo de casos con una sola actividad.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-81_1",
    "title": "Adición de validaciones para el diligenciamiento de la información de envío físico de calificaciones en ambiente de pruebas (test)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/08/2025",
    "endDate": "15/08/2025",
    "observations": "[15/08/2025]: Se implementa validaciònes en test.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "MDSB-855049",
    "title": "ERROR CONTEO DE DIAS BANDEJA DE PENDIENTES VRS INFORME DE EFECTIVIDAD",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "MDSB-862496",
    "title": "Reportan falla al finalizar radicacion de incapacidad \"No muestra numero de radicado\"",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "MDSB-864436",
    "title": "Optimización  informe prefactura 472",
    "assigned": "JESUS",
    "state": "Pruebas Imagine",
    "progress": 80,
    "startDate": "15/08/2025",
    "endDate": "",
    "observations": "[19/08/2025]: Se está ajustando el informe de prefactura 472 debido a que se identificaron varios errores en la lógica.\n[20/08/2025]: Se continuará con la validación y se espera que la optimización culmine en el transcurso del día de hoy.\n[22/08/2025]: Se corrigió la lógica del query para procesar datos por lotes y evitar demoras. Requerimiento en ajuste, pendiente validación de tiempos de ejecución.\n[25/08/2025]: El viernes 22 de agosto se redujo el tiempo de ejecución del informe de más de 70 minutos a 19 minutos mediante ajustes técnicos. Se considera que aún puede optimizarse más.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
  },
  {
    "id": "GD772-129",
    "title": "Ajuste facturas duplicadas Salud",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "Se solicita identificar las facturas duplicadas, marcar si se deben  reprocesar las facturas debido a este incidente reportado por Sisalud salud.",
    "unit": "Varbo",
    "detail": "Se detectó que, en casos de timeout, las facturas pueden quedar duplicadas. Se definió como solución la inclusión de un campo adicional en el JSON para diferenciar reprocesos de radicaciones nuevas.",
    "visible": false
  },
  {
    "id": "GD852-72",
    "title": "Ajustar lago de datos  (informes Cuentas Médicas)",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 0,
    "startDate": "25/08/2025",
    "endDate": "",
    "observations": "[25/08/2025]: Se escala control de cambios MDSB-869595 a produccòn.",
    "unit": "Varbo",
    "detail": "Se identificó la necesidad de ajustar lago de datos para que coincida con los cambios realizados en informes ARL.",
    "visible": true
  },
  {
    "id": "INTERNO-JA017",
    "title": "Restricción para Glosas menores a $6.000",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 0,
    "startDate": "25/08/2025",
    "endDate": "",
    "observations": "[22/08/2025]: Pendiente ajuste de la restricción para evitar glosas completas en facturas de menor valor.\n[25/08/2025]: Se tiene pendiente la implementación de un ajuste menor que se planea ejecutar en la jornada actual.",
    "unit": "Varbo",
    "detail": "Se identificó que el sistema no permite glosar facturas cuyo valor neto es inferior a $6.000, incluso si la factura original supera ese monto. Se revisó el caso y se determinó que debe ajustarse la validación para permitir Glosas en esos escenarios.",
    "visible": true
  },
  {
    "id": "INTERNO-D020",
    "title": "Acceso Ambiente de desarrollo",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 50,
    "startDate": "20/08/2025",
    "endDate": "",
    "observations": "[20/08/2025]: Se radica ticket  MDSB-867281  donde se informa que no es posible establecer conexión desde la instancia de desarrollo imaginex-1_dev\n[22/08/2025]: Se solucionó parcialmente; aún pendiente la conexión a la BD. Ya se solicitó soporte a infraestructura.\n[25/08/2025]: El viernes 22 de agosto dan respuesta al ticket MDSB-867281  solicitando  una sesion para validar la solicitud a mas detalle.",
    "unit": "Varbo",
    "detail": "Se identificaron problemas de acceso a discos (EBS y S3), lo que ha limitado avances en varios frentes. Se radicará un ticket para resolver la falta de conectividad y habilitar pruebas en desarrollo.",
    "visible": true
  },
  {
    "id": "INTERNO-D021",
    "title": "Actualización de versiones (PHP, Apache y librerías) en dev",
    "assigned": "DANILO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "Una vez habilitado el ambiente de dev, se realizará la actualización a la nueva versión de PHP, junto con las librerías asociadas (ej. PostgreSQL, Apache). Se resaltó la importancia de revisar compatibilidad y replicar las librerías en la nueva versión.",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "GD772-130",
    "title": " Modalidad Teletrabajo Transnacional",
    "assigned": "JESUS",
    "state": "Pruebas Imagine",
    "progress": 85,
    "startDate": "21/08/2025",
    "endDate": "22/08/2025",
    "observations": "[22/08/2025]: Avance del 50%. Se implementó parte de la lógica y la notificación/modal de información. Se espera entregar hoy para pruebas.\n[22/08/2025]: Entrega  requerimiento en test para  pruebas, pendiente realizar ajustes de forma.\n[25/08/2025]: El desarrollo fue finalizado y se corrigieron observaciones recientes. Actualmente se encuentra en etapa de pruebas.",
    "unit": "Varbo",
    "detail": "**MODULO COBETURA EN EL EXTERIOR  TELETRABAJO TRANSNACIONAL**\\r\\nDescripción del requerimiento: De acuerdo a la reforma laboral, se debe incluir en la página web de la ARL concretamente en el módulo de reporte modalidades de trabajo, la opción de teletrabajo transnacional este ítem debe tener los mismos campos de trabajo en casa desde el exterior, que existe actualmente \\r\\nObjetivo: Que las empresa puedan reportar la modalidad de trabajo transnacional en la Página WEB de la Ley 2266 de 2025.\\r\\n\\r\\nLos campos que debe traer esta nueva modalidad de trabajo son los siguientes:\\r\\nTeletrabajo Transnacional \\r\\n➔ Número Identificación del trabajador Campo numérico (Obligatorio)\\r\\n➔ Nombres y apellidos del trabajador Campo de Texto (Obligatorio)\\r\\n➔ Número de teléfono del trabajador Campo numérico (Obligatorio)\\r\\n➔ País de residencia, seleccione de la lista desplegable (Obligatorio)\\r\\n➔ Ciudad de residencia: Seleccionar de lista desplegable (obligatorio)\\r\\n➔ Dirección residencia Campo de texto (Obligatorio)\\r\\n➔ Hora inicio labor: Seleccionar de la lista (campo opcional)\\r\\n➔ Hora fin labor: Seleccionar de la lista (campo opcional)\\r\\n➔ Hora inicio de almuerzo: Seleccionar de la lista (campo opcional)\\r\\n➔ Hora fin de almuerzo: Seleccionar de la lista (campo opcional)\\r\\n➔ Fecha de inicio Seleccionar de la lista (campo obligatorio)\\r\\n➔ Fecha fin; Seleccionar de la lista (campo opcional)\\r\\n➔ Jornadas , Seleccionar de la lista “ Semanal o flexible” (si el usuario selecciona flexible se\\r\\nhabilita un campo de texto en el que se indique el mecanismo) “ máximo 200 caracteres”\\r\\n➔ Clase de Riesgo trabajador .Seleccionar de la lista desplegable\\r\\n➔ Descripción de actividades, Seleccionar de la lista desplegable\\r\\nPor otro lado se debe dejar un campo para que la empresa suba la póliza y sus anexos,   para que la ARL tenga el conocimiento, que el empleador cuanta con esta póliza para q las prestaciones asistenciales del trabajador en la modalidad de teletrabajo transnacional.\\r\\nNota , En este ítem ,debe relacionarse la siguiente nota:  “Recuerde que el teletrabajo transnacional es aquel en donde los teletrabajadores y teletrabajadoras de una relación laboral celebrada en Colombia laboran desde otro país, siendo responsabilidad del teletrabajador o teletrabajadora tener la situación migratoria regular, cuando aplique, y responsabilidad del empleador contar con un seguro que cubra al menos las prestaciones asistenciales en salud en caso de accidente o enfermedad (literal d) del artículo 52 de la Ley 2466 de 2025).\\r\\n",
    "visible": true
  },
  {
    "id": "MDSB-868186",
    "title": "jiras dïa a dïa(  Informe general de autorizaciones está trayendo los radicados duplicados)  ",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "21/08/2025",
    "endDate": "22/08/2025",
    "observations": "[22/08/2025] : Se identifica que el histórico muestra registros duplicados porque la tipología está asociada a dos áreas, y por ello el query trae los casos de cada una de ellas, Jesus confima solucion  pero al consultar el  informe presenta un  error que indica que al acceder a una columna llamada id que no existe en la tabla raddepartamentos, pendiente ajustar.\n[22/08/2025]: Error corregido, actualmente el informe presenta la información de manera correcta.",
    "unit": "Varbo",
    "detail": "**Error al generar el informe autorizaciones general en ambiente salud**\\n\\nDesde el día viernes al generar el informe general de autorizaciones (ver imagen1), la base está trayendo los radicados duplicados cuando debe traer un solo registro por radicado desde la fecha de radicación hasta la fecha de cierre y no por actividad. \\n\\nSe adjuntan los archivos del informe, el denominado Base Error corresponde a cómo está generando el informe actualmente y el denominado Base Correcta (que fue generado el jueves) corresponde a como lo debe generar con un solo registro por radicado. ",
    "visible": true
  },
  {
    "id": "INTERNO-D022",
    "title": "Event Party Financiero (plan de ejecución y reducción de costos)",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 60,
    "startDate": "14/08/2025",
    "endDate": "",
    "observations": "[22/08/2025]: Se encuentra en la fase 3 de 4, con un avance estimado del 60% en documentación (se espera llegar al 80% la próxima semana). Se requiere apoyo de infraestructura y arquitectura para avanzar más rápido. La ejecución final está prevista para el 16-17 de septiembre.",
    "unit": "Varbo",
    "detail": "\\n**Descripción:**\\nSe debe elaborar un plan de ejecución por fases (documentación, objetivos, métricas y validaciones técnicas/no técnicas) para participar en el Event Party Financiero. El propósito principal es reducir costos de infraestructura tecnológica, evaluando alternativas como modelos híbridos de servidores y optimización de recursos. El plan debe contemplar:\\n\\nIdentificación de la infraestructura actual.\\n\\nEstrategias para reducción de costos (comparativas y porcentajes).\\n\\nDocumentación técnica y no técnica solicitada por la organización del evento.\\n\\nPreparación de entregables para cada fase (4 fases en total).\\n\\nEjecución y validación de resultados en las fechas del evento (16 y 17 de septiembre).",
    "visible": true
  },
  {
    "id": "INTERNO-D023",
    "title": "Implementación de URLs prefirmadas con Apache  (AWS S3)",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 70,
    "startDate": "21/08/2025",
    "endDate": "",
    "observations": "[22/08/2025]: Avance aproximado del 70%, pendiente ajuste en algoritmo de encriptación en Python. Se espera finalizar hoy mismo si se resuelve el error de visualización de imágenes.\n[25/08/2025]: El viernes 22 de agosto se realizaron pruebas técnicas con URLs pre-firmadas, pero la solución genera lentitud en el API y bloqueos en CloudFront. Se evaluará implementar el algoritmo de encriptación desde Python para mantener compatibilidad y mejorar el rendimiento.",
    "unit": "Varbo",
    "detail": "Descripción:\nSe requiere implementar la generación de URLs prefirmadas en AWS S3 para permitir la carga y visualización segura de archivos (imágenes/documentos) desde la aplicación. La solución debe incluir la firma, tiempo de expiración y condiciones de acceso, garantizando un menor consumo de recursos del servidor y una mejor latencia al acceder directamente al servicio S3.",
    "visible": true
  }
]