[
  {
    "id": "MDSB-780227",
    "title": "Duplicación de actividades en Nativo",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/03/2025",
    "endDate": "16/06/2025",
    "observations": "[16/06/2025]:Se identificó que el error se debía a que algunas tipologías no tenían definido el tipo de asignación como flujo, lo que permitía la apertura de múltiples actividades para un mismo caso. Se actualizó la configuración de dichas tipologías. Se implementó check para colocar flujo en administración.",
    "unit": "Varbo",
    "detail": "Usuario reporta falla en el reporte de Informe ARL - Informe pendientes por Imagine Technologies, al realizar la validación de los datos no coincide con los datos que cada usuario tiene asignados, se evidencia duplicidad en los casos indicando elmismo caso se encuenra asignado a 2 usuarios en diferentes tiempos"
  },
  {
    "id": "INTERNO",
    "title": "Mejora informe glosa req GD772-104 Campos glosa aceptada y glosa conciliación",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "23/05/2025",
    "endDate": "17/06/2025",
    "observations": "[26/05/2025]: El 23 de mayo  avanzó en la construcción del informe de glosas como parte del requerimiento de valores de glosa.\n[28/05/2025]: No se reportan avances\n[30/05/2025]: Se encuentra pausado, se prioriza  la validación Informes de reembolso y colas de procesamiento\n[09/06/2025]: Se trabajó parcialmente el viernes 6 de Junio (avance estimado: 30 %), Faltan datos completos en los queries para continuar el desarrollo\n[11/06/2025]: Se ha avanzado con un script funcional; el desarrollo está en aproximadamente un 50 %.\nFaltan ajustes adicionales en los datos generados\n[13/06/2025]: Se cometió un error durante el desarrollo, pero se continúa con los ajustes. Se espera mostrar avances en la tarde.\n[16/06/2025]: Se realizaron pruebas exitosas en producción del nuevo informe, aunque aún no está disponible para descarga, Falta conectar correctamente el enlace que lo activa desde la interfaz del sistema\n[18/06/2025]:Se ajustó la lógica del informe, . Está listo para pasarse a producción entre hoy y mañana.\n[20/06/2025]: Se acordó pasar informe actualizado a producción el martes 24 para no afectar la migración S3.\n[25/06/2025]: Aunque el nuevo informe está listo desde el viernes 20 de junio, no se ha pasado aún a producción debido a restricciones técnicas. Se planifica realizar este despliegue durante el día de hoy.\n[27/06/2025]: Hoy se realizara paso a producción \n[02/07/2025:] El informe fue pasado a producción el viernes 27 de Junio. Se ajustó ordenamiento y visibilidad por usuario. Se encuentra completamente operativo.",
    "unit": "Varbo",
    "detail": "Se identificó que el informe actual presenta limitaciones cuando existen más de tres glosas, por lo cual se propuso el desarrollo de un nuevo informe que sea más claro y funcional."
  },
  {
    "id": "MDSB-820704",
    "title": "Jira dia a dia Error en generación informe mail 472 (Prefactura)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/06/2025",
    "endDate": "17/06/2025",
    "observations": "Se identifica que el problema fue causado por un valor en el campo direccion_destino, donde la descripción de la dirección incluía un punto y coma (;) como parte del texto, Se añadió una codificación UTF-8 al tratamiento del texto, permitiendo omitir o interpretar correctamente el punto y coma, evitando así el desbordamiento de columnas al momento de cargar el archivo .csv",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-60",
    "title": "Descarga automática de informes",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "11/06/2025",
    "endDate": "25/06/2025",
    "observations": "[09/06/2025]: Se estima tiempo  inicial de desarrollo: 1.5 días\n[11/06/2025]: Se debe crear una tabla que relacione informes con usuarios destino, para replicar informes automáticamente a múltiples usuarios, a un no se confirma fecha de inicio del desarrollo.\n[13/06/2025]: El 11 de junio inicia en la creación de una tabla que permita asignar informes automáticos a múltiples usuarios. Falta desarrollar el panel administrativo y completar los ajustes en la estructura de CMS. hoy se estimae se solicitara control de cambios en test\n[16/06/2025]: Pendiente envio del  script para realizar solicitud de control de  cambios para test.\n[19/06/2025]: 19 de junio se escala control de cambios MDSB-833556 para test. Control de cambios ejecutado correctamente.\n[20/06/2025]: 19 de junio se escala control de cambios MDSB-833556 para test, se ejecuta con exito y se pasa a test e iniciar pruebas por el cliente. A la espera de aprobación de negocio para paso a producción\n[25/06/2025]:El informe está listo en test, pero pendiente de aprobación por parte del negocio para proceder con el control de cambios para paso a produccion.\n[26/06/2025]: Se recibe aprobacion para  paso a producción, se escala control de  cambios MDSB-837144 \n[27/06/2025]: Pendiente aprobación de control de cambios de parte del cliente. 02/07/2025: El 1 de julio se realizaron todas las aprobaciones pendientes. Actualmente, el cambio se encuentra en proceso de validación por parte del líder de Cambios Digitales, y se estima que sea incluido en el Comité de Cambios Digitales programado para el día de hoy. \n[03/07/2025]:Se Realiza paso a producciòn con exito, La funcionalidad de copia automática de informes quedó establecida correctamente corrigiendo un error de totales en Glosas.",
    "unit": "Varbo",
    "detail": "Se reuiere implementar la descarga automática diaria de informes relacionados con Salud, ARL, EPS y Vida, incluyendo inconsistencias, desde el 1 de enero del año vigente hasta la fecha actual, y generarlos por radicado para tres usuarios específicos (Johana Ximena Ceballos Ramírez, Mayerly Carolina León Torres y Sandra Patricia Roa Bernal)."
  },
  {
    "id": "CNTI-271",
    "title": "Pruebas-Vulnerabilidad, CVE-2016-4055 – DoS por expresiones regulares ineficientes en Moment.js (< v2.11.2)",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "13/06/2025",
    "endDate": "19/06/2025",
    "observations": "19/06/2025: El 19 de junio se realizan pruebas en ambiente de test, no se evidenció un comportamiento anómalo ante entradas no válidas, se considera viable proceder con la implementación en ambiente de producción.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "CNTI-96",
    "title": "Vulnerabilidad, La política de seguridad de los contenidos contiene la directiva “unsafe” / imaginex",
    "assigned": "DANILO",
    "state": "Paso a Producción",
    "progress": 70,
    "startDate": "13/06/2025",
    "endDate": "18/06/2025",
    "observations": "[16/06/2025]: Actualmente se trabaja en la vulnerabilidad relacionada con la política de seguridad de contenido (CSP) y el uso de unsafe-inline, necesario para integraciones con Google reCAPTCHA y Clarity, se plantea justificar su permanencia y demostrar que el nivel de seguridad general sigue siendo aceptable (B+ cercano a A).\n[18/06/2025]: Se resolvió la vulnerabilidad relacionada con la política de seguridad de contenidos (CSP), aunque su implementación en producción está limitada por la versión de Apache (actualmente en 2.4.57, mientras que se requiere mínimo 2.4.58). \n[27/06/2025]:Se pasará a producción en primera semana de Julio despues del paso a produccion del S3.\n[07/07/2025] : Iniciara preparación para  paso a produccion ya  que la solución implica la actualización del servicio Apache, es necesario realizar un respaldo completo de los archivos de configuración, virtual hosts y demás elementos asociados, con el fin de prevenir cualquier incidente y permitir una restauración rápida en caso de ser necesario.\n[08/07/2025]: Se debe validar con el cliente, ya que la implementación en producción generará una indisponibilidad aproximada de 30 minutos en el servicio.",
    "unit": "Varbo",
    "detail": "Una configuración débil de la Política de Seguridad de Contenido (CSP) permite ejecutar scripts en línea o evaluar código dinámico, lo que incrementa el riesgo de ataques XSS."
  },
  {
    "id": "GD772-103",
    "title": "Paso de documentos de fs a s3",
    "assigned": "DANILO",
    "state": "Paso a Producción",
    "progress": 95,
    "startDate": "15/04/2025",
    "endDate": "22/05/2025",
    "observations": "[19/02/2025] se tuvo sesion Con Juan Angel  para validar como hacer la copia de los documentos y se definio un orden para hacer las trasferencias, se programara la tarea para el 20 de Febrero y se validara el 21 de febrero el resultado\n[21/02/2025] La tarea programada para la trasferencia de las imagenes se ejecuto ayer 20 de febrero y hoy se realizara la  validación de  resultados.\n[24/02/2025] Se realizó la validación, pero no se evidenciaron resultados. Se consultará con la persona encargada para determinar la razón por la cual la transferencia no fue exitosa\n[26/02/2025] Se radica ticket MDSB-770619 solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3.\n[27/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[28/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[04/03/2025] No hay avances ni respuestas al ticket  MDSB-770619 sobre el paso de documentos;\n[11/03/2025]: Se comenta el ticket MDSB-770619 solicitando avances en la solicitud o si se requiere alguna información adicional o algún ajuste de nuestra parte para avanzar con la sincronización.\n[13/03/2025]: A un no se obtiene avances del progreso del ticket MDSB-770619.\n[28/03/2025]: Depende de Varbo para transferir archivos; no hay avances locales por ahora.\n[02/04/2025]: Ayer Infraestructura de Bolivar  realizo la sincronizacion del primer directorio Sincronización de /opt/storage/img04/arp, e indican que seguiran migrando los directorios en las noches ya que generan  afectacion en el servidor.\n[03/04/2025]: Hoy infraestructura  informa la fecha tentativa de finalizacion es el 4 de abril. el dia de hoy estan terminando la carpeta IMG02\n[04/04/2025]: el 3 de abril  en la noche se detuvo la transferencia de documentos debido a que  ocaciono la  caida del servidor a 10:52 pm.\n[07/04/2025]: Confirman finalizacion del paso de documentos, Se solverificar que el tamaño del disco S3 corresponda al mismo del FS.\n[09/04/2025]: De acuerdo a la sesion con infraestructura de bolivar  se  Construira plan de paso Fs a S3, hoy se pasa el faltante y se expone el s3 a producción.\n[10/04/2025]  se confirma paso de toda la informacion MDSB-770619\n[28/04/2025]: sin cambios por parte de bolivar\n[14/05/2025] : verificar la transferencia de archivos, ya que se completó la transferencia de los documentos faltantes.\n[16/05/2025] : Validara la  cantidad de documentos tranferidos y dara respuesta al correo\n[19/05/2025] : El viernes 16 de mayo se revisó la transferencia de archivos, donde se detectaron diferencias que fueron comentadas en el jira.\n[21/05/2025] : Implementara logica para el conteo de imagenes y  se prepara  para  realizar el cambio del disco el jueves 22 de mayo a las 6pm.\n[23/05/2025]: El 21 de mayo se implementó una lógica para el conteo de archivos transferidos, como parte de la preparación para el paso a producción programado para el lunes 26 de mayo. Las pruebas realizadas el 22 de mayo permitieron validar el montaje del FS en una unidad alternativa, lo cual ofrece flexibilidad para intervenir manualmente en caso de archivos faltantes o fallidos. Infraestructura será responsable de la transferencia de los registros faltantes durante el fin de semana, con posibilidad de apoyo nuestro si es necesario.\n[26/05/2025]: Se avanzó en los conteos correspondientes a img04. Se espera consolidar los resultados en el transcurso del día para dar respuesta formal con evidencias a los correos correspondientes.\n[28/05/2025]: El conteo de datos para FS y S3 sigue pendiente. se planea terminar hoy el conteo y compartir evidencias para análisis, el paso a produccion sigue pendiente.\n[30/05/2025]: El 28  de mayo se termina el conteo y se envian evidencias, pendiente  confirmación de Bolivar.\n[13/06/2025]: Se ajustaron fechas para realizar un nuevo reconteo de archivos transferidos\n[19/06/2025]: Para  el viernes  20 de junio se programo Ventana de mantenimiento a las 5 pm para  realizar paso a producción.\n[25/06/2025]: El viernes 20 de junio se intentó realizar el paso a producción, pero no fue exitoso, ya que al momento de cargar archivos el sistema no lo permitía debido a temas de permisos que no pudieron resolverse en ese momento,Por esta razón, fue necesario reversar la implementación.Se estima realizar nuevamente el paso a producción el día jueves 26 de junio.\n[26/06/2025]: Se reprograma paso a producción para el día miércoles 2 de julio de 10:00 a 11:00 pm \n[02/07/2025]: Para hoy está programado el paso a producción a las 10 Pm.\n[04/07/2025:] El paso  programado para el 2 de julio no fue exitoso debido aque se presentaron  dificultades al levantar el servicio, Varbo propone clonar la máquina actual para probar configuraciones antes hacer el paso a producción. Se acordó que la máquina estaría lista para pruebas el lunes 7 de julio, con la realización de estas programadas para el martes 8 de julio.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-109",
    "title": "Lectura de nuevos datos de órdenes médicas con IA",
    "assigned": "DANILO",
    "state": "Entrenamiento",
    "progress": 70,
    "startDate": "14/05/2025",
    "endDate": "",
    "observations": "20/06/2025: Se pausa para dar prioridad de la migración S3, se planea iniciar entrenamiento durante la próxima semana.\n[27/06/2025]:El fin de semana del 28 de junio se entrenara con mas de 800 registros.\n[04/07/2025]:Se continúa con el entrenamiento del modelo de IA. Se planea insertar aproximadamente 2.000 registros hoy para que el sistema se entrene durante el fin de semana. Debido a las limitaciones del asistente automático, el proceso de carga debe realizarse de forma incremental.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-116",
    "title": "Requerimiento gestión Medicamentos fase 2 - Sprint 2",
    "assigned": "JESUS",
    "state": "En Proceso",
    "progress": 85,
    "startDate": "18/06/2025",
    "endDate": "",
    "observations": "[09/06/2025]: Estimación inicial de desarrollo  9 dias\n[16/06/2025]: Se acordó iniciar el desarrollo el 18 de junio, una vez se finalicen tareas pendientes de giras\n[20/06/2025]:El 19 de junio finalizó el punto 2,continuara con el punto 3.\n[25/06/2025]:El desarrollo avanza en el punto 4 de la fase 2 (creación de tipología y actividades). Se ha completado aproximadamente el 40% del requerimiento \n[27/06/2025]: 27/06/2025: Se reporta un avance del  60%.\n[02/07/2025]:Se avanza en un 75% del desarrollo de la Fase 2 de Medicamentos. Ya se encuentra funcional la creación individual de casos con su trazabilidad completa cuando un proveedor indica no entrega. Se han realizado pruebas exitosas en flujo y visualización. Actualmente se trabaja en la gestión masiva desde Excel para validar múltiples casos simultáneamente y asegurar la correcta apertura e identificación de cada uno. Pendiente finalizar el manejo masivo y ajustes en bandejas administrativas.\n[04/07/2025]: El desarrollo alcanza un 85% de avance. Ya se construyó la generación de carta para proveedor nuevo. Queda pendiente recibir el modelo de carta de cancelación y completar dos botones adicionales. La validación masiva vía Excel fue pospuesta para el final \n[07/07/2025]: Avance parcial durante el viernes 4 de julio en una nueva funcionalidad vinculada a botones de acción. Se priorizó el análisis de flujos con doble actividad y se atenderá el requerimiento de medicamentos durante la jornada de hoy, se estima entrega de desarrollo 8 de julio. ",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "MDSB-707440/GD772-74",
    "title": "Portal reembolsos ARL (FLUJO YII)",
    "assigned": "JAIRO",
    "state": "Pruebas Varbo",
    "progress": 80,
    "startDate": "02/05/2025",
    "endDate": "14/05/2025",
    "observations": "[03/03/2025]: Iniciara despues de finalizar el req GD772-83 Boton Glosa parcial del total de la factura\n[10/03/2025]; Inicia con el desarrollo.\n[11/03/2025] : Inicio bajando el sitio, pero no avanzó mucho debido a que  Jenry le asignó otro requerimiento (Captura de datos e informe).\n[21/03/2025]:Se iniciara con el desarrollo despues de cerrar el req GD772-72 Requerimiento Captura de datos e informe (Reembolsos).\n[27/03/2025]: Continuará con este requerimiento tras subir GD772-72 a test; no reportó avances ayer.\n[28/03/2025]: Iniciará hoy tras subir GD772-72 a test; no avanzó ayer.\n[02/04/2025]: Espera reiniciar despues del medio dia con el req.\n[10/04/2025]: Se realizaron cambios menores previos a la activación. Se planea iniciar la activación hoy del req.\n[11/04/2025]:  tiene el ambiente listo pero no ha iniciado código; espera mostrar avances esta tarde.\n[14/04/2025]: tiene el ambiente listo pero no ha iniciado código,Informa que a un no ha reactivado el req.\n[28/04/2025] :Se retoma luego de terminar el req GD772- 104\n[05/05/2025]: Se inicia requerimiento el 5 de mayo , en 2 semanas se entrega\n[07/05/2025] : seguimos en el proceso\n[09/05/2025] : Se pausa y se da inicio a analiticia fila 56\n[12/05/2025] : Se está analizando el tema de asignación por valores y explorando cómo incorporar el componente de servicios.\nseguimiento 14 mayo : En el proceso de reembolsos se ha llegado a la etapa de asignación y radicación en \"sí salud\"\n[16/05/2025] : pasar pacial a tesT, solicitara  cambios en  test, se escala control de cambios a test MDSB-814902\n[19/05/2025] : Control de cambios MDSB-814902 ejecutado el viernes 16 de mayo,  está desarrollando actividades relacionadas con la radicación en salud. Se espera pasar un avance parcial pronto a tets para que Jenry pueda comenzar las pruebas de digitación\n[21/05/2025] : Se realiza paso a test  20 de mayo un parcial y continuara trabajando en el restante del requerimiento.\n[23/05/2025]: Se realizaron ajustes en inconsistencias, permisos y roles. Se pasó un parcial para pruebas, y se está a la espera de validaciones para continuar con los ajustes finales.\n[28/05/2025]: Se está trabajando en unificar los informes de ARL con los de Reembolso Salud en una misma pestaña, Las pruebas dependen de un servicio de Varbo que aún no está disponible\n[30/05/2025]: Se creó el primer informe específico para ARL basado en los ya existentes para Reembolso Salud. Está en proceso de pruebas,\n[04/06/2025]: El API presenta fallas en ambiente de pruebas; según tecnología, se propondrá apuntar el sitio de test a produccion para poder llevar acabo las pruebas y autoricen el paso a produccion. Se debe considerar personalizar plantillas de respuesta para  ARL.\n[06/06/2025]: Desarrollo ya se encuentra en  test, a la espera de confirmación si el rachivo de pagos en igual al de salud.\n[09/06/2025]: El viernes 6 de junio se informa a Varbo que pueden iniciar las pruebas con la implementación de la simulación del sistema SISalud, con el fin de validar el flujo completo de radicación en ausencia del entorno funcional\n[11/06/2025]: A la espera de habilitación del ambiente de pruebas para que Bolivar continue con las pruebas, Bolivar debe gestionar la activación para continuar.\n[18/06/2025]: Sigue en pruebas por Bolivar.\n[27/06/2025]: Se estima tiempo de entrega del resultado de las pruebas  el 1 de julio por parte de Bolivar.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-87-Laravel",
    "title": "Implementar en Laravel la autenticación con QR",
    "assigned": "JESUS",
    "state": "Pruebas Varbo",
    "progress": 95,
    "startDate": "31/01/2025",
    "endDate": "12/02/2025",
    "observations": "[03/02/2025]  Generacion de la Vista del codigo de 2 pasos en login de Bolivar\n[05/02/2025]  Se mostraran avances para el 7 de Febrero\n[07/02/2025] Inicia encriptación de datos, sesion  a 4pm hoy  para mostrar  avances en dev\n[10/02/2025] Quitar  la  autorecuperación  del QR.\n[12/02/2025] Se sube a dev el login de laravel\n[21/02/2025]: se debe incluir a donde se envia el correo de recuperación.\n[24/02/2025]:  se escaló el control de cambios a test con el ticket MDSB-768688.\n[25/02/2025]:   Se encuentra pendiente creacion de req caja para asociarlo al control de cambios y se de la aprobacion de QA.\n[28/02/2025]: Pendiente creacion de requerimiento caja de parte de Bolivar, Imagine reaizara el envio del manual de usuario.\n[03/03/2025] : El dia viernes 28 de febrero  Bolivar crea el requerimiento caja GD772-87 para adjuntarlo al control de cambios MDSB-768688 en test y continuar con el proceso.\n[04/03/2025]: Control de cambios MDSB-768688 se encuentra en estado aprobacion QA de Bolivar.\n[05/03/2025]: Control aprobado por QA, Control de cambios ejecutado con éxito\n[06/03/2025]: Subió el doble factor a test ayer, pero no compara bien el código del Authenticator; sospecha confusión por claves en Develop o un fallo en la librería, y lo revisará hoy.\n[07/03/2025]: El doble factor no valida bien el código; ayer descartó conflictos en Develop borrando registros, y hoy investigará si es la librería o el dominio compartido.\n[10/03/2025]. El viernes 7 de marzo identifico que la hora del servidor de tets esta adelantada respecto a la hora del celular, quedo ajustado.\n[21/03/2025]: Pendiente resultado de pruebas de Bolivar y el visto bueno para realizar  paso a produccion.\n[26/03/2025]: Bolivar informa que el resultado de las pruebas las enviaran la semana del 31 de marzo y confirman la  implementación en los 2 aplicativos (Nativo y Yii)\n[03/04/2025]:Bolivar tiene  programadas para el 3 y 4 de abril con diferentes perfiles de usuario, de acuerdo al resultado solicitaran  paso a producción la próxima semana.\n[10/04/2025]: Varbo autorizó ayer iniciarlo en test para los ambientes de Yii y nativo\n[19/06/2025]: El  18 de Junio   Bolivar informa que realizan las pruebas en test y aun realizando la exclusión de usuario (Listas blancas) se está solicitando doble factor de autenticación\n[20/06/2025]: Se identificó que la funcionalidad de Listas Blancas no está operando correctamente desde el navegador debido al score del CAPTCHA. Como propuesta, se sugiere implementar una validación directa por cédula, eliminando la dependencia del CAPTCHA.\n[24/06/2025]: Jesus entrega el viernes 20 de junio ajuste de Listas blancas, el usuario activo en listas blancas se le debe omitir la solicitud del codigo de verificación.\n[24/06/2025]: Se aplica ajuste, se confirma funcionalidad y se le notifica al cliente para su validación.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-87",
    "title": "Implementar en Yii y Nativo la autenticación con QR",
    "assigned": "JESUS",
    "state": "Pruebas Varbo",
    "progress": 95,
    "startDate": "14/04/2025",
    "endDate": "24/04/2025",
    "observations": "[14/04/2025]: Se estima iniciar con la implementación tras terminar con los ajustes del req GD772-84.\n[14/05/2025] : Bolivar  reporta 2 hallazgo  en la pruebas, se realizara  validación\n[21/05/2025] : El 20 de mayo se realiza ajuste  en la recuperación de codigo y queda pendiente la inclusion de lsitas blancas tan pronto se ajuste el modulo en yii.\n[23/05/2025]: continúa ajustando la lógica para excluir la validación de listas blancas en el doble factor.\n[26/05/2025]: Se finalizó e implementó exitosamente en TES la funcionalidad pendiente de lista blanca relacionada con el doble factor. Este entregable ya está en ambiente de pruebas, se Realizaran pruebas de funcionamiento.\n[28/05/2025]: El 26 de Mayo se finalizan los ajustes indiecados por Bolivar y se infroma para que realicen las  pruebas.\n[19/06/2025]:El  18 de Junio   Bolivar informa que realizan las pruebas en test y aun realizando la exclusión de usuario (Listas blancas) se está solicitando doble factor de autenticación.\n[24/06/2025]: Jesus entrega el viernes 20 de junio ajuste de Listas blancas, el usuario activo en listas blancas se le debe omitir la solicitud del codigo de verificación.\n[24/06/2025]: Se aplica ajuste, se confirma funcionalidad y se le notifica al cliente para su validación.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-81",
    "title": "Calificador automático (1)",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 90,
    "startDate": "28/04/2025",
    "endDate": "",
    "observations": "[28/04/2025]: El miercoles 23 de abril se paso a TEST parte del requerimiento\n[05/05/2025] : Se entregó a test,  el vienres 2 de mayo\n[07/05/2025] : se realizó pruebas con bolivar el dia 6 de mayo\n[19/05/2025] : El viernes 16 de mayo Se realizaron mejoras en la parte de envío físico, mostrando información completa (dirección, teléfono, nombre, etc.) cuando el caso es físico, incluyendo el PDF de salida para nueve tipologías distintas, no solo una. También se configuró el administrador de cartas, permitiendo edición según cada tipología.\n[07/07/2025]: El 26 de junio el cliente envió los resultados de las pruebas, en los cuales informa que los soportes de 472 no están quedando adjuntos al caso. La validación de este comportamiento se realizará una vez se finalicen las actividades correspondientes a la fase 2 de Medicamentos.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "MDSB-812862",
    "title": "Jira dia a dia Descarga masiva de imágenes (Nativo)",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "N/A",
    "endDate": "",
    "observations": "30/05/2025: Se tiene previsto evacuar los requerimientos prioritarios para poder dar inicio a las validaciones correspondientes.",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "CNTI-195",
    "title": "Vulnerabilidad, Implementación insegura de la integridad de los recursos secundarios (SRI) / imaginex",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 80,
    "startDate": "17/06/2025",
    "endDate": " ",
    "observations": "[18/06/2025]: Inicio ayerSe inició el trabajo sobre la vulnerabilidad el 17 de Junio.\n[20/06/2025]: Se trabaja en una vulnerabilidad compleja relacionada con scripts ya que se requiere intervención manual en múltiples páginas.\n[25/06/2025]: Se avanza al 15% en la mitigación de esta vulnerabilidad.\n[27/06/2025]:Continua en desarrollo. \n[02/07/2025]: No se reportan avances, se planea continuar hoy después de solucionar el (Error de acceso en test con TLS y certificados (Api incapacidades)) \n[04/07/2025]:El avance de la remediación de la vulnerabilidad llega al 70%. Se trabajó con dedicación el día anterior y se proyecta su cierre completo en el transcurso del día si se mantiene el ritmo.\n[07/07/2025] : Se avanzó un 10% en la revisión y atención de la vulnerabilidad,  Se planea continuar hoy con la solución.",
    "unit": "Varbo",
    "detail": "No usar SRI permite que recursos externos como scripts o estilos sean manipulados sin ser detectados, exponiendo al sitio a posibles ataques si el servidor externo es comprometido"
  },
  {
    "id": "GD772-114",
    "title": "ADICIONAR INFORMACIÓN DE TENGO DUDAS DE MIS REEMBOLSOS AL INFORME CONSOLIDADO",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "[20/06/2025]:Validara requerimiento y estimara tiempo de  desarrollo.\n[25/06/2025]:Este informe ya fue desplegado exitosamente a producción el 24 de junio. Fue integrado a la pestaña Digitación y se unificó el manejo de dudas y pendientes por digitar, mejorando la centralización de datos.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "MDSB-833556",
    "title": "CDC-T, req GD772-60 Descarga automática de informes",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "19/06/2025",
    "observations": "19 de junio Se escala control de cambios en test para alterar una tabla y se crea otra. Control de cambios ejecutado correctamente. \n[02/07/2025]: Control de cambios aprobado, se ejecutara 3 de Julio 4pm.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Migración S3 y aplicaciones a EBS",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 80,
    "startDate": "19/06/2025",
    "endDate": "20/06/2025",
    "observations": "[19/02/2025] se tuvo sesion Con Juan Angel  para validar como hacer la copia de los documentos y se definio un orden para hacer las trasferencias, se programara la tarea para el 20 de Febrero y se validara el 21 de febrero el resultado\n[21/02/2025] La tarea programada para la trasferencia de las imagenes se ejecuto ayer 20 de febrero y hoy se realizara la  validación de  resultados.\n[24/02/2025] Se realizó la validación, pero no se evidenciaron resultados. Se consultará con la persona encargada para determinar la razón por la cual la transferencia no fue exitosa\n[26/02/2025] Se radica ticket MDSB-770619 solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3.\n[27/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[28/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[04/03/2025] No hay avances ni respuestas al ticket  MDSB-770619 sobre el paso de documentos;\\n[11/03/2025]: Se comenta el ticket MDSB-770619 solicitando avances en la solicitud o si se requiere alguna información adicional o algún ajuste de nuestra parte para avanzar con la sincronización.\\n[13/03/2025]: A un no se obtiene avances del progreso del ticket MDSB-770619.\\n[28/03/2025]: Depende de Varbo para transferir archivos; no hay avances locales por ahora.\\n[02/04/2025]: Ayer Infraestructura de Bolivar  realizo la sincronizacion del primer directorio Sincronización de /opt/storage/img04/arp, e indican que seguiran migrando los directorios en las noches ya que generan  afectacion en el servidor.\\n[03/04/2025]: Hoy infraestructura  informa la fecha tentativa de finalizacion es el 4 de abril. el dia de hoy estan terminando la carpeta IMG02\\n[04/04/2025]: el 3 de abril  en la noche se detuvo la transferencia de documentos debido a que  ocaciono la  caida del servidor a 10:52 pm.\\n[07/04/2025]: Confirman finalizacion del paso de documentos, Se solverificar que el tamaño del disco S3 corresponda al mismo del FS.\\n[09/04/2025]: De acuerdo a la sesion con infraestructura de bolivar  se  Construira plan de paso Fs a S3, hoy se pasa el faltante y se expone el s3 a producción.\\n[10/04/2025]  se confirma paso de toda la informacion MDSB-770619\\n[28/04/2025]: sin cambios por parte de bolivar\\n[14/05/2025] : verificar la transferencia de archivos, ya que se completó la transferencia de los documentos faltantes.\\n[16/05/2025] : Validara la  cantidad de documentos tranferidos y dara respuesta al correo\\n[19/05/2025] : El viernes 16 de mayo se revisó la transferencia de archivos, donde se detectaron diferencias que fueron comentadas en el jira.\\n[21/05/2025] : Implementara logica para el conteo de imagenes y  se prepara  para  realizar el cambio del disco el jueves 22 de mayo a las 6pm.\\n[23/05/2025]: El 21 de mayo se implementó una lógica para el conteo de archivos transferidos, como parte de la preparación para el paso a producción programado para el lunes 26 de mayo. Las pruebas realizadas el 22 de mayo permitieron validar el montaje del FS en una unidad alternativa, lo cual ofrece flexibilidad para intervenir manualmente en caso de archivos faltantes o fallidos. Infraestructura será responsable de la transferencia de los registros faltantes durante el fin de semana, con posibilidad de apoyo nuestro si es necesario.\\n[26/05/2025]: Se avanzó en los conteos correspondientes a img04. Se espera consolidar los resultados en el transcurso del día para dar respuesta formal con evidencias a los correos correspondientes.\\n[28/05/2025]: El conteo de datos para FS y S3 sigue pendiente. se planea terminar hoy el conteo y compartir evidencias para análisis, el paso a produccion sigue pendiente.\\n[30/05/2025]: El 28  de mayo se termina el conteo y se envian evidencias, pendiente  confirmación de Bolivar.\\n[13/06/2025]: Se ajustaron fechas para realizar un nuevo reconteo de archivos transferidos\\n[19/06/2025]: Para  el viernes  20 de junio se programo Ventana de mantenimiento a las 5 pm para  realizar paso a producción.\\n[25/06/2025]: El viernes 20 de junio se intentó realizar el paso a producción, pero no fue exitoso, ya que al momento de cargar archivos el sistema no lo permitía debido a temas de permisos que no pudieron resolverse en ese momento,Por esta razón, fue necesario reversar la implementación.Se estima realizar nuevamente el paso a producción el día jueves 26 de junio.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Restablecimiento de contraseña en Laravel",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/06/2025",
    "endDate": "27/06/2025",
    "observations": "[05/06/2025]:El 5 de Junio se realiza ajuste a test para  pruebas,\n[06/06/2025]: Se realizan  pruebas y se identifican  2 hallazgos  pendiente su solución.\n[09/06/2025]: Se pausa debido a que en el momento no tiene  acceso al entorno de pruebas (test)\n[11/06/2025]: Se confirmó que no se muestra el mensaje de “usuario no existe” cuando aplica. Para los usuarios nuevos que no pueden iniciar sesión después de restablecer la clave, Fabio realizara pruebas.\n[25/06/2025]: Pendiente  realizar pruebas por Fabio.\n[27/06/2025]: Hoy se realizara paso a producción \n[02/07/2025]: Se realizó el despliegue a producción el día viernes 27 de junio, correspondiente al ajuste que permite actualizar la tabla de usuarios en el aplicativo Laravel al momento de crear un nuevo usuario o restablecer la contraseña.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Sistematización con IA (Segunda vista de incapacidades en portal)",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 60,
    "startDate": "26/05/2025",
    "endDate": "",
    "observations": "[26/05/2025]: Iniciara validando a que sistema  o proceso implementara  sitematizacion  con IA\n[28/05/2025]: Se inicia la creación de una nueva vista de radicación con un solo paso, reduciendo la carga de datos que debe ingresar el usuario. La lógica se basará en consultar automáticamente la información relacionada a partir de la cédula del afiliado en el portal.Crean las ramas .\n[30/05/2025]: Se pausa para por prioridad de la solicituda  MDSB-822809  Descarga soportes AT 031 y AT 028\n[04/06/2025]: Aún no se ha finalizado. Falta desarrollar el botón de “finalizar” que guarde la información completa para la gestión. Ya se cuenta con el API entregado por Danilo; lo siguiente es validar toda la lógica de guardado\n[06/06/2025]: Dedicara hasta las  10 am de hoy para  finalizar el desarrollo.\n[09/06/2025]: Dedico todo el dia del 6 de Junio Tuvo inconvenientes para conectarse al API que dejó Danilo, pero en horas de la tarde logro establecer la conexión. Realizo algunas pruebas y el servicio está funcionando correctamente. Lo que queda pendiente es entrenar  un poco más el método para mejorar su desempeño.\n[11/06/2025]: Se reporta que algunas imágenes devuelven NIT en lugar de cédula.Se sugirió probar con múltiples imágenes y registrar patrones para mejoras futuras\n[25/06/2025]: Se encuentra pausado para dar continuidad a  Requerimiento gestión Medicamentos fase 2 - Sprint 2",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Validación Informes de cuentas medicas y colas de procesamiento",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "29/05/2025",
    "endDate": "27/06/2025",
    "observations": "[30/05/2025];Se identificó que los informes de reembolso no presentan problemas de rendimiento, pero el sistema puede tardar si hay varios informes en cola. Jairo está migrando el informe más pesado (por radicado) a Python usando FastAPI y Pandas.\n[04/06/2025]: A pesar de intentos de optimización con Python, los tiempos de generación siguen siendo similares No se identificaron mejoras sustanciales hasta ahora; se reconoce que el problema persiste\n[06/06/2025]: Se encuentra en validacion de opciones de mejora.\n[09/06/2025]: Iniciara validación de los demas informes.\n[11/06/2025]: Sin avances recientes. Se expusieron avances al jefe (Hernán), pero falta validación funcional.\n[13/06/2025]:  Se continuará investigando otras alternativas para optimizar el proceso\n[25/06/2025]: Se planea optimizar tiempos de carga, actualmente afectados por el incremento de volumen de datos mes a mes.\n[27/06/2025]: Se finalizó la mejora del informe con mayor volumen de datos, optimizando la consulta (query) y reduciendo el tiempo de descarga a aproximadamente 10 segundos.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-69",
    "title": "DEV,Extraccion de Imágenes ( API) (Incapacidades)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "09/06/2025",
    "endDate": "26/06/2025",
    "observations": "[04/06/2025]: Se pausa  para trabajara en  Sistematización con IA (Segunda vista de incapacidades en portal).\n[06/06/2025]: Contunuara con el desarrollo del metodo de incapacidades despues de culminar Sistematización con IA (Segunda vista de incapacidades en portal), se  estimada de entrega 9 de junio \n[09/06/2025]: Se iniciará hoy con el desarrollo del primer método del modelo de incapacidades, debido a que el 6 de junio dedico el dia al Sistematización con IA (Segunda vista de incapacidades en portal)\n[11/06/2025]: Ya  se encuentran los metodos de incapacidades y medicamentos, Hoy desarrollará el servicio y completará la URL pública para pruebas desde Postman u otros medios.\n[13/06/2025]: El 12 de junio  finalizó la lógica de firma y reestructuración del código. El API está lista, solo falta habilitar el endpoint para completar las pruebas\n[16/06/2025]: El metodo de incapacidades ya está listo  en ambiente de desarrollo (DEV). Se creó un servicio provisional mientras se habilita la URL oficial para pruebas.\n[18/06/2025]: El dominio ya está creado en DEV, pero la base de datos de imágenes no está funcionando correctamente, se acordó garantizar pruebas en DEV antes de migrar a TEST. Se cargarán imágenes de prueba.\n[19/06/2025]: Danilo escala jira MDSB-833779 a infraestructura  debido a que se  tiene acceso interno al dominio, pero externamente  se recibe un error.\n[25/06/2025]:Actualmente solo funciona la URL secundaria (opcional) en DEV La URL principal sigue pendiente por tema de permisos. El gira MDSB-833779 aún no ha sido atendido, bloqueando la validación completa.\n[26/06/2025]: Jira  MDSB-833779 fuen resulto con exito, se tiene funcionalidad en ambiente de dev, se escala jira  MDSB-836893 con la solicitud de creación del DNS en el ambiente de TEST,  Pruebas con el cliente  27 de Junio. \n[26/06/2025]: Jira MDSB-833779 fue ejecutado con éxito, se tiene funcionalidad en ambiente de dev, Pruebas con el cliente 27 de Junio.\n[27/06/2025]:Cancelada la sesion de  Pruebas por el cliente.",
    "unit": "Varbo",
    "detail": "**Requerimiento Detallado: Api’s Acceso y Receptor de Imágenes.**\r\n\r\n**Objetivo General:**\r\nImplementar un sistema centralizado que permita la consulta de imágenes mediante api’s desde diversas aplicaciones, con la capacidad de parametrizar las búsquedas y facilitar el acceso a estas imágenes por parte de aplicaciones que requiera la compañía y de este mismo modo guardar la documentación mediante api’s enviada desde cualquier actor a Imagine, es decir en doble vía.\t\r\n\r\n**Alcance:**\r\n\r\nCrear api’s de consulta y almacenamiento de imágenes, a la cual se puede tener acceso desde cualquier aplicativo designado por la compañía.\r\n\r\n\r\nRequerimiento funcional:\r\n\r\n**Sprint 1**\r\n**CA1.Consulta Parametrizada de Imágenes:** Permitir a las diferentes aplicaciones consultar imágenes basadas en los siguientes criterios opcionales **según la tipología:**\r\nTipificación (Por código asignado según proceso) - Obligatorio\r\n1.1 Incapacidades = COD1+ Minimo un campo opcional del 3 al 5.\r\n1.2 Medicamentos = COD2+ Minimo un campo opcional del 3 al 6\r\n1.3 Fallos de tutela = COD3+ Minimo un campo opcional del 3 al 5\r\n1.4 Cuentas medicas =COD4+ Minino un campo opcional del 3, 4, 5, 9 o 10.\t\r\n1.5 Nativo =COD5+ campo 2 obligatorio + Mínimo un campo opcional del 3 al 8\r\n**Nota:** La tipificación se realiza como propuesta imagine puede establecer una nueva, tener en cuenta que cada proceso nuevo en caso de que no ingrese en la tipificación anterior debe incluirse en la nueva para obtener la información.\r\nTipología del documento en nativo (incapacidades, medicamentos, cuentas médicas - reembolsos, etc., identificando la fuente: nativo, YII, Laravel)\r\nNit o número de documento asociado\r\nRango de fechas (fecha de creación o carga de la imagen), \r\nNúmero de caso Imagine\r\nNumero de solicitud (siniestro)\r\nCronograma \r\nSecuencia \r\nNúmero de Factura\r\nNit del Beneficiario\r\nCondiciones: Puede cumplir uno o varios de los anteriores criterios para la consulta.\r\n- Si la consulta es únicamente por fechas, el rango de fechas debe ser máximo de un periodo de un mes (paramétrico por días).\r\n- Para el caso de ‘Incapacidades’, se escoge dicha Tipología, la ‘Fecha de creación inicial deseada’ y la ‘Fecha de creación final deseada’ (paramétrico)\r\n- Se requiere que al aplicar un filtro se indique a través de un mensaje la cantidad de registros y solicitar un segundo filtro en caso de que el volumen sea alto**\r\n- Sí por peso no es posible entregar la información de manera inmediata se debe generar una alerta de encolamiento para la entrega de la información.\r\n\r\n1. API de Imágenes: Debe permitir consumir vía API las imágenes encontradas a partir de los criterios de búsqueda desde el servicio solicitado, se debe obtener las url prefirmada que contiene los requisitos de seguridad (bajo el mismo modelo del servicio de recobros) \r\n\r\nDicho listado, deberá contener los siguientes datos:\r\n\r\nNumero_radicado_imagine, \r\ntipología, \r\nIdentificación_del_trabajador, \r\nurl de la imagen, \r\nfecha_radicación, \r\nIdentificación_de_persona_o_empresa_que_radica,\r\nNumero_de_solicitud (siniestro)  (aplica sólo en algunas tipologías)\r\nCronograma_SIPAB (aplica sólo en algunas tipologías)\r\nSecuencia_SIPAB (aplica sólo en algunas tipologías)\r\n"
  },
  {
    "id": "Interno",
    "title": "Automatización cuentas medicas con IA",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 20,
    "startDate": "03/06/2025",
    "endDate": "",
    "observations": "[04/06/2025]:Se está buscando una alternativa para mostrar avances en automatización\n[06/06/2025]: Se han tenido avances en la lógica de radicación, continuará trabajando para lograr un avance significativo y contar con algo funcional que pueda ser mostrado.\n[09/06/2025]: Se trabaja en pruebas con lotes de facturas, validando reconocimiento parcial. Avance estimado en esta tarea: 20 %.\n[11/06/2025]: No se trabajó en los últimos días. Continúa pendiente.\n[20/06/2025]: retomará revisión del tema durante el día de hoy.\n[25/06/2025]:No se reportan avances.\n[04/07/2025]: Sin avances técnicos reportados. El desarrollo sigue pendiente por falta de disponibilidad de tiempo, pero se mantiene en la lista de tareas por retomar.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "CNTI-271",
    "title": "Vulnerabilidad, CVE-2016-4055 – DoS por expresiones regulares ineficientes en Moment.js (< v2.11.2)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "13/06/2025",
    "endDate": "14/06/2025",
    "observations": "Vulnerabilidad que permite ataques de denegación de servicio mediante uso excesivo de CPU al procesar duraciones con expresiones regulares mal optimizadas.\n[13/06/2025]: Se actualizó a la versión 2.29.4 para corregir la vulnerabilidad, se deben realizar  pruebas en test para comprobar funcionamiento.\n[16/06/2025]: Queda disponible  el 13 de Junio para  pruebas por Imagine en ambientes de test\n[19/06/2025]: El 19 de junio Fabio  realiza pruebas en ambiente de test, no se evidenció un comportamiento anómalo ante entradas no válidas, se considera viable proceder con la implementación en ambiente de producción.\n[24/06/2025]: Se realiza  implementación de la correccion de la vulnerabilidad en produccion.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno-W",
    "title": "Sistema automatizado de clasificación de correos médicos con IA",
    "assigned": "WILSON",
    "state": "En Proceso",
    "progress": 85,
    "startDate": "05/06/2025",
    "endDate": " ",
    "observations": "[16/06/2025]: Se detecto un problema en los análisis, se trabajo en una posible solución para ello, y es overfitting, que no es otra cosa que corregir estimaciones posiblemente equivocadas. Corregido por medio de scripts de testing y aquí el reporte de los resultados\n[18/06/2025]: Se encuentra  realizando  cambios en mejoras de diccionario de datos y modelos enfocados a conceptos médicos en español.\n[25/06/2025]: Actualmente se están ejecutando pruebas de ajuste fino (fine-tuning) sobre los modelos de clasificación mediante combinaciones de parámetros de entrenamiento. Esta etapa es crítica para mejorar el rendimiento del modelo sin modificar los datos base. El proceso es intensivo en tiempo y recursos, ya que cada entrenamiento toma varias horas. Se continúa enfocado en esta optimización.\n[02/07/2025]: El desarrollo presenta un avance del 85%. Se han realizado pruebas unitarias y automatizadas con PyTest, orientadas a implementar integración y despliegue continuo (CI/CD). Se trabaja en el ajuste fino de los modelos (fine-tuning) y se analiza la calidad y relevancia de los datos para optimizar el entrenamiento. Se cuenta con el apoyo de usuarios funcionales para identificar las tipologías clave, asegurando una clasificación más precisa de los correos médicos. Pendiente iniciar la integración con el sistema de correos y montar el entorno de desarrollo en el equipo de Bolívar.",
    "unit": "Varbo",
    "detail": "**Sistema automatizado de clasificación de correos médicos con IA**\r\nSistema automatizado de clasificación de correos médicos usando inteligencia artificial avanzada. Combina múltiples modelos (ensemble) y procesamiento especializado de lenguaje médico.\r\n\r\n**RESULTADOS DESTACADOS**\r\n**Métricas de Rendimiento**\r\n• Precisión: 100% \r\n• Consistencia: 100% validación cruzada \r\n• Procesamiento: 980 correos \r\n• Categorías: 20 tipos diferentes \r\n• Características: 3,800 términos médicos\r\n\r\n** Innovaciones Implementadas**\r\n\r\n**Sistema Inteligente Múltiple:**\r\n• Combina varios modelos de IA \r\n• Mayor precisión y robustez ⚡\r\n• Se adapta a diferentes tipos de correos \r\n\r\n**Procesamiento Médico Especializado:**\r\n• Modelo en español avanzado\r\n• Reconoce términos médicos \r\n• Estandariza la terminología \r\n\r\n**BENEFICIOS CLAVE**\r\n\r\n**Operativos:**\r\n• Clasificación automática inmediata \r\n• Menos trabajo manual \r\n• Resultados consistentes \r\n\r\n**Técnicos:**\r\n• Sistema adaptable y robusto \r\n• Aprende continuamente \r\n• Especializado en términos médicos \r\n\r\n**PLAN DE IMPLEMENTACIÓN**\r\n1. Despliegue en producción \r\n2. Setup de monitoreo \r\n3. Capacitación equipo \r\n\r\n**Postproducción:**\r\n1. Evaluación en producción \r\n2. Mejoras por feedback \r\n3. Expansión capacidades \r\n\r\n**Pendientes:**\r\n1. Integración sistemas médicos \r\n2. Aprendizaje automático \r\n3. Más categorías \r\n\r\n**Implementación:**\r\n• Despliegue paso a paso \r\n• Monitoreo constante \r\n• Validación periódica \r\n\r\n**Mejoras por realizar:**\r\n• Integrar estándares médicos \r\n• Diccionarios especializados \r\n• Validación cruzada términos \r\n\r\n**Mantenimiento:**\r\n• Updates periódicos \r\n• Reentrenamiento programado \r\n• Control de métricas \r\n\r\n**CONCLUSIÓN**\r\nSistema robusto y eficiente para clasificación automática de correos médicos. Resultados perfectos en pruebas iniciales. Combina múltiples modelos de IA con procesamiento especializado médico.\r\n**LOGROS CLAVE**\r\n•\t100% precisión\r\n•\tValidación perfecta\r\n•\tProcesamiento rápido\r\n•\tEspecializado en medición\r\n"
  },
  {
    "id": "Interno",
    "title": "Desarrollo de informe interactivo de requerimientos",
    "assigned": "FABIO",
    "state": "En Proceso",
    "progress": 70,
    "startDate": "12/06/2025",
    "endDate": " ",
    "observations": "[20/06/2025]: Se esta trabajando en la actualizacion de req en el informe y en la  adicion del campo \"Detalle de req\"\n[25/06/2025]: Ya se encuentra el campo detalle req, se esta trabajando en la forma de alimentar este campo y el ingreso del historico de las observaciones de  cada req. \n[01/07/2025]: Se realiza actualización de estado de Req  y  cambio de Nombres de las  Unidades.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Pruebas listas blancas para factor de doble autenticación",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "[24/06/2025]: Se realizan pruebas al ingresar a un usuario en listas blancas y se deja activo  al ingresar a laravel y Yii no solicita codigo de autenticación, se identifica que Nativo no esta solicitando codigo de autenticación a ningun usuario se escala a Jesus para su ajuste.\n[24/06/2025]: Jesus entrega ajuste, se realiza validación y se confirma funcionalidad y se le informa al cliente.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Solicitud accesos ambiente Dev y Test (Jenry)",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "25/06/2025",
    "observations": "[24/06/2025]: Se  escalan los siguientes  solicitud de accesos Dev = MDSB-835240   test= MDSB-835246\n[25/06/2025]: Se asignan permisos solicitados y se confirma acceso a dev y test correctamente.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "MDSB-835580",
    "title": "Jira dia a dia ajustar actividades caso 31012936 incapacidades",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress":100,
    "startDate": "25/06/2025",
    "endDate": "25/06/2025",
    "observations": "[25/06/2025]: Se presento un error en la asignación de la actividad del caso, se corrige  asignandolo a la a ctividada correcta Analista de Liquidación",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Apertura de flujo de 4 casos de Preautorizaciones poliza salud - delegacion analistas creados con una sola actividad",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/06/2025",  
    "endDate": "25/06/2025 ",
    "observations": "[25/06/2025]: Flujos aperturados correctamente",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "INTERNO",
    "title": "Radicación Express con IA",
    "assigned": "DANILO",
    "state": "Pruebas Varbo",
    "progress": 90,
    "startDate": "27/02/2025",
    "endDate": "28/04/2025",
    "observations": "[28/02/2025]: modificó el script para entrenar con lenguaje natural; el modelo propio (basado en Verner) reconoce respuestas rápidas (ej. segunda opinión médica) tras retirar el destilado. Es ligero y responde rápido. Planea ajustar, subir a dev/test y usar una base preentrenada para optimizar.\n[03/03/2025]: El viernes 28  se subieron las modificaciones  a un repositorio, pero aún falta un cambio que planea terminar y desplegar hoy, tras ajustes adicionales que retrasaron el despliegue inicial a dev y test.\n[04/03/2025]: Ajustó el algoritmo del modelo (impresión y entrenamiento) el día anterior, subiendo los cambios al repositorio, pero falta un ajuste en el API para desplegarlo, ya que se alojará en un servidor distinto al de Oficina Virtual por limitaciones de capacidad; espera terminarlo pronto.\n[05/03/2025]: No ha avanzado más en Radicación Express por priorizar el API de Recobros  habló con Jenry sobre cambios adicionales y planea retomarlo tras finalizar el API esta semana.\n[06/03/2025]: Trabajó en una modificación para Radicación Express, pero no la finalizó por requerir más cambios; no dio más detalles ni avances significativos.\n[07/03/2025]: Se detiene ya que se dedicara al API de recobros.\n[10/03/2025]: Detenido ya que se encuentra trabajando en la Lectura de incapacidadaes por Python\n[12/03/2025] : Si es posible y se da el espacio en la sesion de presentación del API de recobros se realizara presentación de este requerimiento.\n[14/03/2025]: Ayer se presentó el avance del proyecto al cliente y Se realizó un ajuste en la implementación, cambiando el modelo de multi-language a una versión en español para mejorar el rendimiento. Este cambio impactó parcialmente el entrenamiento, pero se espera recuperar la estabilidad durante la semana.\n[17/03/2025]: El viernes avanzó en Radicación Express, resolviendo problemas menores, y ajustó la lógica para llevar al usuario al segundo o tercer paso tras confirmar; hoy sigue dedicado a esto, ajustando los datos enviados al formulario para finalizar esa parte.\n[18/03/2025]: Terminó la integración del formulario de Radicación Express con autorizaciones médicas, autocompletando datos (ciudad, IPS, médico) si están completos o dejando en el primer paso si no; hoy subirá los cambios tras reunirse con Jenry para validar o ajustar.\n[19/03/2025]:  Desplegó Radicación Express en test, pero enfrentó problemas de capacidad en el servidor para entrenar el modelo (100 registros fallaron); ajustó el entrenamiento a un registro cada 15 minutos, logrando 3-4 ejemplos ayer, y hoy seguirá entrenando y ajustando.\n[20/03/2025]:Verificó el modelo ayer, ajustó un fallo donde Python mataba el proceso a la mitad, y continuó el entrenamiento (pocos ciclos aún); hoy planea alcanzar 100 ciclos con registros diferentes.\n[21/03/2025]: Revisó el entrenamiento del modelo, que ya superó 100 ejemplos sin problemas ayer; hoy seguirá monitoreando y avanzando en el entrenamiento\n[27/03/2025]: El modelo ya se entrenó con los casos previos y reconoce información; hoy buscará tiempo para añadir 200 registros más para entrenar entre hoy y mañana.\n[28/03/2025]: Ayer  no adiocno\n[28/03/2025]: No revisada ayer por falta de tiempo; hoy planea agregar 500 registros para entrenar y retomar el avance.\n[31/03/2025]: El viernes agregó 173 ejemplos más (total 473 casos); el modelo entrena bien, reconoce 4 de 5 casos con léxico colombiano; hoy o mañana terminará esta tanda y planea sumar 500 registros más.\n[01/04/2025]: Ayer insertó nuevos registros para entrenar el modelo esta semana.\n[09/04/2025]:  Entrenado con 800 casos, listo en test para pruebas por Santiago o usuarios; hoy se entregará oficialmente para pruebas por el cliente, con entrenamiento continuo; estiman 8 días para producción si se prioriza.\n[28/04/2025]: Se entrega para  TEST",
    "unit": "Varbo",
    "detail": ""
    },
            {
                "id": "INTERNO",
                "title": "Lectura de incapacidades por Python",
                "assigned": "DANILO",
                "state": "Finalizado",
                "progress": 95,
                "startDate": "14/02/2025",
                "endDate": "25/02/2025",
                "observations": "[14/02/2025]  Se encuentra ajustando cambio de OCR para minimizar el tiempo de lectura realizando entrenamiento.\n[17/02/2025] Se realizo cambio de OCR, y pruebas\n[18/02/2025] ajustar un modelo diferente a ollama para mejorar la lectura del OCR.\n[19/02/2025] Continuara con los ajustes\n[20/02/2025] Realizar ajustes para hacer una entrega parcial hoy\n[21/02/2025]  En pruebas de entrenamiento al nuevo modelo.\n[24/02/2025]  Organizar datos y consultas e implementarlos en el entrenamiento del modelo para posteriormente pasar a produccion.\n[25/02/2025] Se adelanta las consultas par la construccion del dataset para entrenar el modelo (Bert), despues de terminar la construccion serla a los ambientes y comenzar con el entrenamiento.\n[26/02/2025] Se re ealiza despliegue a produccion el 25 de febrero, se realizara una modificacion  en el dataset  desplegarla  a produccion  para que se encuentre lista para usar, realizar pruebas e iniciar  entrenamiento en las noche.\n[26/02/2025]: Se suben a produccion las modificaciones y al iniciar  el entrenamiento del modelo se presentaron varios inconveniestes encuanto a nombres de facientes y fechas con la data de produccion para lo cual se debio ajustar el dataset.\n[27/02/2025]:se le daran tres ciclos de incapacidades y a medio dia validar cual fue el nivle de aprendizaje.\n[28/02/2025]:Culminó una etapa del modelo, entrenándolo con 2 ciclos (20 registros cada uno), logrando identificar nombre del paciente, fechas y número de incapacidades. Planea entrenar con un dataset más grande en la noche (por uso de RAM) y mejorar la clasificación con datos existentes\n[04/03/2025]: Ayer ajusto los scripts de entrenamiento para que esta semana se pueda entrenar más rápido el modelo.\n[05/03/2025]: Las últimas modificaciones se subieron el viernes 28 de febrero, el modelo se entrena en la noche y los fines de semana cada 6 horas con dataset construido dos horas antes; revisará resultados la próxima semana para evaluar el entrenamiento.\n[10/03/2025]; Se encuentra realizando validaciones a los resutados del entrenamiento de la semana anterior y mejorando el regex mientras el modelo mejora su entrenamiento.\n[11/03/2025]: Está trabajando en un tab para el portal de incapacidades que muestre la información leída por el modelo de IA; planea avanzar lo más posible hoy o terminarlo, sin bloqueos ni dudas reportadas.\n[12/03/2025]: Ya se encuentra ajustado el algorimo de la lectura y se guarda la  información en una tabla para mostrar la información extraida en el aplicativo de incapacidades, hoy se ajustara la vista para mostrar la  información en la consulta de incapacidades.\n[13/03/2025]: Ayer finalizó una vista para mostrar la información procesada por el modelo de IA, con ajustes adicionales completados; hoy espera definir prioridades tras una reunión de las 9 a.m.\n[14/03/2025]: Se presentó el avance del proyecto a un grupo de personas, generando gran interés Se resolvieron dudas sobre la tecnología y se trabajará en una versión más completa.\n[18/03/2025]:  No está trabajando activamente en esto; el modelo se entrena en la noche con un dataset de imágenes, pero con pocos casos aún para mejorar efectividad, y planea revisar pronto el porcentaje de precisión.\n[28/03/2025]: No le dedicó tiempo ayer; hoy buscará agregar más registros para entrenar el modelo.\n[01/04/2025]: Revisó el modelo ayer; avanza poco, pero ajustó el entrenamiento para que sea más rápido sin afectar el servidor; entrena cada 6 horas los fines de semana para aprovechar recursos.\n[09/04/2025]: Entrenado lentamente por recursos limitados (pocos ciclos para no afectar el servidor); lleva 15-20 días así, hoy revisarán su efectividad para decidir si ajustar o buscar alternativas.\n[28/04/2025] :se estima revisar nuevamene el 20 de mayo o antes si nilo lo estima\n[14/05/2025] : Se correra un comando para revisar el estado de lectura de incapacidades, medir el avance del entrenamiento y validar los resultados obtenidos.\n[19/05/2025] : No se pudo validar completamente el avance debido a una caída del servidor ocasionada por falta de direcciones IP, un problema que no había ocurrido anteriormente, validara hoy el avance\n[21/05/2025] : El 19 de mayo,Se modifico el OCR  para mejorar la lectura y confirma que ha alcanzado una efectividad del 85%.\n[28/05/2025]: Falta un detalle menor para terminar la integración de la información extraída sobre incapacidades. Planea cerrarlo hoy.\n[30/05/2025]: El 28 de mayo  Se implementó la ejecución automática de solicitudes de incapacidades a partir de la lectura con IA. Se visualiza en una pestaña separada para mostrar resultados al cliente. Se discutió que, aunque Varbo no usa actualmente los datos extraídos, la información será útil para validaciones futuras.\n[11/06/2025]: los porcentajes de efectividad no superan el 50 % en pruebas recientes. En casos revisados, los valores más comunes rondan el 37 %, incluso en incapacidades actuales. Se recomienda revisar la calidad de los documentos fuente y optimizar la lógica de extracción\n[13/06/2025]:No se ha podido validar el rendimiento del modelo \n[27/06/2025]:Pendiente validacion de efectividad  en la lectura  y ajuste del OCR  para disminuir el consumos de recusos.",
                "unit": "Varbo",
                "detail": ""
           },
            {
                "id": "INTERNO",
                "title": "Realizar Imagen de docker de nativo para Jesus",
                "assigned": "JESUS",
                "state": "Pendiente",
                "progress": 0,
                "startDate": "",
                "endDate": "",
                "observations": "[27/02/2025]: No se ha podido realizar  debido que se encuentra en otras tareas asignadas.\n[16/06/2025]: Se reasigna tarea a Jesus debido a que Wilson  se encuentra en desarrollo de otra actividad.",
                "unit": "Varbo",
                "detail": "",
                "visible": false
            },
            {
                "id": "INTERNO",
                "title": "Ajustar los portales para ser responsive",
                "assigned": "DANILO",
                "state": "Pausado",
                "progress": 5,
                "startDate": "05/05/2025",
                "endDate": "",
                "observations": "[07/05/2025] : se inicia el lunes con el desarrollo de los compos responsive en los portales. Danilo esta a medios tiempos  combinando con Proteccion\n[12/05/2025] : Se define  y continuar  despues  de realizar  el req Lectura de nuevos datos de ordenes medicas  con IA\n[28/05/2025]: Continuara pausado dando prioridad al req GD772-109 Lectura de nuevos datos de ordenes medicas  con IA con el fin de dejarlo terinado antes de salir a vacaiones el martes 3 de Junio.",
                "unit": "Varbo",
                "detail": ""
            },
  {
    "id": "MDSB-837144",
    "title": "CDC-P, req GD772-60 Descarga automatica de informes",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/06/2025",
    "endDate": "03/07/2025",
    "observations": "[26/06/2025]: Se escala control de cambios para  produccion, Pendiente  que el cliente   pase el req GD772-60 a estado PAP para continuar con el proceso. \n[01/07/2025]: Control de cambios avanza al siguiente  estado (Validación), se estima  sea incluido en el comite de cambios digitales  el 2 de Julio. 02/07/2025: El 1 de julio se realizaron todas las aprobaciones pendientes. Actualmente, el cambio se encuentra en proceso de validación por parte del líder de Cambios Digitales, y se estima que sea incluido en el Comité de Cambios Digitales programado para el día de hoy. \n[02/07/2025]: Control de cambios aprobado, se ejecutara 3 de Julio 4pm.\n[03/07/2025]: Control de cambios ejecutado con exito.",
    "unit": "Varbo",
    "detail": ""
    },
  {
    "id": "Interno",
    "title": "Monitoreo de carga y alertas del servidor",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 90,
    "startDate": "17/06/2025",
    "endDate": "12/06/2025",
    "observations": "[11/06/2025]: El 10 de junio se implementó lógica para enviar correos cuando el load average y el uso del procesador superan umbrales definidos.\nSe toman snapshots para detectar procesos que generan cuellos de botella.\nContinúan ajustes y pruebas en esta funcionalidad.\n[13/06/2025]: el 11 de junio se finalizó la implementación del monitoreo de carga, RAM y procesadores, con toma de snapshots cada minuto ante sobrecarga. El envío de alertas por correo quedó pendiente de implementar mediante Exchange para evitar abrir puertos. Se acordó dejarlo “en proceso” para retomarlo más adelante si es necesario.",
    "unit": "Varbo",
    "detail": ""
    },
  {
    "id": "Interno",
    "title": "Desarrollo clasificador de imágenes en Python",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 80,
    "startDate": "15/05/2025",
    "endDate": "",
    "observations": "[16/05/2025] : Ya se encuentra  funcional en local, Se planteó la necesidad de buscar imágenes similares almacenadas en el disco compartido (IMG04) para   realizar  pruebas\n[19/05/2025] : el clasificador de imágenes está en ambiente de prueba, pero aún se requieren imágenes para probarlo adecuadamente. Se discute la posibilidad de generar imágenes desde archivos PDF si no se encuentran imágenes reales\n[26/05/2025]: El Viernes 23 de mayo se implemento en el lector de PDF,  clasifica correctamente los archivos visuales, pero aún no segmenta adecuadamente los PDFs por tipo, agrupándolos en una sola carpeta. Se continuarán pruebas con PDFs diversos para refinar la lógica de clasificación.\n[28/05/2025]: Las pruebas realizadas con el clasificador de archivos PDF no han alcanzado los resultados esperados. Se evalúan otras opciones, pero el enfoque actual está en la funcionalidad de Sistematización con IA (Segunda vista de incapacidades en portal).",
    "unit": "Varbo",
    "detail": ""
    },
  {
    "id": "GD772-69",
    "title": "Documentacion APi incapacidades (Seguridad)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/06/2025",
    "endDate": "27/06/2025",
    "observations": "27/07/2025: entrega doucmentación de seguridad",
    "unit": "Varbo",
    "detail": "Se requiere realizar la documentación de seguridad en la implementación del API de incapacidades en el ambiente de DEV"
    },
  {
    "id": "GD772-69",
    "title": "Hacer contrato API incapacidades",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/06/2025",
    "endDate": "26/06/2025",
    "observations": "27/07/2025: Entrega Documentación del API de incapacidades.",
    "unit": "Varbo",
    "detail": "Se requiere realizar la documentación de la implementación del API de incapacidades"
    },
  {
    "id": "GD772-69 test",
    "title": "TEST Extraccion de Imagenes ( API) (Incapacidades en test)",
    "assigned": "JESUS",
    "state": "Pruebas Varbo",
    "progress": 90,
    "startDate": "02/07/2025",
    "endDate": "07/07/2025",
    "observations": "[02/07/2025:]Pendiente desplegar en test para validar permisos de IP y dominio. Se coordinarán pruebas desde cada estación de trabajo.\n[07/07/2025]: Se deben realizar validaciones sobre los tiempos de respuesta, ya que se ha evidenciado que las consultas presentan demoras en el ambiente de test, a diferencia del comportamiento observado en el ambiente DEV.\n[07/07/2025]:  Se optimizó el código y se modificó la forma de consultar y generar el recurso en S3.Anteriormente, el proceso se realizaba a través de un subproceso; ahora se utiliza una función propia de S3, lo que permitió agilizar la consulta en un 85%.\n[08/07/2025]: Se realiza entrega al cliente para pruebas.",
    "unit": "Varbo",
    "detail": "Se requiere realizar implementación del API de incapacidades en el ambiente de TEST"
    },
  {
    "id": "GD772-69",
    "title": "Error de acceso en test con TLS y certificados ( Api incapacidades)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/07/2025",
    "endDate": "02/07/2025",
    "observations": "[02/07/2025]: Se prioriza identificar si el fallo es por cifrado propio o por certificados del proveedor. \n[02/07/2025]:No fue posible solucionar el error, entonces se agregó el comentario al ticket MDSB-837736 solicitando añadir imaginex-test-documentos.segurosbolivar.com a Alternate Domain Names (CNAMEs) del CloudFront.\n[04/07/2025]:El problema de acceso en el ambiente de pruebas fue resuelto el 2 de julio; el API ya se encuentra funcional con el DNS y TLS configurados. Actualmente se identifican problemas de lentitud en las consultas, posiblemente por la firma o consulta de imágenes. Se recomienda evaluar el rendimiento para optimizar el tiempo de respuesta.",
    "unit": "Varbo",
    "detail": "Descripción del Error de Acceso en Ambiente TEST - TLS/Certificados\nContexto:\nDurante las validaciones en el ambiente de pruebas (TEST), se identificó un error persistente al intentar establecer conexión segura con el servicio externo de la FI (presumiblemente una plataforma de terceros). Este acceso requiere protocolo HTTPS y autenticación mediante certificados digitales.\n\nDescripción técnica del error:\nEl sistema no logra establecer una conexión TLS exitosa. Se realizaron intentos de ajuste en los siguientes elementos sin éxito:\n\nCambios en la configuración del protocolo TLS (probando versiones TLS 1.2 y TLS 1.3).\n\nModificación del tipo de cifrado utilizado.\n\nValidación del certificado digital instalado (vigencia, cadena de confianza, nivel de cifrado).\n\nPosibles causas identificadas:\n\nIncompatibilidad de cifrados: El entorno de prueba puede estar utilizando un algoritmo de cifrado no soportado por el servidor destino.\n\nProblemas con el certificado digital: El certificado podría no estar correctamente instalado, o no ser reconocido como válido por el servidor destino.\n\nConfiguración del servidor destino: El error podría estar en el extremo del proveedor, si este no acepta conexiones desde el ambiente de TEST o está filtrando por tipo de certificado.\n\nAcción en curso:\nSe está intentando aislar si el error se debe a:\n\nUn problema local del ambiente TEST (mala configuración de TLS/certificado).\n\nO una restricción del proveedor externo (rechazo del certificado o incompatibilidad de conexión).\n\nPróximos pasos:\n\nContinuar validación detallada de los logs de conexión.\n\nReportar oficialmente al proveedor si se confirma que el certificado y configuración local son correctos.\n\nRegistrar el incidente en el sistema de tickets internos una vez se defina la causa raíz."
    },
  {
    "id": "Interno",
    "title": "Mejoras informes  por radicado producto Salud ",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/06/2025",
    "endDate": "03/07/2025",
    "observations": "[02/07/2025]: Se avanzó en un 70% con el desarrollo del informe por radicado específico para el área de Salud. Se separó la lógica del informe de los casos ARL y EPS para facilitar su mantenimiento, y se optimizó la consulta SQL mejorando el rendimiento. Actualmente se están realizando pruebas de validación con datos reales, y se espera replicar mejoras de tiempo similares a las obtenidas en el informe de ARL. Pendiente validación final en ambiente de producción.\n[04/07/2025]:Se avanzó con pruebas en producción del informe. El query ya está construido y se están realizando validaciones con datos reales.\n[07/07/2025] : El nuevo informe por radicado fue desplegado a producción el 4 de julio, reduciendo el tiempo de ejecución de 40 a 2 minutos.",
    "unit": "Varbo",
    "detail": "**Mejora del Informe por Radicado – Salud**\r\n**Objetivo del requerimiento:**\r\nImplementar una versión optimizada del informe por radicado específicamente para el área de Salud, separada de los informes de ARL y EPS, debido a diferencias en estructura de datos y campos requeridos.\r\n"
    },
  {
    "id": "Interno-f",
    "title": "Pruebas Sistematización con IA (Segunda vista de incapacidades en portal)",
    "assigned": "FABIO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "Se requiren realizar pruebas y documentarlas  para demostrar avances en el entrenamiento del modelo de lectura de incapacidades por IA."
  },
  {
    "id": "Interno",
    "title": "Validaciòn apertura de dos actividades en un mismo caso en Nativo.",
    "assigned": "JESUS",
    "state": "En Proceso",
    "progress": 70,
    "startDate": "04/07/2025",
    "endDate": "",
    "observations": "[04/07/2025]: se abordarán posibles inconsistencias con doble actividad en la gestion de casos en nativo.\n[07/07/2025]: El día viernes 4 de julio se realizó una revisión del problema relacionado con la apertura de dos actividades simultáneas. En nuestro caso, se analizaron aspectos del flujo, sus condiciones y las tablas involucradas. Se sostuvo una reunión en la tarde para este fin, pero no se alcanzó a concluir el análisis, por lo que se propone agendar un nuevo espacio para continuar con la revisión del tema.\n[07/07/2025]: El día viernes 4 de julio se analizaron aspectos del flujo, sus condiciones y las tablas involucradas. Se sostuvo una reunión en la tarde para este fin, pero no se alcanzó a concluir el análisis, por lo que se propone agendar un nuevo espacio para continuar con la revisión del tema.",
    "unit": "Varbo",
    "detail": "Se requiere validar el porque se abren 2 actividades en la Gestion del mismo caso en Mativo ",
    "visible": true
    },
  {
    "id": "MDSB-838905",
    "title": "Jiras dia dia Inhabilitar 3 tipologias a 3 usuarios.",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "03/07/2025",
    "endDate": "03/07/2025",
    "observations": "[03/07/2025]: se realiza inactivaciòn de  los  usuarios en las  tiplogias (1031) Traslado de Polizas,(10493)Mesa de Conciliacion Presencial y (10494)Mesa de conciliación Virtual ",
    "unit": "Varbo",
    "detail": "**SOLICITUD DESHABILITAR TIPOLOGIAS PARA USUARIO**\r\n\r\nBuenos dias, solicitamos por favor inhabilitar las tipologias de “Traslado de Polizas”, “Mesa de Conciliacion Presencial” y “Mesa de conciliación Virtual”, para los siguientes usuarios, esto debido a que los funcionarios van a estar fuera por un tiempo por incapacidad medica y vacaciones.\r\n\r\nJOHN ALEJANDRO MARTÍNEZ __1032366925\r\n\r\nGIOVANNY STIVEN NIETO__1003530364\r\n\r\nNATALIA ROCIO CUBIDES__1007155376",
    "visible": true
    },
  {
    "id": "Interno",
    "title": "Implementar cambio de contraseña a 30 dias en los tres aplicativos.",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": " ",
    "observations": "[30/05/2025]:Se tiene previsto evacuar los requerimientos prioritarios para poder dar inicio a las validaciones correspondientes",
    "unit": "Varbo",
    "detail": "Implementar la solicitud automatica de cambio de contraseña a los 30 dias en los tres aplicativos",
    "visible": false
    },
  {
    "id": "MDSB-835432",
    "title": "Jira dia a dia Error en cargue de anexos de casos en Nativo.",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "04/07/2025",
    "endDate": " ",
    "observations": "[07/07/2025]: El viernes 4 de julio se implementó solución para prevenir la visualización incorrecta de archivos cargados simultáneamente por usuarios. Falta realizar pruebas en test para validar y solicitar paso a producción.\n[07/07/2025]: La causa del comportamiento fue la ausencia de control para manejar cargas concurrentes. Como solución, el equipo de desarrollo implementó un ajuste en el sistema que permite que, en adelante, los documentos se guarden uno a uno y en el orden en que se reciben, evitando así cualquier sobrescritura o cruce de archivos entre casos.",
    "unit": "Varbo",
    "detail": "**Error en cargue de anexos de casos**\nUsuaria reporta que al realizar el cargue de anexos al caso 39172703 por parte del usuario Leidy Mayorga a las 2025-06-24 13:50:11, se identifica que en el caso queda anexo un documento que NO se estaba cargando, ni se encuentra en mi equipo  al momento del cargue (es un documento totalmente ageno a la operación) este queda cargado bajo la imagen 02; sin embargo en ningun momento se realizo el cargue de esta información.\n\nSe realiza la validación del documento y se observa que corresponde al caso 39177232 el cual fue cargado por el usuario AURA VANESSA OLARTE a las 2025-06-24 13:50:17 momento de creación del caso, lo unico que coincide es la hora del cargue",
    "visible": true
    },
  {
    "id": "MDSB-707440/GD772-74",
    "title": "Generación de plantillas de cartas (glosa total, glosa parcial, devolución) Para Reembolsos ARL",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 0,
    "startDate": "07/07/2025",
    "endDate": " ",
    "observations": "[07/07/2025] : Inicia con la generación de plantillas de cartas de respuesta (glosa total, glosa parcial, devolución), Con estas cartas finaliza el desarrolle del Portal reembolsos ARL (FLUJO YII).",
    "unit": "Varbo",
    "detail": "En el Portal de Reembolsos A.R.L. se tiene pendiente la elaboración de plantillas para cartas específicas (glosa parcial, glosa total, entre otras), según lineamientos enviados previamente por el cliente. La tarea se había dejado pendiente, pero se prevé retomarla hoy 7 de Julio."
  },
  {
    "id": "Interno-J",
    "title": "Mejoras informe  total  producto Salud.",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": "[07/07/2025] Se estima iniciar con la validación de este informe tan pronto finalice la Generación de plantillas de cartas (glosa total, glosa parcial, devolución) Para Reembolsos ARL.",
    "unit": "Varbo",
    "detail": " **Objetivo del requerimiento:**\r\nImplementar una versión optimizada del informe total específicamente para el área de Salud.",
    "visible": true
  },
  {
    "id": "MDSB-842592",
    "title": "Jira dìa a dìa, Cambiar planilla de ingresos en oficina virtual ARL.",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "07/07/2025",
    "endDate": " 07/07/2025",
    "observations": "[07/07/2025]: Se realiza cambio de planilla ",
    "unit": "Varbo",
    "detail": "**Descripción**\r\n\r\nCordial saludo,\r\nDe la manera más atenta nos permitimos solicitar su apoyo actualizando al formulario anexo de ingreso en la oficina virtual, remito a continuación la ruta en la oficina virtual para su conocimiento y fines pertinentes:\r\n\r\n**RUTA OFICINA VIRTUAL:**\r\n1. Acceso a oficina virtual: \r\nPortales Seguros Bolivar \r\n2. Empresa > Solicitudes ARL > \r\n3. Subtipo de solicitud >Novedades \r\n4. Tipo de solicitud  > 2 - Novedades manuales de ingresos y retiro\r\n5. “Descargar novedades de ingreso”\r\n\r\nEsta actualización permitirá que nuestros clientes puedan descargar desde la Oficina Virtual la plantilla vigente y actualizada para el proceso.\r\n\r\nAnexo el print de la oficina virtual, y el formulario correcto para actualización en esta tipología. ",
    "visible": true
  },
  {
    "id": "Interno-J",
    "title": "Validaciòn CASO 31016845, no pasa  de estado radicaciòn (Incapacidades)",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": " ",
    "unit": "Varbo",
    "detail": "El caso 31016845 se gestiona en la activadad radicaciòn, pero no pasa a la siguiente actividad analista de liquidaciòn",
    "visible": false
  },
  {
    "id": "Interno-Ja",
    "title": "Devolver a Seguimiento para firmeza el radicado 30949303",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": " ",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "Interno-Ja",
    "title": " Corregir CC a los  casos 31010548 - 31010549 en pensiones",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": " ",
    "unit": "Varbo",
    "detail": " ",
    "visible": false
  }
]