[
  {
    "id": "MDSB-780227",
    "title": "Duplicación de actividades en Nativo",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/03/2025",
    "endDate": "16/06/2025",
    "observations": "[16/06/2025]:Se identificó que el error se debía a que algunas tipologías no tenían definido el tipo de asignación como flujo, lo que permitía la apertura de múltiples actividades para un mismo caso. Se actualizó la configuración de dichas tipologías. Se implementó check para colocar flujo en administración.",
    "unit": "Varbo",
    "detail": "Usuario reporta falla en el reporte de Informe ARL - Informe pendientes por Imagine Technologies, al realizar la validación de los datos no coincide con los datos que cada usuario tiene asignados, se evidencia duplicidad en los casos indicando elmismo caso se encuenra asignado a 2 usuarios en diferentes tiempos"
  },
  {
    "id": "INTERNO",
    "title": "Mejora informe glosa req GD772-104 Campos glosa aceptada y glosa conciliación",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "23/05/2025",
    "endDate": "17/06/2025",
    "observations": "[26/05/2025]: El 23 de mayo  avanzó en la construcción del informe de glosas como parte del requerimiento de valores de glosa.\n[28/05/2025]: No se reportan avances\n[30/05/2025]: Se encuentra pausado, se prioriza  la validación Informes de reembolso y colas de procesamiento\n[09/06/2025]: Se trabajó parcialmente el viernes 6 de Junio (avance estimado: 30 %), Faltan datos completos en los queries para continuar el desarrollo\n[11/06/2025]: Se ha avanzado con un script funcional; el desarrollo está en aproximadamente un 50 %.\nFaltan ajustes adicionales en los datos generados\n[13/06/2025]: Se cometió un error durante el desarrollo, pero se continúa con los ajustes. Se espera mostrar avances en la tarde.\n[16/06/2025]: Se realizaron pruebas exitosas en producción del nuevo informe, aunque aún no está disponible para descarga, Falta conectar correctamente el enlace que lo activa desde la interfaz del sistema\n[18/06/2025]:Se ajustó la lógica del informe, . Está listo para pasarse a producción entre hoy y mañana.\n[20/06/2025]: Se acordó pasar informe actualizado a producción el martes 24 para no afectar la migración S3.\n[25/06/2025]: Aunque el nuevo informe está listo desde el viernes 20 de junio, no se ha pasado aún a producción debido a restricciones técnicas. Se planifica realizar este despliegue durante el día de hoy.\n[27/06/2025]: Hoy se realizara paso a producción \n[02/07/2025:] El informe fue pasado a producción el viernes 27 de Junio. Se ajustó ordenamiento y visibilidad por usuario. Se encuentra completamente operativo.",
    "unit": "Varbo",
    "detail": "Se identificó que el informe actual presenta limitaciones cuando existen más de tres glosas, por lo cual se propuso el desarrollo de un nuevo informe que sea más claro y funcional."
  },
  {
    "id": "MDSB-820704",
    "title": "Jira dia a dia Error en generación informe mail 472 (Prefactura)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/06/2025",
    "endDate": "17/06/2025",
    "observations": "Se identifica que el problema fue causado por un valor en el campo direccion_destino, donde la descripción de la dirección incluía un punto y coma (;) como parte del texto, Se añadió una codificación UTF-8 al tratamiento del texto, permitiendo omitir o interpretar correctamente el punto y coma, evitando así el desbordamiento de columnas al momento de cargar el archivo .csv",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-60",
    "title": "Descarga automática de informes",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "11/06/2025",
    "endDate": "25/06/2025",
    "observations": "[09/06/2025]: Se estima tiempo  inicial de desarrollo: 1.5 días\n[11/06/2025]: Se debe crear una tabla que relacione informes con usuarios destino, para replicar informes automáticamente a múltiples usuarios, a un no se confirma fecha de inicio del desarrollo.\n[13/06/2025]: El 11 de junio inicia en la creación de una tabla que permita asignar informes automáticos a múltiples usuarios. Falta desarrollar el panel administrativo y completar los ajustes en la estructura de CMS. hoy se estimae se solicitara control de cambios en test\n[16/06/2025]: Pendiente envio del  script para realizar solicitud de control de  cambios para test.\n[19/06/2025]: 19 de junio se escala control de cambios MDSB-833556 para test. Control de cambios ejecutado correctamente.\n[20/06/2025]: 19 de junio se escala control de cambios MDSB-833556 para test, se ejecuta con exito y se pasa a test e iniciar pruebas por el cliente. A la espera de aprobación de negocio para paso a producción\n[25/06/2025]:El informe está listo en test, pero pendiente de aprobación por parte del negocio para proceder con el control de cambios para paso a produccion.\n[26/06/2025]: Se recibe aprobacion para  paso a producción, se escala control de  cambios MDSB-837144 \n[27/06/2025]: Pendiente aprobación de control de cambios de parte del cliente. 02/07/2025: El 1 de julio se realizaron todas las aprobaciones pendientes. Actualmente, el cambio se encuentra en proceso de validación por parte del líder de Cambios Digitales, y se estima que sea incluido en el Comité de Cambios Digitales programado para el día de hoy. \n[03/07/2025]:Se Realiza paso a producciòn con exito, La funcionalidad de copia automática de informes quedó establecida correctamente corrigiendo un error de totales en Glosas.",
    "unit": "Varbo",
    "detail": "Se reuiere implementar la descarga automática diaria de informes relacionados con Salud, ARL, EPS y Vida, incluyendo inconsistencias, desde el 1 de enero del año vigente hasta la fecha actual, y generarlos por radicado para tres usuarios específicos (Johana Ximena Ceballos Ramírez, Mayerly Carolina León Torres y Sandra Patricia Roa Bernal)."
  },
  {
    "id": "CNTI-271",
    "title": "Pruebas-Vulnerabilidad, CVE-2016-4055 – DoS por expresiones regulares ineficientes en Moment.js (< v2.11.2)",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "13/06/2025",
    "endDate": "19/06/2025",
    "observations": "19/06/2025: El 19 de junio se realizan pruebas en ambiente de test, no se evidenció un comportamiento anómalo ante entradas no válidas, se considera viable proceder con la implementación en ambiente de producción.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "CNTI-96",
    "title": "Vulnerabilidad, La política de seguridad de los contenidos contiene la directiva “unsafe” / imaginex",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "13/06/2025",
    "endDate": "18/06/2025",
    "observations": "[16/06/2025]: Actualmente se trabaja en la vulnerabilidad relacionada con la política de seguridad de contenido (CSP) y el uso de unsafe-inline, necesario para integraciones con Google reCAPTCHA y Clarity, se plantea justificar su permanencia y demostrar que el nivel de seguridad general sigue siendo aceptable (B+ cercano a A).\n[18/06/2025]: Se resolvió la vulnerabilidad relacionada con la política de seguridad de contenidos (CSP), aunque su implementación en producción está limitada por la versión de Apache (actualmente en 2.4.57, mientras que se requiere mínimo 2.4.58). \n[27/06/2025]:Se pasará a producción en primera semana de Julio despues del paso a produccion del S3.\n[07/07/2025] : Iniciara preparación para  paso a produccion ya  que la solución implica la actualización del servicio Apache, es necesario realizar un respaldo completo de los archivos de configuración, virtual hosts y demás elementos asociados, con el fin de prevenir cualquier incidente y permitir una restauración rápida en caso de ser necesario.\n[08/07/2025]: Se debe validar con el cliente, ya que la implementación en producción generará una indisponibilidad aproximada de 30 minutos en el servicio.\n[11/07/2025]:Está pendiente una ventana de mantenimiento para desplegar los cambios en producción, ya que requiere actualización del servicio Apache y afecta servicios críticos. Se sugirió solicitar la ventana para el martes 15 o jueves 17 de julio a las 10 pm.\n[14/07/2025]: Se prevé realizar la actualización del servidor Apache para permitir configuraciones de seguridad modernas, pero aún está pendiente confirmación de ventana de mantenimiento para el 15 de julio 10 pm.\n[16/07/2025]: El paso a producción se pospone para la semana del 21 de julio, debido a que se debe evaluar una alternativa para mitigar la vulnerabilidad identificada. Actualizar Apache implicaría también la actualización del sistema operativo, por lo cual se analizarán otras opciones antes de proceder.\n[30/07/2025]: Se realizó la mitigación de la vulnerabilidad prioritaria sin necesidad de actualizar Apache, mediante la implementación de encabezados de seguridad. La solución fue probada exitosamente en ambiente de pruebas y se realiza paso a produccion 30 de julio en la mañana sin afectación al servicio.",
    "unit": "Varbo",
    "detail": "Una configuración débil de la Política de Seguridad de Contenido (CSP) permite ejecutar scripts en línea o evaluar código dinámico, lo que incrementa el riesgo de ataques XSS."
  },
  {
    "id": "GD772-103",
    "title": "Paso de documentos de fs a s3",
    "assigned": "DANILO",
    "state": "Pausado",
    "progress": 95,
    "startDate": "15/04/2025",
    "endDate": "22/05/2025",
    "observations": "[19/02/2025] se tuvo sesion Con Juan Angel  para validar como hacer la copia de los documentos y se definio un orden para hacer las trasferencias, se programara la tarea para el 20 de Febrero y se validara el 21 de febrero el resultado\n[21/02/2025] La tarea programada para la trasferencia de las imagenes se ejecuto ayer 20 de febrero y hoy se realizara la  validación de  resultados.\n[24/02/2025] Se realizó la validación, pero no se evidenciaron resultados. Se consultará con la persona encargada para determinar la razón por la cual la transferencia no fue exitosa\n[26/02/2025] Se radica ticket MDSB-770619 solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3.\n[27/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[28/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[04/03/2025] No hay avances ni respuestas al ticket  MDSB-770619 sobre el paso de documentos;\n[11/03/2025]: Se comenta el ticket MDSB-770619 solicitando avances en la solicitud o si se requiere alguna información adicional o algún ajuste de nuestra parte para avanzar con la sincronización.\n[13/03/2025]: A un no se obtiene avances del progreso del ticket MDSB-770619.\n[28/03/2025]: Depende de Varbo para transferir archivos; no hay avances locales por ahora.\n[02/04/2025]: Ayer Infraestructura de Bolivar  realizo la sincronizacion del primer directorio Sincronización de /opt/storage/img04/arp, e indican que seguiran migrando los directorios en las noches ya que generan  afectacion en el servidor.\n[03/04/2025]: Hoy infraestructura  informa la fecha tentativa de finalizacion es el 4 de abril. el dia de hoy estan terminando la carpeta IMG02\n[04/04/2025]: el 3 de abril  en la noche se detuvo la transferencia de documentos debido a que  ocaciono la  caida del servidor a 10:52 pm.\n[07/04/2025]: Confirman finalizacion del paso de documentos, Se solverificar que el tamaño del disco S3 corresponda al mismo del FS.\n[09/04/2025]: De acuerdo a la sesion con infraestructura de bolivar  se  Construira plan de paso Fs a S3, hoy se pasa el faltante y se expone el s3 a producción.\n[10/04/2025]  se confirma paso de toda la informacion MDSB-770619\n[28/04/2025]: sin cambios por parte de bolivar\n[14/05/2025] : verificar la transferencia de archivos, ya que se completó la transferencia de los documentos faltantes.\n[16/05/2025] : Validara la  cantidad de documentos tranferidos y dara respuesta al correo\n[19/05/2025] : El viernes 16 de mayo se revisó la transferencia de archivos, donde se detectaron diferencias que fueron comentadas en el jira.\n[21/05/2025] : Implementara logica para el conteo de imagenes y  se prepara  para  realizar el cambio del disco el jueves 22 de mayo a las 6pm.\n[23/05/2025]: El 21 de mayo se implementó una lógica para el conteo de archivos transferidos, como parte de la preparación para el paso a producción programado para el lunes 26 de mayo. Las pruebas realizadas el 22 de mayo permitieron validar el montaje del FS en una unidad alternativa, lo cual ofrece flexibilidad para intervenir manualmente en caso de archivos faltantes o fallidos. Infraestructura será responsable de la transferencia de los registros faltantes durante el fin de semana, con posibilidad de apoyo nuestro si es necesario.\n[26/05/2025]: Se avanzó en los conteos correspondientes a img04. Se espera consolidar los resultados en el transcurso del día para dar respuesta formal con evidencias a los correos correspondientes.\n[28/05/2025]: El conteo de datos para FS y S3 sigue pendiente. se planea terminar hoy el conteo y compartir evidencias para análisis, el paso a produccion sigue pendiente.\n[30/05/2025]: El 28  de mayo se termina el conteo y se envian evidencias, pendiente  confirmación de Bolivar.\n[13/06/2025]: Se ajustaron fechas para realizar un nuevo reconteo de archivos transferidos\n[19/06/2025]: Para  el viernes  20 de junio se programo Ventana de mantenimiento a las 5 pm para  realizar paso a producción.\n[25/06/2025]: El viernes 20 de junio se intentó realizar el paso a producción, pero no fue exitoso, ya que al momento de cargar archivos el sistema no lo permitía debido a temas de permisos que no pudieron resolverse en ese momento,Por esta razón, fue necesario reversar la implementación.Se estima realizar nuevamente el paso a producción el día jueves 26 de junio.\n[26/06/2025]: Se reprograma paso a producción para el día miércoles 2 de julio de 10:00 a 11:00 pm \n[02/07/2025]: Para hoy está programado el paso a producción a las 10 Pm.\n[04/07/2025:] El paso  programado para el 2 de julio no fue exitoso debido aque se presentaron  dificultades al levantar el servicio, Varbo propone clonar la máquina actual para probar configuraciones antes hacer el paso a producción. Se acordó que la máquina estaría lista para pruebas el lunes 7 de julio, con la realización de estas programadas para el martes 8 de julio.\n[09/07/2025]:Ayer 8 de junio se recibió el ambiente con S3 para pruebas de parte del cliente, se confirmó que la copia es fiel a producción realizando pruebas básicas de navegación. Se planea probar el montaje completo con S3 y revisar si el problema de bloqueo persiste al montar EBS.\n[10/07/2025]: Se escala solicitud MDSB-844713 para habilitar el acceso a la instancia de pruebas_s3 para validar localmente la implementación de los discos, antes del paso a producción.\n[11/07/2025]: Pendiente respuesta del ticketMDSB-844713 ya que el bloqueo impide validar completamente las aplicaciones. Mientras tanto, se ha avanzado con otras tareas técnicas en ese entorno.\n[14/07/2025]: El viernes 11 de julio se superó el bloqueo de red que impedía comunicación con el puerto 80, lo cual permitió avanzar en el montaje del EC3. Se identificó un problema con el RECAPTCHA debido a que este está configurado para un dominio específico, y en el ambiente actual se está usando una IP directa, Se continuará en lo posible de solucionar y comenzar a realizar pruebas.\n[16/07/2025]: Se continúa con las pruebas y estabilización del S3 y el EBS. Ayer se intentó actualizar Apache, lo que obligó a reinstalar el sistema operativo por incompatibilidad de librerías. Se realizó la restauración del sistema para continuar con las pruebas hoy. Se está evaluando si el EBS es viable dado que su integración obliga a actualizar todo el sistema operativo.\n[18/07/2025]: El 17 de julio se realizaron pruebas satisfactorias en el ambiente de pruebas S3. Se planea continuar con pruebas de rendimiento simulando entre 40 y 80 sesiones activas para validar el comportamiento similar al entorno productivo. Se espera finalizar hoy para liberar el ambiente y continuar con otras tareas como la actualización de Apache.\n[21/07/2025]: El viernes 18 de julio se realizaron pruebas de carga y funcionales, corrigiendo errores detectados. Se entregó informe y el ambiente quedó listo para el paso a producción. Se identificó mejora en la latencia desde FPM. Se requiere confirmación del cliente para la fecha de paso a producción.\n[23/07/2025]: Se realizará paso a producción 23 de julio a las 10 pm.\n[25/07/2025]: El día miércoles 23 de julio se realizó un despliegue exitoso al entorno S3. Sin embargo, el 24 de julio fue necesario revertir los cambios debido a fallos de rendimiento detectados tras la implementación. Se requiere evaluar la capacidad actual del servidor y documentar lo ocurrido, con el fin de identificar las causas del problema y definir acciones correctivas que garanticen la estabilidad del sistema en futuros despliegues.\n[30/07/2025: El proceso se encuentra en pausa hasta que se defina el método para el traspaso de imágenes.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-109",
    "title": "Lectura de nuevos datos de órdenes médicas con IA",
    "assigned": "DANILO",
    "state": "Entrenamiento",
    "progress": 70,
    "startDate": "14/05/2025",
    "endDate": "",
    "observations": "20/06/2025: Se pausa para dar prioridad de la migración S3, se planea iniciar entrenamiento durante la próxima semana.\n[27/06/2025]:El fin de semana del 28 de junio se entrenara con mas de 800 registros.\n[04/07/2025]:Se continúa con el entrenamiento del modelo de IA. Se planea insertar aproximadamente 2.000 registros hoy para que el sistema se entrene durante el fin de semana. Debido a las limitaciones del asistente automático, el proceso de carga debe realizarse de forma incremental.\n[11/07/2025]: Se ingresarán más registros para continuar con el entrenamiento en el fin de samana.\n[21/07/2025]: Se pretende  iniciar entrenamiento en el ambiente de contingencia (Ambiente generado para probar paso S3).\n[23/07/2025]: Se está ajustando el ambiente de contingencia, el cual fue generado para realizar pruebas relacionadas con el paso a S3. Una vez finalicen los ajustes, se dará inicio al proceso de entrenamiento.\n[25/07/2025]: Como ya quedó ajustado el tema de la instancia, ahora será necesario agregar registros para poder continuar con el entrenamiento del modelo de órdenes médicas.\n[28/07/2025]: El viernes 25 se agregaron registros y se actualizó la librería Selerator para corregir incidencias.\n[01/08/2025]: Se planea cargar aproximadamente 10.000 registros esta semana para mejorar la efectividad del sistema.\n[11/08/2025]: El viernes 8 de agosto se agregan nuevos registros para entrenamiento. Se prevé entregar esta semana un porcentaje estimado de precisión del modelo.\n[20/08/2025]: El 15 de agosto se agregó nueva información de órdenes médicas para entrenamiento. El modelo ya alcanza más del 70% de efectividad en lecturas. Se prevé que con poca información adicional quede listo para uso.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-116",
    "title": "Requerimiento gestión Medicamentos fase 2 - Sprint 2",
    "assigned": "JESUS",
    "state": "Pruebas Varbo",
    "progress": 95,
    "startDate": "18/06/2025",
    "endDate": "11/07/2025",
    "observations": "[09/06/2025]: Estimación inicial de desarrollo  9 dias\n[16/06/2025]: Se acordó iniciar el desarrollo el 18 de junio, una vez se finalicen tareas pendientes de giras\n[20/06/2025]:El 19 de junio finalizó el punto 2,continuara con el punto 3.\n[25/06/2025]:El desarrollo avanza en el punto 4 de la fase 2 (creación de tipología y actividades). Se ha completado aproximadamente el 40% del requerimiento \n[27/06/2025]: 27/06/2025: Se reporta un avance del  60%.\n[02/07/2025]:Se avanza en un 75% del desarrollo de la Fase 2 de Medicamentos. Ya se encuentra funcional la creación individual de casos con su trazabilidad completa cuando un proveedor indica no entrega. Se han realizado pruebas exitosas en flujo y visualización. Actualmente se trabaja en la gestión masiva desde Excel para validar múltiples casos simultáneamente y asegurar la correcta apertura e identificación de cada uno. Pendiente finalizar el manejo masivo y ajustes en bandejas administrativas.\n[04/07/2025]: El desarrollo alcanza un 85% de avance. Ya se construyó la generación de carta para proveedor nuevo. Queda pendiente recibir el modelo de carta de cancelación y completar dos botones adicionales. La validación masiva vía Excel fue pospuesta para el final \n[07/07/2025]: Avance parcial durante el viernes 4 de julio en una nueva funcionalidad vinculada a botones de acción. Se priorizó el análisis de flujos con doble actividad y se atenderá el requerimiento de medicamentos durante la jornada de hoy, se estima entrega de desarrollo 8 de julio.\n[09/07/2025]: El desarrollo se encuentra en su fase final, aunque ha experimentado algunos retrasos debido a revisiones relacionadas con otros temas. Actualmente, hay una duda funcional pendiente sobre el comportamiento del botón “Copiar y Reabrir Caso”, la cual está en revisión.Se solicitará el respectivo control de cambios para realizar las pruebas en el ambiente de test.\n[09/07/2025]: Se escala control de cambios en test bajo el jira MDSB-844308.\n[10/07/2025]: Control de cambios MDSB-844308 ejecutado con éxito.\n[11/07/2025]: : El desarrollo fue completado y subido a TES. Se agregó retroalimentación para la carga masiva de Excel. Está pendiente desarrollar la pestaña de trazabilidad y adjuntos, que fue solicitada en reunión con el cliente. Las plantillas de correo fueron entregadas y se está integrando para las pruebas.\n[16/07/2025]: Avanza la estabilización con enfoque en mejoras de experiencia de usuario. Faltan validaciones en gestión y pequeñas correcciones funcionales. Plantillas ya están disponibles.\n[18/07/2025]: Se completó el flujo y ajustes hallados en las pruebas de medicamentos.\n[23/07/2025]: Se realizaron los ajustes solicitados, los cuales incluyen la separación de vistas en pestañas para mejorar la organización de la información, así como la inclusión de botones para la gestión de casos relacionados.\n[30/07/2025]: El día 28 de julio se realizó la entrega del desarrollo al cliente, quien iniciará el proceso de pruebas.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "MDSB-707440/GD772-74",
    "title": "Portal reembolsos ARL (FLUJO YII)",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "02/05/2025",
    "endDate": "14/05/2025",
    "observations": "[03/03/2025]: Iniciara despues de finalizar el req GD772-83 Boton Glosa parcial del total de la factura\n[10/03/2025]; Inicia con el desarrollo.\n[11/03/2025] : Inicio bajando el sitio, pero no avanzó mucho debido a que  Jenry le asignó otro requerimiento (Captura de datos e informe).\n[21/03/2025]:Se iniciara con el desarrollo despues de cerrar el req GD772-72 Requerimiento Captura de datos e informe (Reembolsos).\n[27/03/2025]: Continuará con este requerimiento tras subir GD772-72 a test; no reportó avances ayer.\n[28/03/2025]: Iniciará hoy tras subir GD772-72 a test; no avanzó ayer.\n[02/04/2025]: Espera reiniciar despues del medio dia con el req.\n[10/04/2025]: Se realizaron cambios menores previos a la activación. Se planea iniciar la activación hoy del req.\n[11/04/2025]:  tiene el ambiente listo pero no ha iniciado código; espera mostrar avances esta tarde.\n[14/04/2025]: tiene el ambiente listo pero no ha iniciado código,Informa que a un no ha reactivado el req.\n[28/04/2025] :Se retoma luego de terminar el req GD772- 104\n[05/05/2025]: Se inicia requerimiento el 5 de mayo , en 2 semanas se entrega\n[07/05/2025] : seguimos en el proceso\n[09/05/2025] : Se pausa y se da inicio a analiticia fila 56\n[12/05/2025] : Se está analizando el tema de asignación por valores y explorando cómo incorporar el componente de servicios.\nseguimiento 14 mayo : En el proceso de reembolsos se ha llegado a la etapa de asignación y radicación en \"sí salud\"\n[16/05/2025] : pasar pacial a tesT, solicitara  cambios en  test, se escala control de cambios a test MDSB-814902\n[19/05/2025] : Control de cambios MDSB-814902 ejecutado el viernes 16 de mayo,  está desarrollando actividades relacionadas con la radicación en salud. Se espera pasar un avance parcial pronto a tets para que Jenry pueda comenzar las pruebas de digitación\n[21/05/2025] : Se realiza paso a test  20 de mayo un parcial y continuara trabajando en el restante del requerimiento.\n[23/05/2025]: Se realizaron ajustes en inconsistencias, permisos y roles. Se pasó un parcial para pruebas, y se está a la espera de validaciones para continuar con los ajustes finales.\n[28/05/2025]: Se está trabajando en unificar los informes de ARL con los de Reembolso Salud en una misma pestaña, Las pruebas dependen de un servicio de Varbo que aún no está disponible\n[30/05/2025]: Se creó el primer informe específico para ARL basado en los ya existentes para Reembolso Salud. Está en proceso de pruebas,\n[04/06/2025]: El API presenta fallas en ambiente de pruebas; según tecnología, se propondrá apuntar el sitio de test a produccion para poder llevar acabo las pruebas y autoricen el paso a produccion. Se debe considerar personalizar plantillas de respuesta para  ARL.\n[06/06/2025]: Desarrollo ya se encuentra en  test, a la espera de confirmación si el rachivo de pagos en igual al de salud.\n[09/06/2025]: El viernes 6 de junio se informa a Varbo que pueden iniciar las pruebas con la implementación de la simulación del sistema SISalud, con el fin de validar el flujo completo de radicación en ausencia del entorno funcional\n[11/06/2025]: A la espera de habilitación del ambiente de pruebas para que Bolivar continue con las pruebas, Bolivar debe gestionar la activación para continuar.\n[18/06/2025]: Sigue en pruebas por Bolivar.\n[27/06/2025]: Se estima tiempo de entrega del resultado de las pruebas  el 1 de julio por parte de Bolivar.\n[16/07/2025]:El 15 de julio el  portal  fue entregado al cliente para pruebas, se entregaron tanto las cartas como la funcionalidad del flujo completo se realizan pruebas en ambiente de test con resultado exitoso, El cliente expreso iniciar las pruebas el jueves 17 de Julio. \n[30/07/2025]: El cliente ha dado visto bueno para realizar el paso a producción. Se procede a escalar el control de cambios MDSB-856139.\n[11/08/2025]: Aprueban control de cambios en comité de cambios digitales y se ejecutara hoy 11 de agosto a las 4:20pm.\n[20/08/2025]: El requerimiento ya fue implementado y migrado a producción el jueves 14 de agosto. Se estabilizó el viernes y quedó consolidado en la rama máster.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-87-Laravel",
    "title": "Implementar en Laravel la autenticación con QR",
    "assigned": "JESUS",
    "state": "Paso a Producción",
    "progress": 97,
    "startDate": "31/01/2025",
    "endDate": "12/02/2025",
    "observations": "[03/02/2025]  Generacion de la Vista del codigo de 2 pasos en login de Bolivar\n[05/02/2025]  Se mostraran avances para el 7 de Febrero\n[07/02/2025] Inicia encriptación de datos, sesion  a 4pm hoy  para mostrar  avances en dev\n[10/02/2025] Quitar  la  autorecuperación  del QR.\n[12/02/2025] Se sube a dev el login de laravel\n[21/02/2025]: se debe incluir a donde se envia el correo de recuperación.\n[24/02/2025]:  se escaló el control de cambios a test con el ticket MDSB-768688.\n[25/02/2025]:   Se encuentra pendiente creacion de req caja para asociarlo al control de cambios y se de la aprobacion de QA.\n[28/02/2025]: Pendiente creacion de requerimiento caja de parte de Bolivar, Imagine reaizara el envio del manual de usuario.\n[03/03/2025] : El dia viernes 28 de febrero  Bolivar crea el requerimiento caja GD772-87 para adjuntarlo al control de cambios MDSB-768688 en test y continuar con el proceso.\n[04/03/2025]: Control de cambios MDSB-768688 se encuentra en estado aprobacion QA de Bolivar.\n[05/03/2025]: Control aprobado por QA, Control de cambios ejecutado con éxito\n[06/03/2025]: Subió el doble factor a test ayer, pero no compara bien el código del Authenticator; sospecha confusión por claves en Develop o un fallo en la librería, y lo revisará hoy.\n[07/03/2025]: El doble factor no valida bien el código; ayer descartó conflictos en Develop borrando registros, y hoy investigará si es la librería o el dominio compartido.\n[10/03/2025]. El viernes 7 de marzo identifico que la hora del servidor de tets esta adelantada respecto a la hora del celular, quedo ajustado.\n[21/03/2025]: Pendiente resultado de pruebas de Bolivar y el visto bueno para realizar  paso a produccion.\n[26/03/2025]: Bolivar informa que el resultado de las pruebas las enviaran la semana del 31 de marzo y confirman la  implementación en los 2 aplicativos (Nativo y Yii)\n[03/04/2025]:Bolivar tiene  programadas para el 3 y 4 de abril con diferentes perfiles de usuario, de acuerdo al resultado solicitaran  paso a producción la próxima semana.\n[10/04/2025]: Varbo autorizó ayer iniciarlo en test para los ambientes de Yii y nativo\n[19/06/2025]: El  18 de Junio   Bolivar informa que realizan las pruebas en test y aun realizando la exclusión de usuario (Listas blancas) se está solicitando doble factor de autenticación\n[20/06/2025]: Se identificó que la funcionalidad de Listas Blancas no está operando correctamente desde el navegador debido al score del CAPTCHA. Como propuesta, se sugiere implementar una validación directa por cédula, eliminando la dependencia del CAPTCHA.\n[24/06/2025]: Jesus entrega el viernes 20 de junio ajuste de Listas blancas, el usuario activo en listas blancas se le debe omitir la solicitud del codigo de verificación.\n[24/06/2025]: Se aplica ajuste, se confirma funcionalidad y se le notifica al cliente para su validación.\n[15/07/2025]: El cliente confirma la aprobación para el paso a producción; sin embargo, la ejecución queda pendiente de definir la fecha, ya que se requiere realizar previamente la divulgación al equipo de trabajo, y por parte de Imagine  se debe solicitar control de cambios en produccion.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-87",
    "title": "Implementar en Yii y Nativo la autenticación con QR",
    "assigned": "JESUS",
    "state": "Paso a Producción",
    "progress": 97,
    "startDate": "14/04/2025",
    "endDate": "24/04/2025",
    "observations": "[14/04/2025]: Se estima iniciar con la implementación tras terminar con los ajustes del req GD772-84.\n[14/05/2025] : Bolivar  reporta 2 hallazgo  en la pruebas, se realizara  validación\n[21/05/2025] : El 20 de mayo se realiza ajuste  en la recuperación de codigo y queda pendiente la inclusion de lsitas blancas tan pronto se ajuste el modulo en yii.\n[23/05/2025]: continúa ajustando la lógica para excluir la validación de listas blancas en el doble factor.\n[26/05/2025]: Se finalizó e implementó exitosamente en TES la funcionalidad pendiente de lista blanca relacionada con el doble factor. Este entregable ya está en ambiente de pruebas, se Realizaran pruebas de funcionamiento.\n[28/05/2025]: El 26 de Mayo se finalizan los ajustes indiecados por Bolivar y se infroma para que realicen las  pruebas.\n[19/06/2025]:El  18 de Junio   Bolivar informa que realizan las pruebas en test y aun realizando la exclusión de usuario (Listas blancas) se está solicitando doble factor de autenticación.\n[24/06/2025]: Jesus entrega el viernes 20 de junio ajuste de Listas blancas, el usuario activo en listas blancas se le debe omitir la solicitud del codigo de verificación.\n[24/06/2025]: Se aplica ajuste, se confirma funcionalidad y se le notifica al cliente para su validación.\n[15/07/2025]: El cliente confirma la aprobación para el paso a producción; sin embargo, la ejecución queda pendiente de definir la fecha, ya que se requiere realizar previamente la divulgación al equipo de trabajo, y por parte de Imagine  se debe solicitar control de cambios en produccion.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-81",
    "title": "Calificador automático (1)",
    "assigned": "JESUS",
    "state": "Pruebas Varbo",
    "progress": 90,
    "startDate": "28/04/2025",
    "endDate": "",
    "observations": "[28/04/2025]: El miercoles 23 de abril se paso a TEST parte del requerimiento\n[05/05/2025] : Se entregó a test,  el vienres 2 de mayo\n[07/05/2025] : se realizó pruebas con bolivar el dia 6 de mayo\n[19/05/2025] : El viernes 16 de mayo Se realizaron mejoras en la parte de envío físico, mostrando información completa (dirección, teléfono, nombre, etc.) cuando el caso es físico, incluyendo el PDF de salida para nueve tipologías distintas, no solo una. También se configuró el administrador de cartas, permitiendo edición según cada tipología.\n[07/07/2025]: El 26 de junio el cliente envió los resultados de las pruebas, en los cuales informa que los soportes de 472 no están quedando adjuntos al caso. La validación de este comportamiento se realizará una vez se finalicen las actividades correspondientes a la fase 2 de Medicamentos.\n[16/07/2025]: Se retoma el requerimiento tras avanzar con medicamentos. Se planea dedicarle más tiempo esta semana para cumplir con entrega.\n[18/07/2025]: El 17 de julio se identificaron diferencias en la forma de almacenamiento de los casos certificados y problemas con un script ausente en el entorno local. Se retomará hoy con foco total en este desarrollo, se buscará ajustar el script faltante con apoyo de Jairo.\n[21/07/2025]: Se corrigieron errores en la asignación de usuarios y en el procesamiento de datos. Se ajustó el script para que consulte correctamente el caso padre. Falta implementar el registro de logs para asegurar trazabilidad de acciones como envío de correos o procesos automáticos.\n[25/07/2025]: El 23 de julio se envía ajuste de los  hallazgos reportados.\n[13/08/2025]: El 8 de agosto, el cliente reporta una incidencia en el envío físico. Tras la validación, no se evidencia el error, por lo cual se solicita una sesión para realizar una prueba conjunta y evidenciar la situación. La sesión queda programada para el 14 de agosto a las 10:00 a.m.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "MDSB-812862",
    "title": "Jira dia a dia Descarga masiva de imágenes (Nativo)",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "N/A",
    "endDate": "",
    "observations": "30/05/2025: Se tiene previsto evacuar los requerimientos prioritarios para poder dar inicio a las validaciones correspondientes.",
    "unit": "Varbo",
    "detail": "",
    "visible": false
  },
  {
    "id": "CNTI-195",
    "title": "Vulnerabilidad, Implementación insegura de la integridad de los recursos secundarios (SRI) / imaginex",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "17/06/2025",
    "endDate": "09/07/2025",
    "observations":"[18/06/2025]:Se inició el trabajo sobre la vulnerabilidad el 17 de Junio.\n[20/06/2025]: Se trabaja en una vulnerabilidad compleja relacionada con scripts ya que se requiere intervención manual en múltiples páginas.\n[25/06/2025]: Se avanza al 15% en la mitigación de esta vulnerabilidad.\n[27/06/2025]:Continua en desarrollo. \n[02/07/2025]: No se reportan avances, se planea continuar hoy después de solucionar el (Error de acceso en test con TLS y certificados (Api incapacidades)) \n[04/07/2025]:El avance de la remediación de la vulnerabilidad llega al 70%. Se trabajó con dedicación el día anterior y se proyecta su cierre completo en el transcurso del día si se mantiene el ritmo.\n[07/07/2025] : Se avanzó un 10% en la revisión y atención de la vulnerabilidad,  Se planea continuar hoy con la solución.\n[09/07/2025]: Se avanzó en la implementación   en todas las aplicaciones requeridas (nativo, autorizaciones, portales, portal de incapacidades) pero  no se pudo desplegar en ambiente TES por errores de carga de estilos. Se sospecha que puede deberse a conflictos con el recaptcha o pasos omitidos, contunuara  la validaciòn.\n[11/07/2025]:El SRI fue implementado y desplegado en ambiente test, con dificultades superadas el 9 de julio.\n[14/07/2025]: Se requieren pruebas generales para validar su correcto funcionamiento en todas las aplicaciones involucradas.\n[15/07/2025]: Se realizara el paso a producción el día 16 de Julio a las 5pm.\n[18/07/2025]: El 16 de julio se completó el despliegue de SRI a producción.",
    "unit": "Varbo",
    "detail": "No usar SRI permite que recursos externos como scripts o estilos sean manipulados sin ser detectados, exponiendo al sitio a posibles ataques si el servidor externo es comprometido"
  },
  {
    "id": "GD772-114",
    "title": "ADICIONAR INFORMACIÓN DE TENGO DUDAS DE MIS REEMBOLSOS AL INFORME CONSOLIDADO",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "[20/06/2025]:Validara requerimiento y estimara tiempo de  desarrollo.\n[25/06/2025]:Este informe ya fue desplegado exitosamente a producción el 24 de junio. Fue integrado a la pestaña Digitación y se unificó el manejo de dudas y pendientes por digitar, mejorando la centralización de datos.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "MDSB-833556",
    "title": "CDC-T, req GD772-60 Descarga automática de informes",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "19/06/2025",
    "observations": "19 de junio Se escala control de cambios en test para alterar una tabla y se crea otra. Control de cambios ejecutado correctamente. \n[02/07/2025]: Control de cambios aprobado, se ejecutara 3 de Julio 4pm.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Migración S3 y aplicaciones a EBS",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "20/06/2025",
    "observations": "[19/02/2025] se tuvo sesion Con Juan Angel  para validar como hacer la copia de los documentos y se definio un orden para hacer las trasferencias, se programara la tarea para el 20 de Febrero y se validara el 21 de febrero el resultado\n[21/02/2025] La tarea programada para la trasferencia de las imagenes se ejecuto ayer 20 de febrero y hoy se realizara la  validación de  resultados.\n[24/02/2025] Se realizó la validación, pero no se evidenciaron resultados. Se consultará con la persona encargada para determinar la razón por la cual la transferencia no fue exitosa\n[26/02/2025] Se radica ticket MDSB-770619 solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3.\n[27/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[28/02/2025] El Ticket MDSB-770619 escalado a bolivar  solicitando apoyo para ejecutar la transferencia de archivos desde el disco FS hacia el bucket S3 se en cuentra en estado en proceso.\n[04/03/2025] No hay avances ni respuestas al ticket  MDSB-770619 sobre el paso de documentos;\n[11/03/2025]: Se comenta el ticket MDSB-770619 solicitando avances en la solicitud o si se requiere alguna información adicional o algún ajuste de nuestra parte para avanzar con la sincronización.\n[13/03/2025]: A un no se obtiene avances del progreso del ticket MDSB-770619.\n[28/03/2025]: Depende de Varbo para transferir archivos; no hay avances locales por ahora.\n[02/04/2025]: Ayer Infraestructura de Bolivar  realizo la sincronizacion del primer directorio Sincronización de /opt/storage/img04/arp, e indican que seguiran migrando los directorios en las noches ya que generan  afectacion en el servidor.\n[03/04/2025]: Hoy infraestructura  informa la fecha tentativa de finalizacion es el 4 de abril. el dia de hoy estan terminando la carpeta IMG02\n[04/04/2025]: el 3 de abril  en la noche se detuvo la transferencia de documentos debido a que  ocaciono la  caida del servidor a 10:52 pm.\n[07/04/2025]: Confirman finalizacion del paso de documentos, Se solverificar que el tamaño del disco S3 corresponda al mismo del FS.\n[09/04/2025]: De acuerdo a la sesion con infraestructura de bolivar  se  Construira plan de paso Fs a S3, hoy se pasa el faltante y se expone el s3 a producción.\n[10/04/2025]  se confirma paso de toda la informacion MDSB-770619\n[28/04/2025]: sin cambios por parte de bolivar\n[14/05/2025] : verificar la transferencia de archivos, ya que se completó la transferencia de los documentos faltantes.\n[16/05/2025] : Validara la  cantidad de documentos tranferidos y dara respuesta al correo\n[19/05/2025] : El viernes 16 de mayo se revisó la transferencia de archivos, donde se detectaron diferencias que fueron comentadas en el jira.\n[21/05/2025] : Implementara logica para el conteo de imagenes y  se prepara  para  realizar el cambio del disco el jueves 22 de mayo a las 6pm.\n[23/05/2025]: El 21 de mayo se implementó una lógica para el conteo de archivos transferidos, como parte de la preparación para el paso a producción programado para el lunes 26 de mayo. Las pruebas realizadas el 22 de mayo permitieron validar el montaje del FS en una unidad alternativa, lo cual ofrece flexibilidad para intervenir manualmente en caso de archivos faltantes o fallidos. Infraestructura será responsable de la transferencia de los registros faltantes durante el fin de semana, con posibilidad de apoyo nuestro si es necesario.\n[26/05/2025]: Se avanzó en los conteos correspondientes a img04. Se espera consolidar los resultados en el transcurso del día para dar respuesta formal con evidencias a los correos correspondientes.\n[28/05/2025]: El conteo de datos para FS y S3 sigue pendiente. se planea terminar hoy el conteo y compartir evidencias para análisis, el paso a produccion sigue pendiente.\n[30/05/2025]: El 28  de mayo se termina el conteo y se envian evidencias, pendiente  confirmación de Bolivar.\n[13/06/2025]: Se ajustaron fechas para realizar un nuevo reconteo de archivos transferidos\n[19/06/2025]: Para  el viernes  20 de junio se programo Ventana de mantenimiento a las 5 pm para  realizar paso a producción.\n[25/06/2025]: El viernes 20 de junio se intentó realizar el paso a producción, pero no fue exitoso, ya que al momento de cargar archivos el sistema no lo permitía debido a temas de permisos que no pudieron resolverse en ese momento,Por esta razón, fue necesario reversar la implementación.Se estima realizar nuevamente el paso a producción el día jueves 26 de junio.\n[23/07/2025]: Durante los días anteriores se trabajó en la transferencia de aplicaciones y logs desde las instancias actuales al servicio de almacenamiento EBS y S3, como parte del proceso de migración.\n[25/07/2025]: El día miércoles 23 se avanzó en la organización de uno de los temas relacionados con la migración. Específicamente, se trabajó en la copia y transferencia de aplicaciones desde el entorno OPT hacia EBS. Adicionalmente, se realizó la organización del ambiente, actividad necesaria para preparar las condiciones adecuadas que permitan una migración efectiva y sin contratiempos.\n[30/07/2025: Genero reporte de incidencia , esta tarea se da como finalizada  para dar paso a una nueva opción de almacenamiento hibrido.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Restablecimiento de contraseña en Laravel",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/06/2025",
    "endDate": "27/06/2025",
    "observations": "[05/06/2025]:El 5 de Junio se realiza ajuste a test para  pruebas,\n[06/06/2025]: Se realizan  pruebas y se identifican  2 hallazgos  pendiente su solución.\n[09/06/2025]: Se pausa debido a que en el momento no tiene  acceso al entorno de pruebas (test)\n[11/06/2025]: Se confirmó que no se muestra el mensaje de “usuario no existe” cuando aplica. Para los usuarios nuevos que no pueden iniciar sesión después de restablecer la clave, Fabio realizara pruebas.\n[25/06/2025]: Pendiente  realizar pruebas por Fabio.\n[27/06/2025]: Hoy se realizara paso a producción \n[02/07/2025]: Se realizó el despliegue a producción el día viernes 27 de junio, correspondiente al ajuste que permite actualizar la tabla de usuarios en el aplicativo Laravel al momento de crear un nuevo usuario o restablecer la contraseña.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Sistematización con IA (Segunda vista de incapacidades en portal)",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 60,
    "startDate": "26/05/2025",
    "endDate": "",
    "observations": "[26/05/2025]: Iniciara validando a que sistema  o proceso implementara  sitematizacion  con IA\n[28/05/2025]: Se inicia la creación de una nueva vista de radicación con un solo paso, reduciendo la carga de datos que debe ingresar el usuario. La lógica se basará en consultar automáticamente la información relacionada a partir de la cédula del afiliado en el portal.Crean las ramas .\n[30/05/2025]: Se pausa para por prioridad de la solicituda  MDSB-822809  Descarga soportes AT 031 y AT 028\n[04/06/2025]: Aún no se ha finalizado. Falta desarrollar el botón de “finalizar” que guarde la información completa para la gestión. Ya se cuenta con el API entregado por Danilo; lo siguiente es validar toda la lógica de guardado\n[06/06/2025]: Dedicara hasta las  10 am de hoy para  finalizar el desarrollo.\n[09/06/2025]: Dedico todo el dia del 6 de Junio Tuvo inconvenientes para conectarse al API que dejó Danilo, pero en horas de la tarde logro establecer la conexión. Realizo algunas pruebas y el servicio está funcionando correctamente. Lo que queda pendiente es entrenar  un poco más el método para mejorar su desempeño.\n[11/06/2025]: Se reporta que algunas imágenes devuelven NIT en lugar de cédula.Se sugirió probar con múltiples imágenes y registrar patrones para mejoras futuras\n[25/06/2025]: Se encuentra pausado para dar continuidad a  Requerimiento gestión Medicamentos fase 2 - Sprint 2",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Validación Informes de cuentas medicas y colas de procesamiento",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "29/05/2025",
    "endDate": "27/06/2025",
    "observations": "[30/05/2025];Se identificó que los informes de reembolso no presentan problemas de rendimiento, pero el sistema puede tardar si hay varios informes en cola. Jairo está migrando el informe más pesado (por radicado) a Python usando FastAPI y Pandas.\n[04/06/2025]: A pesar de intentos de optimización con Python, los tiempos de generación siguen siendo similares No se identificaron mejoras sustanciales hasta ahora; se reconoce que el problema persiste\n[06/06/2025]: Se encuentra en validacion de opciones de mejora.\n[09/06/2025]: Iniciara validación de los demas informes.\n[11/06/2025]: Sin avances recientes. Se expusieron avances al jefe (Hernán), pero falta validación funcional.\n[13/06/2025]:  Se continuará investigando otras alternativas para optimizar el proceso\n[25/06/2025]: Se planea optimizar tiempos de carga, actualmente afectados por el incremento de volumen de datos mes a mes.\n[27/06/2025]: Se finalizó la mejora del informe con mayor volumen de datos, optimizando la consulta (query) y reduciendo el tiempo de descarga a aproximadamente 10 segundos.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "GD772-69",
    "title": "DEV,Extraccion de Imágenes ( API) (Incapacidades)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "09/06/2025",
    "endDate": "26/06/2025",
    "observations": "[04/06/2025]: Se pausa  para trabajara en  Sistematización con IA (Segunda vista de incapacidades en portal).\n[06/06/2025]: Contunuara con el desarrollo del metodo de incapacidades despues de culminar Sistematización con IA (Segunda vista de incapacidades en portal), se  estimada de entrega 9 de junio \n[09/06/2025]: Se iniciará hoy con el desarrollo del primer método del modelo de incapacidades, debido a que el 6 de junio dedico el dia al Sistematización con IA (Segunda vista de incapacidades en portal)\n[11/06/2025]: Ya  se encuentran los metodos de incapacidades y medicamentos, Hoy desarrollará el servicio y completará la URL pública para pruebas desde Postman u otros medios.\n[13/06/2025]: El 12 de junio  finalizó la lógica de firma y reestructuración del código. El API está lista, solo falta habilitar el endpoint para completar las pruebas\n[16/06/2025]: El metodo de incapacidades ya está listo  en ambiente de desarrollo (DEV). Se creó un servicio provisional mientras se habilita la URL oficial para pruebas.\n[18/06/2025]: El dominio ya está creado en DEV, pero la base de datos de imágenes no está funcionando correctamente, se acordó garantizar pruebas en DEV antes de migrar a TEST. Se cargarán imágenes de prueba.\n[19/06/2025]: Danilo escala jira MDSB-833779 a infraestructura  debido a que se  tiene acceso interno al dominio, pero externamente  se recibe un error.\n[25/06/2025]:Actualmente solo funciona la URL secundaria (opcional) en DEV La URL principal sigue pendiente por tema de permisos. El gira MDSB-833779 aún no ha sido atendido, bloqueando la validación completa.\n[26/06/2025]: Jira  MDSB-833779 fuen resulto con exito, se tiene funcionalidad en ambiente de dev, se escala jira  MDSB-836893 con la solicitud de creación del DNS en el ambiente de TEST,  Pruebas con el cliente  27 de Junio. \n[26/06/2025]: Jira MDSB-833779 fue ejecutado con éxito, se tiene funcionalidad en ambiente de dev, Pruebas con el cliente 27 de Junio.\n[27/06/2025]:Cancelada la sesion de  Pruebas por el cliente.",
    "unit": "Varbo",
    "detail": "**Requerimiento Detallado: Api’s Acceso y Receptor de Imágenes.**\r\n\r\n**Objetivo General:**\r\nImplementar un sistema centralizado que permita la consulta de imágenes mediante api’s desde diversas aplicaciones, con la capacidad de parametrizar las búsquedas y facilitar el acceso a estas imágenes por parte de aplicaciones que requiera la compañía y de este mismo modo guardar la documentación mediante api’s enviada desde cualquier actor a Imagine, es decir en doble vía.\t\r\n\r\n**Alcance:**\r\n\r\nCrear api’s de consulta y almacenamiento de imágenes, a la cual se puede tener acceso desde cualquier aplicativo designado por la compañía.\r\n\r\n\r\nRequerimiento funcional:\r\n\r\n**Sprint 1**\r\n**CA1.Consulta Parametrizada de Imágenes:** Permitir a las diferentes aplicaciones consultar imágenes basadas en los siguientes criterios opcionales **según la tipología:**\r\nTipificación (Por código asignado según proceso) - Obligatorio\r\n1.1 Incapacidades = COD1+ Minimo un campo opcional del 3 al 5.\r\n1.2 Medicamentos = COD2+ Minimo un campo opcional del 3 al 6\r\n1.3 Fallos de tutela = COD3+ Minimo un campo opcional del 3 al 5\r\n1.4 Cuentas medicas =COD4+ Minino un campo opcional del 3, 4, 5, 9 o 10.\t\r\n1.5 Nativo =COD5+ campo 2 obligatorio + Mínimo un campo opcional del 3 al 8\r\n**Nota:** La tipificación se realiza como propuesta imagine puede establecer una nueva, tener en cuenta que cada proceso nuevo en caso de que no ingrese en la tipificación anterior debe incluirse en la nueva para obtener la información.\r\nTipología del documento en nativo (incapacidades, medicamentos, cuentas médicas - reembolsos, etc., identificando la fuente: nativo, YII, Laravel)\r\nNit o número de documento asociado\r\nRango de fechas (fecha de creación o carga de la imagen), \r\nNúmero de caso Imagine\r\nNumero de solicitud (siniestro)\r\nCronograma \r\nSecuencia \r\nNúmero de Factura\r\nNit del Beneficiario\r\nCondiciones: Puede cumplir uno o varios de los anteriores criterios para la consulta.\r\n- Si la consulta es únicamente por fechas, el rango de fechas debe ser máximo de un periodo de un mes (paramétrico por días).\r\n- Para el caso de ‘Incapacidades’, se escoge dicha Tipología, la ‘Fecha de creación inicial deseada’ y la ‘Fecha de creación final deseada’ (paramétrico)\r\n- Se requiere que al aplicar un filtro se indique a través de un mensaje la cantidad de registros y solicitar un segundo filtro en caso de que el volumen sea alto**\r\n- Sí por peso no es posible entregar la información de manera inmediata se debe generar una alerta de encolamiento para la entrega de la información.\r\n\r\n1. API de Imágenes: Debe permitir consumir vía API las imágenes encontradas a partir de los criterios de búsqueda desde el servicio solicitado, se debe obtener las url prefirmada que contiene los requisitos de seguridad (bajo el mismo modelo del servicio de recobros) \r\n\r\nDicho listado, deberá contener los siguientes datos:\r\n\r\nNumero_radicado_imagine, \r\ntipología, \r\nIdentificación_del_trabajador, \r\nurl de la imagen, \r\nfecha_radicación, \r\nIdentificación_de_persona_o_empresa_que_radica,\r\nNumero_de_solicitud (siniestro)  (aplica sólo en algunas tipologías)\r\nCronograma_SIPAB (aplica sólo en algunas tipologías)\r\nSecuencia_SIPAB (aplica sólo en algunas tipologías)\r\n"
  },
  {
    "id": "Interno-JA1",
    "title": "Automatización cuentas medicas con IA",
    "assigned": "JAIRO",
    "state": "Pausado",
    "progress": 20,
    "startDate": "03/06/2025",
    "endDate": "",
    "observations": "[04/06/2025]:Se está buscando una alternativa para mostrar avances en automatización\n[06/06/2025]: Se han tenido avances en la lógica de radicación, continuará trabajando para lograr un avance significativo y contar con algo funcional que pueda ser mostrado.\n[09/06/2025]: Se trabaja en pruebas con lotes de facturas, validando reconocimiento parcial. Avance estimado en esta tarea: 20 %.\n[11/06/2025]: No se trabajó en los últimos días. Continúa pendiente.\n[20/06/2025]: retomará revisión del tema durante el día de hoy.\n[25/06/2025]:No se reportan avances.\n[04/07/2025]: Sin avances técnicos reportados. El desarrollo sigue pendiente por falta de disponibilidad de tiempo, pero se mantiene en la lista de tareas por retomar.\n[18/07/2025]: Se reinició el trabajo con librerías de Python y PDF para seleccionar porciones de imagen, pero sin avances concretos. El desarrollo avanza lentamente por el tiempo requerido en pruebas y validaciones.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "CNTI-271",
    "title": "Vulnerabilidad, CVE-2016-4055 – DoS por expresiones regulares ineficientes en Moment.js (< v2.11.2)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "13/06/2025",
    "endDate": "14/06/2025",
    "observations": "Vulnerabilidad que permite ataques de denegación de servicio mediante uso excesivo de CPU al procesar duraciones con expresiones regulares mal optimizadas.\n[13/06/2025]: Se actualizó a la versión 2.29.4 para corregir la vulnerabilidad, se deben realizar  pruebas en test para comprobar funcionamiento.\n[16/06/2025]: Queda disponible  el 13 de Junio para  pruebas por Imagine en ambientes de test\n[19/06/2025]: El 19 de junio Fabio  realiza pruebas en ambiente de test, no se evidenció un comportamiento anómalo ante entradas no válidas, se considera viable proceder con la implementación en ambiente de producción.\n[24/06/2025]: Se realiza  implementación de la correccion de la vulnerabilidad en produccion.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno-W",
    "title": "Sistema automatizado de clasificación de correos médicos con IA",
    "assigned": "WILSON",
    "state": "En Proceso",
    "progress": 85,
    "startDate": "05/06/2025",
    "endDate": " ",
    "observations": "[16/06/2025]: Se detecto un problema en los análisis, se trabajo en una posible solución para ello, y es overfitting, que no es otra cosa que corregir estimaciones posiblemente equivocadas. Corregido por medio de scripts de testing y aquí el reporte de los resultados\n[18/06/2025]: Se encuentra  realizando  cambios en mejoras de diccionario de datos y modelos enfocados a conceptos médicos en español.\n[25/06/2025]: Actualmente se están ejecutando pruebas de ajuste fino (fine-tuning) sobre los modelos de clasificación mediante combinaciones de parámetros de entrenamiento. Esta etapa es crítica para mejorar el rendimiento del modelo sin modificar los datos base. El proceso es intensivo en tiempo y recursos, ya que cada entrenamiento toma varias horas. Se continúa enfocado en esta optimización.\n[02/07/2025]: El desarrollo presenta un avance del 85%. Se han realizado pruebas unitarias y automatizadas con PyTest, orientadas a implementar integración y despliegue continuo (CI/CD). Se trabaja en el ajuste fino de los modelos (fine-tuning) y se analiza la calidad y relevancia de los datos para optimizar el entrenamiento. Se cuenta con el apoyo de usuarios funcionales para identificar las tipologías clave, asegurando una clasificación más precisa de los correos médicos. Pendiente iniciar la integración con el sistema de correos y montar el entorno de desarrollo en el equipo de Bolívar.\n[09/07/2025]:Se encuentra modificando el servicio para realizar la implenetaciòn.\n[14/07/2025]: Se va a utilizar el ambiente duplicado existente para lanzar entrenamientos del modelo sin afectar producción. Se creará una vista que concentre los datos requeridos para el entrenamiento y así evitar la dispersión sobre múltiples tablas. El objetivo es iniciar esta semana pruebas con DigiVet y observar el comportamiento del modelo. De los resultados dependerá su implementación definitiva.",
    "unit": "Varbo",
    "detail": "**Sistema automatizado de clasificación de correos médicos con IA**\r\nSistema automatizado de clasificación de correos médicos usando inteligencia artificial avanzada. Combina múltiples modelos (ensemble) y procesamiento especializado de lenguaje médico.\r\n\r\n**RESULTADOS DESTACADOS**\r\n**Métricas de Rendimiento**\r\n• Precisión: 100% \r\n• Consistencia: 100% validación cruzada \r\n• Procesamiento: 980 correos \r\n• Categorías: 20 tipos diferentes \r\n• Características: 3,800 términos médicos\r\n\r\n** Innovaciones Implementadas**\r\n\r\n**Sistema Inteligente Múltiple:**\r\n• Combina varios modelos de IA \r\n• Mayor precisión y robustez ⚡\r\n• Se adapta a diferentes tipos de correos \r\n\r\n**Procesamiento Médico Especializado:**\r\n• Modelo en español avanzado\r\n• Reconoce términos médicos \r\n• Estandariza la terminología \r\n\r\n**BENEFICIOS CLAVE**\r\n\r\n**Operativos:**\r\n• Clasificación automática inmediata \r\n• Menos trabajo manual \r\n• Resultados consistentes \r\n\r\n**Técnicos:**\r\n• Sistema adaptable y robusto \r\n• Aprende continuamente \r\n• Especializado en términos médicos \r\n\r\n**PLAN DE IMPLEMENTACIÓN**\r\n1. Despliegue en producción \r\n2. Setup de monitoreo \r\n3. Capacitación equipo \r\n\r\n**Postproducción:**\r\n1. Evaluación en producción \r\n2. Mejoras por feedback \r\n3. Expansión capacidades \r\n\r\n**Pendientes:**\r\n1. Integración sistemas médicos \r\n2. Aprendizaje automático \r\n3. Más categorías \r\n\r\n**Implementación:**\r\n• Despliegue paso a paso \r\n• Monitoreo constante \r\n• Validación periódica \r\n\r\n**Mejoras por realizar:**\r\n• Integrar estándares médicos \r\n• Diccionarios especializados \r\n• Validación cruzada términos \r\n\r\n**Mantenimiento:**\r\n• Updates periódicos \r\n• Reentrenamiento programado \r\n• Control de métricas \r\n\r\n**CONCLUSIÓN**\r\nSistema robusto y eficiente para clasificación automática de correos médicos. Resultados perfectos en pruebas iniciales. Combina múltiples modelos de IA con procesamiento especializado médico.\r\n**LOGROS CLAVE**\r\n•\t100% precisión\r\n•\tValidación perfecta\r\n•\tProcesamiento rápido\r\n•\tEspecializado en medición\r\n"
  },
  {
    "id": "Interno",
    "title": "Desarrollo de informe interactivo de requerimientos",
    "assigned": "FABIO",
    "state": "En Proceso",
    "progress": 80,
    "startDate": "12/06/2025",
    "endDate": " ",
    "observations": "[20/06/2025]: Se esta trabajando en la actualizacion de req en el informe y en la  adicion del campo \"Detalle de req\"\n[25/06/2025]: Ya se encuentra el campo detalle req, se esta trabajando en la forma de alimentar este campo y el ingreso del historico de las observaciones de  cada req. \n[01/07/2025]: Se realiza actualización de estado de Req  y  cambio de Nombres de las  Unidades.\n[09/07/2025]: Se está actualizando el informe con los detalles de los requerimientos y la trazabilidad de la gestión realizada. Adicionalmente, se ha venido desarrollando un módulo que permitirá a cualquier usuario con acceso al informe ingresar observaciones relacionadas con el contenido o el avance de los requerimientos.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Pruebas listas blancas para factor de doble autenticación",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "[24/06/2025]: Se realizan pruebas al ingresar a un usuario en listas blancas y se deja activo  al ingresar a laravel y Yii no solicita codigo de autenticación, se identifica que Nativo no esta solicitando codigo de autenticación a ningun usuario se escala a Jesus para su ajuste.\n[24/06/2025]: Jesus entrega ajuste, se realiza validación y se confirma funcionalidad y se le informa al cliente.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Solicitud accesos ambiente Dev y Test (Jenry)",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "25/06/2025",
    "observations": "[24/06/2025]: Se  escalan los siguientes  solicitud de accesos Dev = MDSB-835240   test= MDSB-835246\n[25/06/2025]: Se asignan permisos solicitados y se confirma acceso a dev y test correctamente.",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "MDSB-835580",
    "title": "Jira dia a dia ajustar actividades caso 31012936 incapacidades",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress":100,
    "startDate": "25/06/2025",
    "endDate": "25/06/2025",
    "observations": "[25/06/2025]: Se presento un error en la asignación de la actividad del caso, se corrige  asignandolo a la a ctividada correcta Analista de Liquidación",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "Interno",
    "title": "Apertura de flujo de 4 casos de Preautorizaciones poliza salud - delegacion analistas creados con una sola actividad",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "25/06/2025",  
    "endDate": "25/06/2025 ",
    "observations": "[25/06/2025]: Flujos aperturados correctamente",
    "unit": "Varbo",
    "detail": ""
  },
  {
    "id": "INTERNO",
    "title": "Radicación Express con IA",
    "assigned": "DANILO",
    "state": "Pruebas Varbo",
    "progress": 90,
    "startDate": "27/02/2025",
    "endDate": "28/04/2025",
    "observations": "[28/02/2025]: modificó el script para entrenar con lenguaje natural; el modelo propio (basado en Verner) reconoce respuestas rápidas (ej. segunda opinión médica) tras retirar el destilado. Es ligero y responde rápido. Planea ajustar, subir a dev/test y usar una base preentrenada para optimizar.\n[03/03/2025]: El viernes 28  se subieron las modificaciones  a un repositorio, pero aún falta un cambio que planea terminar y desplegar hoy, tras ajustes adicionales que retrasaron el despliegue inicial a dev y test.\n[04/03/2025]: Ajustó el algoritmo del modelo (impresión y entrenamiento) el día anterior, subiendo los cambios al repositorio, pero falta un ajuste en el API para desplegarlo, ya que se alojará en un servidor distinto al de Oficina Virtual por limitaciones de capacidad; espera terminarlo pronto.\n[05/03/2025]: No ha avanzado más en Radicación Express por priorizar el API de Recobros  habló con Jenry sobre cambios adicionales y planea retomarlo tras finalizar el API esta semana.\n[06/03/2025]: Trabajó en una modificación para Radicación Express, pero no la finalizó por requerir más cambios; no dio más detalles ni avances significativos.\n[07/03/2025]: Se detiene ya que se dedicara al API de recobros.\n[10/03/2025]: Detenido ya que se encuentra trabajando en la Lectura de incapacidadaes por Python\n[12/03/2025] : Si es posible y se da el espacio en la sesion de presentación del API de recobros se realizara presentación de este requerimiento.\n[14/03/2025]: Ayer se presentó el avance del proyecto al cliente y Se realizó un ajuste en la implementación, cambiando el modelo de multi-language a una versión en español para mejorar el rendimiento. Este cambio impactó parcialmente el entrenamiento, pero se espera recuperar la estabilidad durante la semana.\n[17/03/2025]: El viernes avanzó en Radicación Express, resolviendo problemas menores, y ajustó la lógica para llevar al usuario al segundo o tercer paso tras confirmar; hoy sigue dedicado a esto, ajustando los datos enviados al formulario para finalizar esa parte.\n[18/03/2025]: Terminó la integración del formulario de Radicación Express con autorizaciones médicas, autocompletando datos (ciudad, IPS, médico) si están completos o dejando en el primer paso si no; hoy subirá los cambios tras reunirse con Jenry para validar o ajustar.\n[19/03/2025]:  Desplegó Radicación Express en test, pero enfrentó problemas de capacidad en el servidor para entrenar el modelo (100 registros fallaron); ajustó el entrenamiento a un registro cada 15 minutos, logrando 3-4 ejemplos ayer, y hoy seguirá entrenando y ajustando.\n[20/03/2025]:Verificó el modelo ayer, ajustó un fallo donde Python mataba el proceso a la mitad, y continuó el entrenamiento (pocos ciclos aún); hoy planea alcanzar 100 ciclos con registros diferentes.\n[21/03/2025]: Revisó el entrenamiento del modelo, que ya superó 100 ejemplos sin problemas ayer; hoy seguirá monitoreando y avanzando en el entrenamiento\n[27/03/2025]: El modelo ya se entrenó con los casos previos y reconoce información; hoy buscará tiempo para añadir 200 registros más para entrenar entre hoy y mañana.\n[28/03/2025]: Ayer  no adiocno\n[28/03/2025]: No revisada ayer por falta de tiempo; hoy planea agregar 500 registros para entrenar y retomar el avance.\n[31/03/2025]: El viernes agregó 173 ejemplos más (total 473 casos); el modelo entrena bien, reconoce 4 de 5 casos con léxico colombiano; hoy o mañana terminará esta tanda y planea sumar 500 registros más.\n[01/04/2025]: Ayer insertó nuevos registros para entrenar el modelo esta semana.\n[09/04/2025]:  Entrenado con 800 casos, listo en test para pruebas por Santiago o usuarios; hoy se entregará oficialmente para pruebas por el cliente, con entrenamiento continuo; estiman 8 días para producción si se prioriza.\n[28/04/2025]: Se entrega para  TEST",
    "unit": "Varbo",
    "detail": ""
    },
            {
                "id": "INTERNO",
                "title": "Lectura de incapacidades por Python",
                "assigned": "DANILO",
                "state": "Finalizado",
                "progress": 95,
                "startDate": "14/02/2025",
                "endDate": "25/02/2025",
                "observations": "[14/02/2025]  Se encuentra ajustando cambio de OCR para minimizar el tiempo de lectura realizando entrenamiento.\n[17/02/2025] Se realizo cambio de OCR, y pruebas\n[18/02/2025] ajustar un modelo diferente a ollama para mejorar la lectura del OCR.\n[19/02/2025] Continuara con los ajustes\n[20/02/2025] Realizar ajustes para hacer una entrega parcial hoy\n[21/02/2025]  En pruebas de entrenamiento al nuevo modelo.\n[24/02/2025]  Organizar datos y consultas e implementarlos en el entrenamiento del modelo para posteriormente pasar a produccion.\n[25/02/2025] Se adelanta las consultas par la construccion del dataset para entrenar el modelo (Bert), despues de terminar la construccion serla a los ambientes y comenzar con el entrenamiento.\n[26/02/2025] Se re ealiza despliegue a produccion el 25 de febrero, se realizara una modificacion  en el dataset  desplegarla  a produccion  para que se encuentre lista para usar, realizar pruebas e iniciar  entrenamiento en las noche.\n[26/02/2025]: Se suben a produccion las modificaciones y al iniciar  el entrenamiento del modelo se presentaron varios inconveniestes encuanto a nombres de facientes y fechas con la data de produccion para lo cual se debio ajustar el dataset.\n[27/02/2025]:se le daran tres ciclos de incapacidades y a medio dia validar cual fue el nivle de aprendizaje.\n[28/02/2025]:Culminó una etapa del modelo, entrenándolo con 2 ciclos (20 registros cada uno), logrando identificar nombre del paciente, fechas y número de incapacidades. Planea entrenar con un dataset más grande en la noche (por uso de RAM) y mejorar la clasificación con datos existentes\n[04/03/2025]: Ayer ajusto los scripts de entrenamiento para que esta semana se pueda entrenar más rápido el modelo.\n[05/03/2025]: Las últimas modificaciones se subieron el viernes 28 de febrero, el modelo se entrena en la noche y los fines de semana cada 6 horas con dataset construido dos horas antes; revisará resultados la próxima semana para evaluar el entrenamiento.\n[10/03/2025]; Se encuentra realizando validaciones a los resutados del entrenamiento de la semana anterior y mejorando el regex mientras el modelo mejora su entrenamiento.\n[11/03/2025]: Está trabajando en un tab para el portal de incapacidades que muestre la información leída por el modelo de IA; planea avanzar lo más posible hoy o terminarlo, sin bloqueos ni dudas reportadas.\n[12/03/2025]: Ya se encuentra ajustado el algorimo de la lectura y se guarda la  información en una tabla para mostrar la información extraida en el aplicativo de incapacidades, hoy se ajustara la vista para mostrar la  información en la consulta de incapacidades.\n[13/03/2025]: Ayer finalizó una vista para mostrar la información procesada por el modelo de IA, con ajustes adicionales completados; hoy espera definir prioridades tras una reunión de las 9 a.m.\n[14/03/2025]: Se presentó el avance del proyecto a un grupo de personas, generando gran interés Se resolvieron dudas sobre la tecnología y se trabajará en una versión más completa.\n[18/03/2025]:  No está trabajando activamente en esto; el modelo se entrena en la noche con un dataset de imágenes, pero con pocos casos aún para mejorar efectividad, y planea revisar pronto el porcentaje de precisión.\n[28/03/2025]: No le dedicó tiempo ayer; hoy buscará agregar más registros para entrenar el modelo.\n[01/04/2025]: Revisó el modelo ayer; avanza poco, pero ajustó el entrenamiento para que sea más rápido sin afectar el servidor; entrena cada 6 horas los fines de semana para aprovechar recursos.\n[09/04/2025]: Entrenado lentamente por recursos limitados (pocos ciclos para no afectar el servidor); lleva 15-20 días así, hoy revisarán su efectividad para decidir si ajustar o buscar alternativas.\n[28/04/2025] :se estima revisar nuevamene el 20 de mayo o antes si nilo lo estima\n[14/05/2025] : Se correra un comando para revisar el estado de lectura de incapacidades, medir el avance del entrenamiento y validar los resultados obtenidos.\n[19/05/2025] : No se pudo validar completamente el avance debido a una caída del servidor ocasionada por falta de direcciones IP, un problema que no había ocurrido anteriormente, validara hoy el avance\n[21/05/2025] : El 19 de mayo,Se modifico el OCR  para mejorar la lectura y confirma que ha alcanzado una efectividad del 85%.\n[28/05/2025]: Falta un detalle menor para terminar la integración de la información extraída sobre incapacidades. Planea cerrarlo hoy.\n[30/05/2025]: El 28 de mayo  Se implementó la ejecución automática de solicitudes de incapacidades a partir de la lectura con IA. Se visualiza en una pestaña separada para mostrar resultados al cliente. Se discutió que, aunque Varbo no usa actualmente los datos extraídos, la información será útil para validaciones futuras.\n[11/06/2025]: los porcentajes de efectividad no superan el 50 % en pruebas recientes. En casos revisados, los valores más comunes rondan el 37 %, incluso en incapacidades actuales. Se recomienda revisar la calidad de los documentos fuente y optimizar la lógica de extracción\n[13/06/2025]:No se ha podido validar el rendimiento del modelo \n[27/06/2025]:Pendiente validacion de efectividad  en la lectura  y ajuste del OCR  para disminuir el consumos de recusos.",
                "unit": "Varbo",
                "detail": ""
           },
            {
                "id": "INTERNO",
                "title": "Realizar Imagen de docker de nativo para Jesus",
                "assigned": "JESUS",
                "state": "Pendiente",
                "progress": 0,
                "startDate": "",
                "endDate": "",
                "observations": "[27/02/2025]: No se ha podido realizar  debido que se encuentra en otras tareas asignadas.\n[16/06/2025]: Se reasigna tarea a Jesus debido a que Wilson  se encuentra en desarrollo de otra actividad.",
                "unit": "Varbo",
                "detail": "",
                "visible": false
            },
            {
                "id": "INTERNO",
                "title": "Ajustar los portales para ser responsive",
                "assigned": "DANILO",
                "state": "Pausado",
                "progress": 5,
                "startDate": "05/05/2025",
                "endDate": "",
                "observations": "[07/05/2025] : se inicia el lunes con el desarrollo de los compos responsive en los portales. Danilo esta a medios tiempos  combinando con Proteccion\n[12/05/2025] : Se define  y continuar  despues  de realizar  el req Lectura de nuevos datos de ordenes medicas  con IA\n[28/05/2025]: Continuara pausado dando prioridad al req GD772-109 Lectura de nuevos datos de ordenes medicas  con IA con el fin de dejarlo terinado antes de salir a vacaiones el martes 3 de Junio.",
                "unit": "Varbo",
                "detail": ""
            },
  {
    "id": "MDSB-837144",
    "title": "CDC-P, req GD772-60 Descarga automatica de informes",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/06/2025",
    "endDate": "03/07/2025",
    "observations": "[26/06/2025]: Se escala control de cambios para  produccion, Pendiente  que el cliente   pase el req GD772-60 a estado PAP para continuar con el proceso. \n[01/07/2025]: Control de cambios avanza al siguiente  estado (Validación), se estima  sea incluido en el comite de cambios digitales  el 2 de Julio. 02/07/2025: El 1 de julio se realizaron todas las aprobaciones pendientes. Actualmente, el cambio se encuentra en proceso de validación por parte del líder de Cambios Digitales, y se estima que sea incluido en el Comité de Cambios Digitales programado para el día de hoy. \n[02/07/2025]: Control de cambios aprobado, se ejecutara 3 de Julio 4pm.\n[03/07/2025]: Control de cambios ejecutado con exito.",
    "unit": "Varbo",
    "detail": ""
    },
  {
    "id": "Interno",
    "title": "Monitoreo de carga y alertas del servidor",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 90,
    "startDate": "17/06/2025",
    "endDate": "12/06/2025",
    "observations": "[11/06/2025]: El 10 de junio se implementó lógica para enviar correos cuando el load average y el uso del procesador superan umbrales definidos.\nSe toman snapshots para detectar procesos que generan cuellos de botella.\nContinúan ajustes y pruebas en esta funcionalidad.\n[13/06/2025]: el 11 de junio se finalizó la implementación del monitoreo de carga, RAM y procesadores, con toma de snapshots cada minuto ante sobrecarga. El envío de alertas por correo quedó pendiente de implementar mediante Exchange para evitar abrir puertos. Se acordó dejarlo “en proceso” para retomarlo más adelante si es necesario.",
    "unit": "Varbo",
    "detail": ""
    },
  {
    "id": "Interno",
    "title": "Desarrollo clasificador de imágenes en Python",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 80,
    "startDate": "15/05/2025",
    "endDate": "",
    "observations": "[16/05/2025] : Ya se encuentra  funcional en local, Se planteó la necesidad de buscar imágenes similares almacenadas en el disco compartido (IMG04) para   realizar  pruebas\n[19/05/2025] : el clasificador de imágenes está en ambiente de prueba, pero aún se requieren imágenes para probarlo adecuadamente. Se discute la posibilidad de generar imágenes desde archivos PDF si no se encuentran imágenes reales\n[26/05/2025]: El Viernes 23 de mayo se implemento en el lector de PDF,  clasifica correctamente los archivos visuales, pero aún no segmenta adecuadamente los PDFs por tipo, agrupándolos en una sola carpeta. Se continuarán pruebas con PDFs diversos para refinar la lógica de clasificación.\n[28/05/2025]: Las pruebas realizadas con el clasificador de archivos PDF no han alcanzado los resultados esperados. Se evalúan otras opciones, pero el enfoque actual está en la funcionalidad de Sistematización con IA (Segunda vista de incapacidades en portal).",
    "unit": "Varbo",
    "detail": ""
    },
  {
    "id": "GD772-69",
    "title": "Documentacion APi incapacidades (Seguridad)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/06/2025",
    "endDate": "27/06/2025",
    "observations": "27/07/2025: entrega doucmentación de seguridad",
    "unit": "Varbo",
    "detail": "Se requiere realizar la documentación de seguridad en la implementación del API de incapacidades en el ambiente de DEV"
    },
  {
    "id": "GD772-69",
    "title": "Hacer contrato API incapacidades",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "26/06/2025",
    "endDate": "26/06/2025",
    "observations": "27/07/2025: Entrega Documentación del API de incapacidades.",
    "unit": "Varbo",
    "detail": "Se requiere realizar la documentación de la implementación del API de incapacidades"
    },
  {
    "id": "GD772-69 test",
    "title": "TEST Extraccion de Imagenes ( API) (Incapacidades en test)",
    "assigned": "JESUS",
    "state": "Paso a Producción",
    "progress": 95,
    "startDate": "02/07/2025",
    "endDate": "07/07/2025",
    "observations": "[02/07/2025:]Pendiente desplegar en test para validar permisos de IP y dominio. Se coordinarán pruebas desde cada estación de trabajo.\n[07/07/2025]: Se deben realizar validaciones sobre los tiempos de respuesta, ya que se ha evidenciado que las consultas presentan demoras en el ambiente de test, a diferencia del comportamiento observado en el ambiente DEV.\n[07/07/2025]:  Se optimizó el código y se modificó la forma de consultar y generar el recurso en S3.Anteriormente, el proceso se realizaba a través de un subproceso; ahora se utiliza una función propia de S3, lo que permitió agilizar la consulta en un 85%.\n[08/07/2025]: Se realiza entrega al cliente para pruebas.\n[14/07/2025]: El cliente ha dado el visto bueno para realizar el paso a producción; sin embargo, este se ejecutará únicamente una vez se haya completado el paso correspondiente al S3.\nSe realiza solicitud de creación del DNS en produccion MDSB-846727\n[15/07/2025]:Confirman creación del subdominio solicitado en MDSB-846727.\n[16/07/2025]:Se realizara hoy a las 3pm el paso a producción, pero sin habilitar consumo hasta que S3 esté listo en producción.\n[18/07/2025]: Pendiente paso a produccion por falta de comunicación DNS, se escala jira MDSB-848376 reportando incidencia. Se planea revisar hoy luego de finalizar pruebas del S3.\n[22/07/2025]: El 22 de julio dan respuesta al jira MDSB-848376 indicando que el ajuste fue aplicado y ya permite usar el DNS.",
    "unit": "Varbo",
    "detail": "Se requiere realizar implementación del API de incapacidades en el ambiente de TEST"
    },
  {
    "id": "GD772-69",
    "title": "Error de acceso en test con TLS y certificados ( Api incapacidades)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/07/2025",
    "endDate": "02/07/2025",
    "observations": "[02/07/2025]: Se prioriza identificar si el fallo es por cifrado propio o por certificados del proveedor. \n[02/07/2025]:No fue posible solucionar el error, entonces se agregó el comentario al ticket MDSB-837736 solicitando añadir imaginex-test-documentos.segurosbolivar.com a Alternate Domain Names (CNAMEs) del CloudFront.\n[04/07/2025]:El problema de acceso en el ambiente de pruebas fue resuelto el 2 de julio; el API ya se encuentra funcional con el DNS y TLS configurados. Actualmente se identifican problemas de lentitud en las consultas, posiblemente por la firma o consulta de imágenes. Se recomienda evaluar el rendimiento para optimizar el tiempo de respuesta.",
    "unit": "Varbo",
    "detail": "Descripción del Error de Acceso en Ambiente TEST - TLS/Certificados\nContexto:\nDurante las validaciones en el ambiente de pruebas (TEST), se identificó un error persistente al intentar establecer conexión segura con el servicio externo de la FI (presumiblemente una plataforma de terceros). Este acceso requiere protocolo HTTPS y autenticación mediante certificados digitales.\n\nDescripción técnica del error:\nEl sistema no logra establecer una conexión TLS exitosa. Se realizaron intentos de ajuste en los siguientes elementos sin éxito:\n\nCambios en la configuración del protocolo TLS (probando versiones TLS 1.2 y TLS 1.3).\n\nModificación del tipo de cifrado utilizado.\n\nValidación del certificado digital instalado (vigencia, cadena de confianza, nivel de cifrado).\n\nPosibles causas identificadas:\n\nIncompatibilidad de cifrados: El entorno de prueba puede estar utilizando un algoritmo de cifrado no soportado por el servidor destino.\n\nProblemas con el certificado digital: El certificado podría no estar correctamente instalado, o no ser reconocido como válido por el servidor destino.\n\nConfiguración del servidor destino: El error podría estar en el extremo del proveedor, si este no acepta conexiones desde el ambiente de TEST o está filtrando por tipo de certificado.\n\nAcción en curso:\nSe está intentando aislar si el error se debe a:\n\nUn problema local del ambiente TEST (mala configuración de TLS/certificado).\n\nO una restricción del proveedor externo (rechazo del certificado o incompatibilidad de conexión).\n\nPróximos pasos:\n\nContinuar validación detallada de los logs de conexión.\n\nReportar oficialmente al proveedor si se confirma que el certificado y configuración local son correctos.\n\nRegistrar el incidente en el sistema de tickets internos una vez se defina la causa raíz."
    },
  {
    "id": "Interno",
    "title": "Mejoras informes  por radicado producto Salud ",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/06/2025",
    "endDate": "03/07/2025",
    "observations": "[02/07/2025]: Se avanzó en un 70% con el desarrollo del informe por radicado específico para el área de Salud. Se separó la lógica del informe de los casos ARL y EPS para facilitar su mantenimiento, y se optimizó la consulta SQL mejorando el rendimiento. Actualmente se están realizando pruebas de validación con datos reales, y se espera replicar mejoras de tiempo similares a las obtenidas en el informe de ARL. Pendiente validación final en ambiente de producción.\n[04/07/2025]:Se avanzó con pruebas en producción del informe. El query ya está construido y se están realizando validaciones con datos reales.\n[07/07/2025] : El nuevo informe por radicado fue desplegado a producción el 4 de julio, reduciendo el tiempo de ejecución de 40 a 2 minutos.",
    "unit": "Varbo",
    "detail": "**Mejora del Informe por Radicado – Salud**\r\n**Objetivo del requerimiento:**\r\nImplementar una versión optimizada del informe por radicado específicamente para el área de Salud, separada de los informes de ARL y EPS, debido a diferencias en estructura de datos y campos requeridos.\r\n"
    },
  {
    "id": "Interno-f1",
    "title": "Pruebas Sistematización con IA (Segunda vista de incapacidades en portal)",
    "assigned": "FABIO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Varbo",
    "detail": "Se requiren realizar pruebas y documentarlas  para demostrar avances en el entrenamiento del modelo de lectura de incapacidades por IA."
  },
  {
    "id": "Interno",
    "title": "Validaciòn apertura de dos actividades en un mismo caso en Nativo.",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 80,
    "startDate": "04/07/2025",
    "endDate": "",
    "observations": "[04/07/2025]: se abordarán posibles inconsistencias con doble actividad en la gestion de casos en nativo.\n[07/07/2025]: El día viernes 4 de julio se realizó una revisión del problema relacionado con la apertura de dos actividades simultáneas. En nuestro caso, se analizaron aspectos del flujo, sus condiciones y las tablas involucradas. Se sostuvo una reunión en la tarde para este fin, pero no se alcanzó a concluir el análisis, por lo que se propone agendar un nuevo espacio para continuar con la revisión del tema.\n[07/07/2025]: El día viernes 4 de julio se analizaron aspectos del flujo, sus condiciones y las tablas involucradas. Se sostuvo una reunión en la tarde para este fin, pero no se alcanzó a concluir el análisis, por lo que se propone agendar un nuevo espacio para continuar con la revisión del tema.\n[14/07/2025]: Se dará inicio al análisis de los casos que se encuentran duplicados. El pasado viernes 11 de Julio se construyó un query  inicial para identificar los registros, y a partir de hoy se comenzará la revisión detallada caso por caso. Antes de proceder con los cierres, se validará nuevamente si cada caso puede o no cerrarse.\n[18/07/2025]: Se completó la revisión con la última condición enviada por el solicitante ( a menos que tenga act.cambia_user_asig = true si esta como true o 1 entonces busca a otro usuario.).",
    "unit": "Varbo",
    "detail": "Se requiere validar el porque se abren 2 actividades en la Gestion del mismo caso en Mativo ",
    "visible": true
    },
  {
    "id": "MDSB-838905",
    "title": "Jiras dia dia Inhabilitar 3 tipologias a 3 usuarios.",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "03/07/2025",
    "endDate": "03/07/2025",
    "observations": "[03/07/2025]: se realiza inactivaciòn de  los  usuarios en las  tiplogias (1031) Traslado de Polizas,(10493)Mesa de Conciliacion Presencial y (10494)Mesa de conciliación Virtual ",
    "unit": "Varbo",
    "detail": "**SOLICITUD DESHABILITAR TIPOLOGIAS PARA USUARIO**\r\n\r\nBuenos dias, solicitamos por favor inhabilitar las tipologias de “Traslado de Polizas”, “Mesa de Conciliacion Presencial” y “Mesa de conciliación Virtual”, para los siguientes usuarios, esto debido a que los funcionarios van a estar fuera por un tiempo por incapacidad medica y vacaciones.\r\n\r\nJOHN ALEJANDRO MARTÍNEZ __1032366925\r\n\r\nGIOVANNY STIVEN NIETO__1003530364\r\n\r\nNATALIA ROCIO CUBIDES__1007155376",
    "visible": true
    },
  {
    "id": "Interno",
    "title": "Implementar cambio de contraseña a 30 dias en los tres aplicativos.",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": " ",
    "observations": "[30/05/2025]:Se tiene previsto evacuar los requerimientos prioritarios para poder dar inicio a las validaciones correspondientes",
    "unit": "Varbo",
    "detail": "Implementar la solicitud automatica de cambio de contraseña a los 30 dias en los tres aplicativos",
    "visible": false
    },
  {
    "id": "MDSB-835432",
    "title": "Jira dia a dia Error en cargue de anexos de casos en Nativo.",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "04/07/2025",
    "endDate": " ",
    "observations": "[07/07/2025]: El viernes 4 de julio se implementó solución para prevenir la visualización incorrecta de archivos cargados simultáneamente por usuarios. Falta realizar pruebas en test para validar y solicitar paso a producción.\n[07/07/2025]: La causa del comportamiento fue la ausencia de control para manejar cargas concurrentes. Como solución, el equipo de desarrollo implementó un ajuste en el sistema que permite que, en adelante, los documentos se guarden uno a uno y en el orden en que se reciben, evitando así cualquier sobrescritura o cruce de archivos entre casos.",
    "unit": "Varbo",
    "detail": "**Error en cargue de anexos de casos**\nUsuaria reporta que al realizar el cargue de anexos al caso 39172703 por parte del usuario Leidy Mayorga a las 2025-06-24 13:50:11, se identifica que en el caso queda anexo un documento que NO se estaba cargando, ni se encuentra en mi equipo  al momento del cargue (es un documento totalmente ageno a la operación) este queda cargado bajo la imagen 02; sin embargo en ningun momento se realizo el cargue de esta información.\n\nSe realiza la validación del documento y se observa que corresponde al caso 39177232 el cual fue cargado por el usuario AURA VANESSA OLARTE a las 2025-06-24 13:50:17 momento de creación del caso, lo unico que coincide es la hora del cargue",
    "visible": true
    },
  {
    "id": "MDSB-707440/GD772-74",
    "title": "Generación de plantillas de cartas (glosa total, glosa parcial, devolución) Para Reembolsos ARL",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "07/07/2025",
    "endDate": "11/07/2025",
    "observations": "[07/07/2025] : Inicia con la generación de plantillas de cartas de respuesta (glosa total, glosa parcial, devolución), Con estas cartas finaliza el desarrolle del Portal reembolsos ARL (FLUJO YII).\n[09/07/2025]: Retomara desarrollo tras finalizar el Levantamiento nueva máquina virtual.\n[11/07/2025]:Las Plantillas ya estan listas con inserciones preparadas, se realizara despliegue a test para  realizar  pruebas.\n[14/07/2025]: Se Realizan pruebas pero fallaron, se estima entregar hoy antes de mediodía.\n[16/07/2025]:El 15 de julio el  portal  fue entregado al cliente para pruebas, se entregaron tanto las cartas como la funcionalidad del flujo completo.",
    "unit": "Varbo",
    "detail": "En el Portal de Reembolsos A.R.L. se tiene pendiente la elaboración de plantillas para cartas específicas (glosa parcial, glosa total, entre otras), según lineamientos enviados previamente por el cliente. La tarea se había dejado pendiente, pero se prevé retomarla hoy 7 de Julio."
  },
  {
    "id": "Interno-JA2",
    "title": "Mejoras informe total producto Salud.",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "15/07/2025",
    "endDate": "15/07/2025",
    "observations": "[07/07/2025] Se estima iniciar con la validación de este informe tan pronto finalice la Generación de plantillas de cartas (glosa total, glosa parcial, devolución) Para Reembolsos ARL.\n[09/07/2025]: Iniciara mejoras  tras finalizar la  Generación de plantillas de cartas (glosa total, glosa parcial, devolución) Para Reembolsos ARL.\n[16/07/2025]:Se inicio  el 15 de julio con la mejora del informe con revisión del query para optimización. Actualmente en un 5% de avance.\n[18/07/2025]: Se aplicaron mejoras al query del informe y se inició la validación de rendimiento respecto a la versión anterior. Se estima un 80% de avance manteniendo los mismos modelos usados en informes anteriores, con ajustes en operaciones específicas.\n[21/07/2025]: El viernes 18 de julio se realizaron pruebas sobre el informe para validar que los datos coincidieran entre ambos lados. Aunque inicialmente se evidenció una diferencia en la cantidad de registros, se confirmó que los datos eran correctos. Se avanzó en el ajuste para que solo se muestre el valor de la factura y la cédula en la primera línea, como requiere la estructura del informe, posiblemente por una macro de validación en Excel. Actualmente se continúan realizando correcciones para que el formato final sea consistente.\n[23/07/2025]: Se realiza paso a produccion el 21 de julio de los ajustes del informe total de salud.",
    "unit": "Varbo",
    "detail": " **Objetivo del requerimiento:**\r\nImplementar una versión optimizada del informe total específicamente para el área de Salud.",
    "visible": true
  },
  {
    "id": "MDSB-842592",
    "title": "Jira dìa a dìa, Cambiar planilla de ingresos en oficina virtual ARL.",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "07/07/2025",
    "endDate": " 07/07/2025",
    "observations": "[07/07/2025]: Se realiza cambio de planilla ",
    "unit": "Varbo",
    "detail": "**Descripción**\r\n\r\nCordial saludo,\r\nDe la manera más atenta nos permitimos solicitar su apoyo actualizando al formulario anexo de ingreso en la oficina virtual, remito a continuación la ruta en la oficina virtual para su conocimiento y fines pertinentes:\r\n\r\n**RUTA OFICINA VIRTUAL:**\r\n1. Acceso a oficina virtual: \r\nPortales Seguros Bolivar \r\n2. Empresa > Solicitudes ARL > \r\n3. Subtipo de solicitud >Novedades \r\n4. Tipo de solicitud  > 2 - Novedades manuales de ingresos y retiro\r\n5. “Descargar novedades de ingreso”\r\n\r\nEsta actualización permitirá que nuestros clientes puedan descargar desde la Oficina Virtual la plantilla vigente y actualizada para el proceso.\r\n\r\nAnexo el print de la oficina virtual, y el formulario correcto para actualización en esta tipología. ",
    "visible": true
  },
  {
    "id": "Interno-Je1",
    "title": "Validaciòn CASO 31016845, no pasa  de estado radicaciòn (Incapacidades)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "10/07/2025",
    "endDate": "10/07/2025",
    "observations": "[10/07/2025]: Se  realiza apertura del flujo para  continuar su gestion.",
    "unit": "Varbo",
    "detail": "El caso 31016845 se gestiona en la activadad radicaciòn, pero no pasa a la siguiente actividad analista de liquidaciòn",
    "visible": true
  },
  {
    "id": "Interno-JA3",
    "title": "Devolver a Seguimiento para firmeza el radicado 30949303",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/07/2025",
    "endDate": "08/07/2025",
    "observations": "[09/07/2025]: Se le elimino la linea de cierre caso y se dejó en seguimiento firmeza.",
    "unit": "Varbo",
    "detail": "Por favor retornar el radicado 30949303 a la actividad “Seguimiento para firmeza” Según autorización de Cristian dado que es un caso muy atípico.",
    "visible": true
  },
  {
    "id": "Interno-JA4",
    "title": " Corregir CC a los  casos 31010548 - 31010549 en pensiones",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/07/2025",
    "endDate": "08/07/2025",
    "observations": "[09/07/2025]: El 8  de junio se realiza correciòn de la CC en los casos solicitados.",
    "unit": "Varbo",
    "detail": "Corregir nùmero de CC por la correcta CC 1053767667 en los casos 31010548 - 31010549 de pensiones ",
    "visible": true
  },
  {
    "id": "Interno-JA5",
    "title": "Levantamiento nueva máquina virtual",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/07/2025",
    "endDate": "09/07/2025",
    "observations": "[09/07/2025]:Ayer 8 de Julio se inició el levantamiento de una nueva máquina virtual para dar continuidad a los desarrollos, debido a fallas presentadas en los discos de la máquina física (RAID dañada), lo que obligó a migrar el entorno.\n[11/07/2025]: Fue completado el levantamiento de la máquina virtual necesaria para continuar el desarrollo. Se configuró con una base de datos y entorno de trabajo básico. Esto desbloquea tareas de desarrollo local.",
    "unit": "Varbo",
    "detail": "La máquina física que utiliza Jairo habitualmente para desarrollo presentó fallas críticas en el sistema de discos (RAID), impidiendo la recuperación del entorno anterior a pesar de intentos manuales de reparación.\nComo medida alternativa, procedió con el levantamiento de una nueva máquina virtual, la cual ya se encuentra casi completamente configurada. Esta nueva VM será utilizada como entorno de desarrollo temporal mientras se resuelve o reemplaza el hardware afectado.",
    "visible": true
  },
  {
    "id": "Interno-JA6",
    "title": "Revisión  devolución de facturas pensionados",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": "[16/07/2025]: Se requiere reemplazar la vista materializada para cumplir con políticas de permisos de producción. Se está evaluando el cambio por una vista normal o query directo. En el momento se encuentra en evaluacion tecnica.\n[20/08/2025]: Requiere retomarse. Se definió como prioridad continuar después de finalizar el req GD772-123 Asignación y Gestión de Tareas en la Solución de Cuentas Médicas, ya que implica rehacer parte de la tabla de facturas de devolución y validar nuevamente con control de cambios.",
    "unit": "Varbo",
    "detail": "Se evaluó un requerimiento antiguo relacionado con devoluciones en pensiones, el cual actualmente utiliza una vista materializada. Sin embargo, esta solución no es viable en el entorno actual, ya que requiere permisos de tipo OWNER, los cuales son restringidos por AWS.\nComo alternativa, se concluyó que la vista debe ser reemplazada por una consulta directa, opción que actualmente se encuentra en proceso de revisión.",
    "visible": false
  },
  {
    "id": "GD772-116",
    "title": "Pruebas  gestión Medicamentos fase 2 - Sprint 2",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "11/07/2025",
    "endDate": " ",
    "observations": "[11/07/2025] Se inician pruebas del modulo de consulta en oficina virtual.\n[16/07/2025]: Se evidencian mejoras orientadas a la experiencia de usuario. Se ha probado la marcación efectiva en la consulta del portal. Aún se encuentra pendiente la validación del módulo de gestión y la prueba de las cartas de respuesta.\n[18/07/2025]: Se finalizan las pruebas y los ajustes por parte de Jesús sobre los hallazgos identificados.",
    "unit": "Varbo",
    "detail": "Se evaluó un requerimiento antiguo relacionado con devoluciones en pensiones, el cual actualmente utiliza una vista materializada. Sin embargo, esta solución no es viable en el entorno actual, ya que requiere permisos de tipo OWNER, los cuales son restringidos por AWS.\nComo alternativa, se concluyó que la vista debe ser reemplazada por una consulta directa, opción que actualmente se encuentra en proceso de revisión.",
    "visible": true
  },
  {
    "id": "Interno-D1",
    "title": "Validaciòn del CRONTAB / Tareas duplicadas",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/07/2025",
    "endDate": "14/07/2025",
    "observations": "[14/07/2025]: Se tomarán medidas de mitigación: inhabilitar el servicio CRONTAB, eliminar archivos de configuración y evitar reinicios automáticos que reactiven el proceso.\n[16/07/2025]: El incidente de duplicidad en tareas por CRONTAB se resolvió, era causado por una instancia duplicada.",
    "unit": "Varbo",
    "detail": "Se evidenció una duplicación en la ejecución de tareas programadas, como la radicación automática de reembolsos. A pesar de que las líneas CRONTAB fueron comentadas, las tareas seguían ejecutándose. Esto llevó a la hipótesis de una instancia duplicada activa con las mismas tareas. Se confirmó que el servidor duplicado incluía el mismo terminador y CRONTAB activos.",
    "visible": true
  },
  {
    "id": "Interno-D2",
    "title": "Vlidaciòn de herramientas IA (Google Cloud / Varbo)",
    "assigned": "DANILO",
    "state": "Pendiente",
    "progress": 15,
    "startDate": "18/07/2025",
    "endDate": " ",
    "observations": " 21/07/2025:Se Inicio validaciòn  de las herrramientas leer documentaciòn.\n[23/07/2025]: Se exploraron herramientas de Google con el fin de evaluar su integración en los flujos actuales. Si bien se identificó que podrían ser útiles para la gestión de procesos, aún no se ha logrado una funcionalidad concreta. Se requiere dedicar más tiempo a pruebas detalladas para validar su viabilidad.",
    "unit": "Varbo",
    "detail": "Se propuso investigar si es posible aprovechar herramientas de IA ofrecidas por Google, dado el contrato que Varbo mantiene con ellos. Danilo asumirá esta tarea, con posible apoyo de Wilson para identificar contacto y canal apropiado.",
    "visible": true
  },
  {
    "id": "GD772-119",
    "title": "Hablador ficha de solicitudes médicas",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "21/07/2025",
    "endDate": "21/07/2025",
    "observations": "[21/07/2025]: Se realiza implementación del hablador solicitado, A la espera del visto bueno del cliente para la implementación en produccion.\n[23/07/2025]: El día de ayer se realizó el paso a producción del hablador en el módulo de Solicitudes Médicas, cumpliendo con los ajustes planificados.",
    "unit": "Varbo",
    "detail": "**HABLADOR SOLICITUDES MÉDICAS**\r\n\r\n\r\n1.\tSe requiere implementar un hablador en la ficha de solicitudes médicas que indique lo siguiente:\r\n\r\n\r\nRecuerda: \"Para exámenes de diagnóstico, terapias (física, respiratoria, ocupacional, fonoaudiología) o laboratorios no necesitas radicar esta solicitud. Agenda directamente con el proveedor; ellos se encargan del proceso por la web o llamando a la Línea Médica #322.\"\r\n\r\n\r\nEsta información debe verse cuando se pique en la ficha de solicitudes médicas:\r\n",
    "visible": true
  },
  {
    "id": "GD772-120",
    "title": "Bloqueo de facturas radicadas con información sensible y de manejo confidencial",
    "assigned": "JAIRO",
    "state": "Pruebas Varbo",
    "progress": 90,
    "startDate": "30/07/2025",
    "endDate": "04/08/2025",
    "observations": "30/07/2025: Se tiene previsto iniciar el desarrollo el día de hoy.\n[01/08/2025]: Se encuentra en desarrollo un administrador para gestionar el bloqueo de facturas. Se ha implementado la lógica, pero falta probar la interfaz administrable. El avance fue estimado en un 60%.\n[04/08/2025]: Se escaló el control de cambios MDSB-858377 al ambiente de pruebas (test) y fue ejecutado correctamente. A continuación, se procederá con las pruebas en dicho entorno.\n[06/08/2025]: Desarrollo en el ambiente de pruebas desde 4 de agosto.\n[11/08/2025]: Pendiente implementación de otro control para asignar permisos solo a usuarios autorizados; se espera completarlo para pasar a pruebas en TEST.\n[12/08/2025]: Se escala a test el control de cambios MDSB-862990, el cual se encontraba pendiente.Control de cambios ejecutado con exito.\n[13/08/2025]: Se realizó un cambio en el bloqueo de facturas y se tiene pendiente subir un ajuste de código adicional antes de enviarlo a pruebas.\n[20/08/2025]: Se encuentra en fase de pruebas. Se ajustó la validación para permitir el ingreso de múltiples usuarios asociados a una factura. Se evalúa la mejor forma de almacenar esta relación (tabla relacional o arreglo).",
    "unit": "Varbo",
    "detail": "Se implementó una restricción inicial para que ciertas facturas solo sean visibles por usuarios autorizados; se requiere un módulo administrativo para gestionar esta configuración.",
    "visible": true
  },
  {
    "id": "GD772-121",
    "title": "Identificar notas crédito radicadas por los prestado como estadores como nota crédito",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": " ",
    "unit": "Varbo",
    "detail": "Se solicita identificar las notas crédito radicadas por los prestadores como estado nota crédito y no como anuladas.\n Se planteó la creación de un nuevo estado llamado “Cruce de notas crédito” para mejorar la clasificación y control de estos registros.",
    "visible": false
  },
  {
    "id": "Interno-D3",
    "title": "Script para uso de aplicaciones ",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/07/2025",
    "endDate": "24/07/2025",
    "observations": "[21/07/2025]: Se revisar el contexto del script y confirmar con Alejandro si ya está implementado correctamente en proteccion. \n[30/07/2025: Script implementado  en produccion el 24 de julio",
    "unit": "Varbo",
    "detail": "Se realizar un script para analizar el uso de las aplicaciones por sitio.",
    "visible": true
  },
  {
    "id": "Interno-D4",
    "title": "Carga excesiva en servidor de portales",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "22/07/2025",
    "endDate": "23/07/2025 ",
    "observations": "[23/07/2025]: Se ha detectado una saturación de recursos en el servidor durante la ejecución de procesos masivos, particularmente durante el cargue de incapacidades. Este es un problema de comportamiento intermitente, asociado al procesamiento en tiempo real que realiza la aplicación. Actualmente, se está evaluando la posibilidad de enviar estos procesos a colas asíncronas como alternativa para reducir el impacto en los recursos del sistema. Sin embargo, esta solución podría afectar negativamente la experiencia del usuario final al introducir demoras perceptibles. Como medida prioritaria, se recomienda solicitar una ampliación de los recursos de infraestructura (memoria RAM y CPU), lo cual se considera la solución más adecuada para mantener la eficiencia del sistema sin comprometer la experiencia del usuario.\n[28/07/2025]: Se analizará la justificación para ampliar recursos del servidor (actualmente con 3 GB RAM y 2 CPU) con el fin de mitigar alertamientos por alta carga.\n[30/07/2025]: El alto consumo de recursos en el portal ya fue analizado y explicado. No se requiere intervención adicional, por lo que este punto se considera cerrado",
    "unit": "Varbo",
    "detail": "**Requerimiento: Validación del Funcionamiento de la Aplicación en Entorno de Producción**\n\n**Descripción:**\nSolicitamos tu colaboración para que, en conjunto con el Aliado de Imaginex, realicemos una validación integral del funcionamiento de la aplicación en el entorno de producción. En el último mes se han presentado varias caídas del servicio asociadas al bloqueo de la máquina con dirección IP 10.66.95.200.\n\n**Contexto:**\nA pesar de haber realizado un incremento en la capacidad de memoria y CPU del servidor, se siguen presentando consumos excesivos de recursos que provocan el bloqueo total de la máquina, obligando a realizar un reinicio como única medida de recuperación.\n\n**Objetivo del requerimiento:**\nIdentificar la causa raíz del comportamiento anómalo que genera el consumo excesivo de recursos del sistema. Esta validación es crítica, ya que todo indica que, independientemente de la capacidad asignada, la aplicación continúa escalando su consumo hasta provocar la caída del entorno.\n\n**Impacto:**\nEste comportamiento afecta gravemente la disponibilidad del servicio y la experiencia del usuario final, por lo que es prioritario determinar el origen del problema y tomar medidas correctivas que aseguren la estabilidad de la plataforma.",
    "visible": true
  },
  {
    "id": "Interno-JA7",
    "title": "Mejoras informe EPS",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "22/07/2025",
    "endDate": "25/07/2025 ",
    "observations": "[23/07/2025]: Se inició la validación del query asociado al informe EPS, con el objetivo de optimizar las consultas SQL involucradas. Esta optimización busca reducir el consumo de recursos y mejorar los tiempos de respuesta, manteniendo al mismo tiempo una estructura común y reutilizable para todos los informes. Como parte del plan de trabajo, se espera que el informe EPS esté ajustado y en producción antes del viernes.\n[25/07/2025]: Se completó el query principal del informe EPS y se encuentra en fase de pruebas, con un avance estimado del 50%.\n[28/07/2025]: Query principal terminado, se espera subirlo a producción para pruebas con datos reales hoy  antes del mediodía.\n[30/07/2025]: El informe fue desplegado en producción con formato de prueba. Se corrigieron errores detectados durante la validación (especialmente en el formato de horas). Actualmente se encuentra en fase final de pruebas para habilitar completamente su funcionamiento.",
    "unit": "Varbo",
    "detail": "**Justificación de ajuste del informe EPS:**\nAunque inicialmente no se tenía previsto intervenir el informe EPS debido a que el producto al que pertenece está próximo a finalizar, se ha decidido priorizar su ajuste. Actualmente, este informe es el que mayor consumo de recursos está generando y ha sido identificado como el principal causante de las demoras en la generación de reportes. Por esta razón, se hace necesario optimizar su funcionamiento para mitigar el impacto en el rendimiento general del sistema.",
    "visible": true
 },
  {
    "id": "Interno-Je2",
    "title": "Inconsistencia en cargue de proveedores Yii",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "23/07/2025",
    "endDate": "24/07/2025",
    "observations": "[25/07/2025]:El día 24 de julio se realizaron los ajustes correspondientes a las validaciones, quedando el proceso de cargue completamente funcional. ",
    "unit": "Varbo",
    "detail": "Al cargar un archivo que contiene varias filas con la misma cédula de ciudadanía (CC), solo se conserva o registra la última fila, y las anteriores se pierden del sistema.",
    "visible": true
 },
  {
    "id": " MDSB-851497",
    "title": "Jiras dia dia  Validar tipologia  Gestion Tercero Sin Poliza, no Genera informe por tipologia",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "23/07/2025",
    "endDate": "23/07/2025",
    "observations": " ",
    "unit": "Varbo",
    "detail": "Agradezco su colaboración para poder generar un reporte por tipología desde un query directamente a la base de datos de imagine, ya que se generaron los reportes desde el aplicativo y se realizó una prueba de calidad y no esta generando toda la información, por ejemplo la tipología de \"Gestion Tercero Sin Poliza\" en el reporte no sale nada, pero tengo evidencia que si hay gestión para esa tipología.\n\nLos datos que requerimos son los siguientes, desde el 01/01/2023 hasta el 31/12/2024 para las tipologías \"Gestion Tercero Sin Poliza\" y \"Legalizar afiliación\"\n[25/07/2025]: El 23 de julio se realizó la validación correspondiente y se identificó que el módulo no muestra información disponible para descarga, debido a que la tipología Gestión Tercero Sin Póliza no incluye en su flujo la actividad de generación de respuesta. Esta actividad es una condición necesaria para que una tipología sea considerada dentro del informe de tipologías",
    "visible": true
 },
  {
    "id": "Interno-Je3",
    "title": "Funcionalidad para inhabilitar modificación de tipologías en Nativo",
    "assigned": "JESUS",
    "state": "Pausado",
    "progress": 70,
    "startDate": "30/07/2025",
    "endDate": " ",
    "observations": "\n[30/07/2025]: Se tiene previsto iniciar el desarrollo el día de hoy, Jenry indica que se deben eliminar los casos de la bd  y no dejarlos  ocupando espacio.\n[04/08/2025]:El viernes 1 de agosto se finalizó el query que elimina correctamente el caso y su imagen para los casos nuevos de masivos. Actualmente, se está construyendo el script que permitirá realizar un borrado controlado de las imágenes asociadas a casos antiguos en estado 'Anulado'. ",
    "unit": "Varbo",
    "detail": "Es necesario restringir cambios en tipologías una vez el portal esté activo, para evitar errores en procesos dependientes.",
    "visible": true
 },
  {
    "id": "Interno-Je4",
    "title": "Ajuste cargue masivo de marcacion  efectiva ",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 25/07/2025",
    "endDate": "25/07/2025",
    "observations": "[25/07/2025]: Se identificó que el proceso de cargue masivo de marcación efectiva no estaba tomando la línea 2 del archivo. Ante esta situación, se realizaron las modificaciones necesarias y, tras los ajustes, el cargue quedó funcional. ",
    "unit": "Varbo",
    "detail": "Es necesario restringir cambios en tipologías una vez el portal esté activo, para evitar errores en procesos dependientes.",
    "visible": true
 },
  {
    "id": "Interno-Je5",
    "title": "Queries de informacion gestion tipologias  ",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 24/07/2025",
    "endDate": "25/07/2025",
    "observations": "[25/07/2025]:Se generaron los queries solicitados para cinco datos claves y están listos para ser revisados en conjunto con el equipo.\n[28/07/2025]:La información requerida fue generada en su totalidad el día viernes 25 de julio",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
 },
  {
    "id": "Interno-F2",
    "title": "Creacion manual medicamentos fase 2 sprint 2",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 24/07/2025",
    "endDate": " 25/07/2025",
    "observations": "[25/07/2025]: Se culminó la elaboración del manual de usuario, el cual será entregado junto con el requerimiento el día 28 de julio, se envía a Jenry y Liyibet para su validación",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
 } ,
    {
    "id": "Interno-D5",
    "title": "Trasferencia de imagenes pendientes del S3  al FS",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 25/07/2025",
    "endDate": " 25/07/2025",
    "observations": "[28/07/2025]:Se identificaron imágenes pendientes en S3 que no estaban en el FS; se realizó validación y transferencia para corregir la sincronización.",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
 },
    {
    "id": "Interno-JA8",
    "title": "Gestión de imágenes en módulo Cartera",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 25/07/2025",
    "endDate": " 25/07/2025",
    "observations": "[28/07/2025]:0e identificó que al mover archivos a la carpeta de fecha no se completaba el proceso; se implementó un script para validar y restaurar imágenes.",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
 },
    {
    "id": "Interno-JA9",
    "title": "Gestión de imagenes buzón ARL",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 28/07/2025",
    "endDate": "29/07/2025",
    "observations": "[28/07/2025]:El dia viernes 25 de julio  a Danilo le escalaron  un error donde casos radicados el 25 no cargaron imágenes ni se registraron en base de datos; se revisaron logs sin hallar causa, Jairo  iniciara validaciòn  para la implementaciòn del script implementado en las imagenes del modulo de cartera.\n[30/07/2025]: Las imágenes fueron adjuntadas manualmente por el cliente, por lo tanto, se da por cerrada la incidencia reportada.",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
 },
    {
    "id": "Interno-D6",
    "title": " Plan de trabajo IA – Radicación Express",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 0,
    "startDate": " 28/07/2025",
    "endDate": "28/07/2025",
    "observations": "[28/07/2025]: Pendiente reunión con Jairo y Liyibet para definir plan de trabajo, tema prioritario que requiere asignación clara de tareas y etapas.\n[30/07/2025: Plan ya redactado y revisado por Jenry y Jairo. Solo falta envío formal.",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
 },
    {
    "id": "MDSB-849170",
    "title": "Modalidades de trabajo – error en cargue",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/07/2025",
    "endDate": "29/07/2025",
    "observations": "[29/07/2025]:Después de realizar varias validaciones, se identificó que el error que impedía el cargue del archivo correspondía a que el sistema estaba considerando el campo _Teléfono_ como obligatorio. Como medida correctiva, se eliminó dicha obligatoriedad, y con ello el cargue del archivo ya puede realizarse correctamente.",
    "unit": "Varbo",
    "detail": "Usuaria indica que al momento de realizar el cargue masivo de trabajadores en el portal de arl le presenta un error cuando carga el documento de Excel ",
    "visible": true
 },
    {
    "id": "MDSB-844641",
    "title": "Jiras dia a dia (Eliminar funcionarios inactivos - Informe Efectividad)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 29/07/2025",
    "endDate": "29/07/2025",
    "observations": "[29/07/2025]: Se realizó la corrección en la consulta del informe, ya que anteriormente no discriminaba si el usuario se encontraba activo o desactivado.Para solucionar esto, se adicionó la condición que permite identificar a los usuarios desactivados, asegurando así la correcta generación del informe.",
    "unit": "Varbo",
    "detail": "De la manera más atenta agradezco su apoyo con la eliminación de los funcionarios relacionados a continuación en el informe de efectividad, estos usuarios ya fueron inactivados y se eliminaron del área, sin embargo sigue evidenciándose.",
    "visible": true
 },
    {
    "id": "MDSB-849734",
    "title": "Jiras dia a dia (Caso 38709479 sigue en la badeja del usuario despues de gestionado)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 29/07/2025",
    "endDate": "29/07/2025",
    "observations": "[29/07/2025]: Se realizó la validación correspondiente y se identificó que el caso se visualizaba en la bandeja de pendientes debido a la existencia de actividades pendientes. Dado que la gestión del caso ya había finalizado, se procedió con el cierre de dichas actividades, permitiendo así que el caso fuera retirado de la bandeja",
    "unit": "Varbo",
    "detail": "Buen día, solicito su gentil colaboración ya que el caso 38709479 fue cerrado pero aún aparece en mi bandeja, agradezco la colaboración.",
    "visible": true
 },
    {
    "id": "MDSB-853919",
    "title": "Jiras dia a dia (Reaperturar caso 39308376)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 29/07/2025",
    "endDate": "29/07/2025",
    "observations": "[29/07/2025]:De acuerdo a  la  solicitud  se abre actividad Gestiona Caso para el  caso 39308376",
    "unit": "Varbo",
    "detail": "**Reporte** \r\n\r\n**“Reaperturar caso 39308376,“ **\r\n\r\nRequiero la reapertura del siguiente caso 39308376, he intentado reabrirlo desde administrativo, el caso me aparece que no se encuentra cerrado, pero tampoco me permite retomarlo o corregirle la tipología. y requiero reabrirlo para la emisión de un concepto \r\n\r\n**Procedimientos**\r\n\r\nese caso, esta en imagine tenia una tipología, pero el caso se cerra, se hizo una primera emisión de una carta, pero ellos necesitan que el caso este abierto para realizar la validación, indica que han pasado varios días pero sigue igual, Leydi mayorca le indico que debía poner un caso en jira ella puede realizar el proceso con otros coso pero con este en especifico no han logrado hacer el proceso\r\nUsuaria indica que en este momento no tiene disponibilidad de tiempo para lograr tomar un paso a paso en video \r\nSe escala caso para su gestión y validación",
    "visible": true
 },
    {
    "id": "INTERNO-JE6",
    "title": "Creación de Script para Anulación de Casos Asociados a un Cargue Masivo",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress":100,
    "startDate": "30/07/2025",
    "endDate": "01/08/2025",
    "observations": "[30/07/2025]: Se tiene previsto iniciar el desarrollo el día de hoy, Jenry indica que se deben elinimar los casos de la bd  y no dejarlos  ocupando espacio. \n[04/08/2025]: El viernes 1 de agosto se finalizó el query que elimina correctamente el caso y su imagen para los casos nuevos de masivos. Actualmente, se está construyendo el script que permitirá realizar un borrado controlado de las imágenes asociadas a casos antiguos en estado 'Anulado'.\n[06/08/2025]: Se desarrolló comando para eliminar 300.000 casos anulados uno a uno. El proceso está en ejecución y ha eliminado más de 100.000 registros en el ambiente productivo.\n[11/08/2025]: Anulacion de casos completa en produccion, se iniciara  paso a  produccion de la  funcionalidad.\n[12/08/2025]:Se realiza el paso a producción y se ejecutan pruebas, las cuales arrojan resultados exitosos.",
    "unit": "Varbo",
    "detail": "**Requerimiento: Creación de Script para Anulación de Casos Asociados a un Cargue Masivo**\n\n**Descripción:**\nSe requiere desarrollar un script que permita anular automáticamente todos los casos individuales creados a partir de un proceso de cargue masivo, en los escenarios en que dicho cargue masivo sea anulado por el usuario o administrador.\n\n**Objetivo:**\nAsegurar la consistencia de la información en el sistema, evitando que queden activos casos individuales que derivan de un masivo previamente anulado.\n\n**Alcance del Script:**\n\nIdentificar los casos generados por un identificador de cargue masivo.\n\nValidar el estado del cargue masivo (anulado).\n\nAnular todos los casos vinculados, actualizando su estado a \"Anulado\" o equivalente.\n\nRegistrar la trazabilidad de la acción (usuario, fecha, motivo).\n\n**Observaciones:**\nEste proceso debe ejecutarse de manera automática al anular un masivo, o como función adicional accesible desde la interfaz administrativa.",
    "visible": true
 },
    {
    "id": "INTERNO-D7",
    "title": "Caso radicado desde el portal sin registros (archivo faltante reportado por Leidy)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress":100,
    "startDate": "29/07/2025",
    "endDate": " ",
    "observations": "[30/07/2025]:El análisis quedó pendiente para continuar hoy, validando si los archivos fueron cargados y asociarlos manualmente si corresponde. ",
    "unit": "Varbo",
    "detail": "Se identificó un caso radicado desde el portal sin registros asociados,se presume que pudo haberse presentado una falla durante el guardado de archivos por problemas de horario",
    "visible": true
 },
    {
    "id": "MDSB-853188",
    "title": "Jiras dia a dia ( Se Cambian los archivos adjuntos al caso 39349883 y 39345375)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress":100,
    "startDate": "29/07/2025",
    "endDate": "30/07/2025",
    "observations": "[30/07/2025]: se evidenció que, durante el cargue de anexos, el sistema recibió de manera simultánea dos archivos asociados a casos diferentes, lo que provocó un conflicto de escritura en la carpeta correspondiente al día. En la opción que permite adjuntar documentos en el momento de radicar el caso. Como medida correctiva, se implementó un ajuste en el sistema para que, en adelante, los documentos se guarden uno por uno y en el orden exacto en que se reciben, evitando así cualquier sobrescritura o cruce de archivos entre casos.",
    "unit": "Varbo",
    "detail": "Me ha pasado en varias ocasiones, que cuando imagine molesta o se cae, algunos archivos cargados muestran un adjunto que no le corresponde, es raro, porque se cambia por documentos que ni siquiera tengo en mi computador, voy a poner dos ejemplos de casos que pasaron esta semana que son los que tengo presente, estoy segura que ese adjunto que muestra no está en mi pc.\n\n39349883\n\n39345375",
    "visible": true
 },
    {
    "id": "INTERNO-D8",
    "title": "Repositorio y comunicación por host virtual (Actualizaciòn nativo)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress":100,
    "startDate": "29/07/2025",
    "endDate": "06/08/2025",
    "observations": "[30/07/2025]: Se tiene un avance del 80% en la configuración del repositorio de despliegue y del esquema de publicación mediante host virtual. Faltan ajustes finales de redirección y certificados para habilitar la publicación formal.\n[01/08/2025]: Ayer 31 de julio se dejó funcionando una nueva aplicación en un contenedor Docker con una versión de PHP distinta a la del servidor principal. Este entorno está destinado a pruebas del nuevo desarrollo liderado por Jesús. Se presentaron errores de conexión por falta del archivo .env, que deben solucionarse antes de avanzar.\n[06/08/2025]: Se identificó pérdida de permisos al reconstruir el contenedor. Se analizó la causa y se tiene claridad en la solución. Se continuará con su ajuste en el transcurso del día, Al finalizar el día confirma finalización del ambiente y funcional.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
 },
    {
    "id": "INTERNO-D9",
    "title": "Modelo híbrido De almacenamiento de archivos (FS + S3)",
    "assigned": "DANILO",
    "state": "Pausado",
    "progress": 20,
    "startDate": "29/07/2025",
    "endDate": " ",
    "observations": "[30/07/2025]:  Se está explorando un modelo híbrido de almacenamiento entre FS y S3. FS almacenaría temporalmente, S3 como histórico (>30 días). \n[01/08/2025]: El tema aún no ha sido abordado ni discutido con Varbo. Se está a la espera de su decisión respecto a la implementación de días hábiles y detalles del modelo.\n[04/08/2025]: Se dejó en pausa para atender el requerimiento del informe de reembolsos.",
    "unit": "Varbo",
    "detail": "**Modelo híbrido de almacenamiento (FS + S3)**\nEl modelo híbrido propuesto combina el uso del File System (FS) local y el almacenamiento en Amazon S3, con el objetivo de optimizar el rendimiento, la escalabilidad y la disponibilidad de los documentos procesados por la aplicación.\n\n**Funcionamiento general:**\nFS como almacenamiento temporal:\nLos documentos se almacenan inicialmente en el sistema de archivos local (FS) durante las primeras etapas del proceso, facilitando el acceso rápido para lectura y escritura por parte del backend.\n\n**S3 como repositorio histórico:**\nUna vez el documento supera las etapas críticas de procesamiento (por ejemplo: validación, firma, consolidación), se migra automáticamente a un bucket de S3, donde se conserva como parte del histórico documental.",
    "visible": true
 },
    {
    "id": "GD772-123",
    "title": "Asignación y Gestión de Tareas en la Solución de Cuentas Médicas",
    "assigned": "JAIRO",
    "state": "En Proceso",
    "progress": 50,
    "startDate": "12/08/2025 ",
    "endDate": " ",
    "observations": "[13/08/2025]: Se inició el 12 de agosto con la adaptación de la bandeja a un formato más interactivo según los requerimientos solicitados. La prioridad está en entregar la funcionalidad de asignación antes que otros entregables. Se continúa con ajustes a consultas y pruebas.\n[20/08/2025]:Se trabajó en la bandeja, realizando ajustes visuales y validaciones con Henry. Falta incluir los registros antiguos y revisar a fondo la parte de asignación, por lo que el avance se estima en un 50%.",
    "unit": "Varbo",
    "detail": "**Requisitos de Asignación y Gestión de Tareas en la Solución de Cuentas Médicas**\r\nEste documento detalla los requisitos específicos para la funcionalidad de asignación y gestión de tareas dentro de la solución de cuentas médicas, El objetivo es asegurar una distribución eficiente, equitativa y trazable de las solicitudes de cuentas médicas, optimizando los tiempos de respuesta y la operatividad.\r\n**1. Configuración de ANS y Priorización de Solicitudes**\r\nLa solución debe permitir:\r\n**● Parametrizar el Acuerdo de Nivel de Servicio (ANS)** para cada tipo de solicitud de cuentas médicas (ej. Pronto Pago, Glosa), asegurando que el sistema priorice las tareas según estos parámetros.\r\n**● Priorizar la asignación en bandeja por fecha de radicado**, mostrando desde el más antiguo al más reciente en la primera vista y manteniendo los pendientes ordenados de lo más antiguo a lo más nuevo. Esta priorización debe ser rápida y eficiente, sin demoras en la búsqueda u ordenamiento, reflejando la fecha de radicado de Sisalud.\r\n**● Priorizar las solicitudes próximas a vencer** según el ANS parametrizado, considerando la fecha de radicación.\r\n**2. Asignación de Tareas por Radicado**\r\nLa solución debe asegurar que la asignación de tareas se realice de la siguiente manera:\r\n**● Generar la asignación por número de radicado**, no por factura individual.\r\n**● Asignar sin fraccionar las facturas**: Todos los radicados asociados a una misma factura deben ser asignados a una única persona, garantizando la continuidad en la gestión.\r\n**● Parametrizar el tiempo de cada actividad** para incorporarlo en el plan de trabajo y en la asignación.\r\n**● Respuestas a glosa**: Deben asignarse automáticamente al usuario que generó la glosa (o al área correspondiente, como auditoría médica). Si el usuario está inhabilitado (ej. por vacaciones), el sistema debe reasignar a otra persona del mismo perfil, considerando la carga de trabajo pendiente.\r\n**3. Filtrado y Visualización de Bandejas**\r\nLa plataforma debe contar con las siguientes capacidades de filtrado y visualización:\r\n**● Crear un filtro de cantidad** que muestre el número de facturas con respuesta a glosa, escalados, pronto pago y los pendientes de cuentas médicas.\r\n**● Permitir filtrar la bandeja por la condición deseada** (ej. fecha de radicación, del más antiguo al más reciente), manteniendo el filtro activo hasta que el usuario desee desactivarlo.\r\n**● Habilitar filtros por rango de fechas** en todas las pantallas.\r\n**4. Reasignación Flexible y Equitativa**\r\nLas bandejas de trabajo deben permitir la reasignación con las siguientes características:\r\n**● Reasignar sin perder la equidad** en la distribución de la carga de trabajo.\r\n**● Reasignar de forma individual o masiva por**: perfil, usuario, proveedor, complejidad, ramo, tipo de servicio, valor, fechas de radicación y pronto pago.\r\n**● Reasignar por distribución de cargas o no**, sin existir bloqueante para el administrador.\r\n**● Permitir asignar a una persona específica o distribuir equitativamente** entre usuarios correspondientes al mismo perfil.\r\n**● Los casos reasignados deben visualizarse en la bandeja respetando la antigüedad y ** original del registro.\r\n**5. Depuración y Actualización de Bandejas (Imagine)**\r\nSe requiere que la solución realice una depuración automática de las bandejas de Imagine de la siguiente manera:\r\n**● Realizar depuración de las bandejas de Imagine solo dejando las facturas en periodo vigente.**\r\n**● Si la factura fue pagada según reporte de Sisalud en un 90%**, dejarla en estado inactivo. En caso de que llegue una conciliación, reactivar y reasignar.\r\n**● Si la factura está en estado pagado en Sisalud totalmente**, dejarla en estado pagado.\r\n**● Si la factura está en estado glosado en Sisalud**, dejarla en estado glosado.\r\n**Si la factura está en estado pagado glosado**, dejarla en estado glosado.\r\n**● Si el radicado se encuentra en estado anulado en Sisalud**, realizar el cruce con Sisalud para conocer el número de radicado con el que se pagó.\r\n**● Todas las facturas deben continuar con los perfiles actuales** del administrador (como reasignar facturas, cambios de ramo según usuario), sin que exista ningún bloqueante.\r\n**● Permitir habilitar y deshabilitar los ramos para cada usuario**, incluyendo la opción de tener acceso a dos ramos si es necesario, bajo gestión del administrador.\r\n**● Permitir la habilitación del capacity por usuario y por perfil**: el administrador podrá parametrizar cuántos casos puede gestionar el usuario por día. Si se supera el capacity definido, se deberá generar una alerta.\r\n**● Los perfiles deben estar atados al ramo a trabajar**. El administrador debe poder asignar o reasignar facturas según necesidad. En el momento en que se cambie de ramo, no puede continuar habilitado para que se le asignen facturas que no corresponden a este. A partir de la asignación del ramo por parte del administrador, Imagine no debe asignar un ramo diferente al perfil.\r\n**6. Equidad en la Asignación y Control de Reglas\r\nLa asignación debe garantizar:**\r\n**● Equidad**: Es decir, igual o similar número de radicados para cada analista, teniendo en cuenta el tipo de servicio y la complejidad en la asignación sin perder las reglas de negocio establecidas. El contador debe considerar el acumulado para lograr radicados similares.\r\n**● Validación de Reglas del Motor**: Se deben validar nuevamente las reglas del motor para baja, media y alta complejidad según monto y tipo de servicio. Se revisará la tabla de reglas del motor que trabaja Imagine.\r\n**7. Tableros de Control y Reportería Detallada**\r\nLa solución debe ofrecer las siguientes herramientas de monitoreo:\r\n**● Tableros de control y gestión con base en reportes de Sisalud.** Se buscaría acceso a Sisalud Salud.\r\n**● Permitir que el administrador pueda actualizar los radicados** sin necesidad de solicitar apertura a la factura y que quede la traza de los dos radicados, definiendo una regla para decidir de forma automática con cuál se pagó.\r\n**● Reportes para administrador y analistas** del número de casos realizados, en tiempo real, acumulado, día, mes, año. Se basarán en el cruce de Imagine y Sisalud para lo gestionado y lo escalado. Deben indicar cuántos casos le faltan para cumplir la meta.\r\n**● Para cartera, que se pueda visualizar una marca y filtrar** por la misma de facturas ya conciliadas y/o con paz y salvo.\r\n**● Debe existir un tablero o un informe** que indique cuántos radicados está gestionando cada usuario por día, que muestre los tiempos de gestión para cada\r\nradicado, poder validar los pendientes al momento de la consulta y una gráfica de la gestión realizada día a día.\r\nDe forma atenta me permito enviar solicitud de creación de carpetas para cada uno de los auditores con el fin de que las distribuciones de las facturas sean equitativas para los que tienen perfil de enfermería y a los médicos les sean asignadas las cuentas iguales o mayores a $50.000.000.\r\nCon respecto a la respuesta a glosa, lo ideal es que le sea asignada a la persona que revisó. En sus inicios debería ser asignada a mi bandeja ya que el usuario que está revisando las facturas es el mío y posterior cuando empiecen a llegar las respuestas de las vistas por cada uno de los usuarios, a ellos mismos.\r\n**A continuación, relaciono los perfiles con la parametrización requerida.**\r\nCARGOCCNOMBREPerfilProfesional en enfermería55069610Claudia Lorena Montealegre GarciaAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería53108492Sandra Patricia Aranzales OchoaAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería1010204648Diego Ferney Castellanos FlórezAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería39813915Maria Marcela Bermudez TautivaAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería93.237.264Edwin Giovanni Ayala PavaAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en enfermería53048074Leidy Tatiana Figueroa MorenoAuditor de cuentas hasta $49.999.999 de forma aleatoria indiferente del proveedorProfesional en medicina1020792806Brandon Arevalo BernalAuditor de cuentas iguales o > $50.00.000 de forma aleatoria indiferente del proveedorProfesional en medicina36068234Astrid Lliana Muñoz AñazcoAuditor de cuentas iguales o > $50.00.000 de forma aleatoria indiferente del proveedorProfesional en medicina39789340Sandra Zoraya Munevar AvilaAuditor de cuentas iguales o > $50.00.000 de forma aleatoria indiferente del proveedor",
    "visible": true
 },
    {
    "id": "MDSB-856002",
    "title": "jiras dia a dia (Generar listado de usuarios de cada aplicativo)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "30/07/2025",
    "endDate": " ",
    "observations": "[31/07/2025]: Se genera informaciòn solicitada.",
    "unit": "Varbo",
    "detail": "**Solicitud de Generación de Información**\nSe solicita por favor el listado de usuarios de cada aplicativo con la siguiente información:\n\n**Numero de documento**\n\n**Nombre completo**\n\n**Correo electronico** \n\n*Negocio** (ARL/ Cuentas/Salud)\n\n**Área**\n\n**Estado** (activo /Inactivo)\n\n**Imagine** (Nativo //YII / Laravel)",
    "visible": true
 },
    {
    "id": "GD772-122",
    "title": "Habilitar la extensiónes xls, xlsx, xlsm, xltx, xltm y xlt  para la tipología tengo dudas reembolsos, internacional y nacional",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/08/2025",
    "endDate": "05/08/2025",
    "observations": "[05/08/2025]: Se habilitan las extensiones .xls y .xlsx en la tipología 'Tengo dudas - Reembolsos', en ambiente de producción ",
    "unit": "Varbo",
    "detail": "Se requiere habilitar la extensión excel para la tipología tengo dudas reembolsos, internacional y nacional.\nHabilitar el cargue de archivos xls, xlsx, xlsm, xltx, xltm y xlt",
    "visible": true
 },
    {
    "id": "GD772-124",
    "title": "Creación de Tipologías en portal cuentas médicas",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": " ",
    "unit": "Varbo",
    "detail": "**CREACIÓN DE TIPOLOGÍAS PORTAL CUENTAS MÉDICAS**\r\n\r\n\r\nSe requiere agregar a la lista de tipologías del portal de proveedores que se encuentra actualmente en producción, dos tipologías \r\n\r\n**Portal de proveedores: **\r\n\r\nhttps://imaginex-autorizacion.segurosbolivar.com/index.php/ProveedoresBolivar/Radicacion\r\n\r\n\r\nSe requiere que cuando se de clic en el portal de proveedores al escoger la lista de tipologías  se agregue una denominada “ Actualice sus datos”\r\n\r\n\r\n\r\nAl seleccionar la opción actualice sus datos en el segundo paso se deben ver los siguientes campos:\r\n\r\n**2.1 INFORMACIÓN PERSONAL:**\r\n\r\n2.1.1 Nombre Comercial ( Sólo caracteres alfanuméricos)\r\n2.1.2 Dirección ( Campo alfanuméricos) En este campo debe existir un hablador que indique lo siguiente “ Incluya barrio, carrera, calle, número o cualquier otra información relevante para la ubicación “\r\n\r\n**2.2 TELÉFONOS DE CONTACTO**\r\n\r\n2.2.1 Teléfono personal ( Campo numéricos)\r\n2.2.2 Celular personal (Campo numéricos)\r\n2.2.3 Teléfono consultorio ( Esta opción debe permitir agregar mas teléfonos ) ( Campo numéricos)\r\n**2.3 CANALES DIGITALES **\r\n\r\n2.3.1 Lineas de whatsapp ( este campo debe permitir agregar más datos) ( Campo numérico)\r\n\r\n2.3.2 Correo electrónico personal\r\n2.3.3 Correo de agendamiento\r\n2.3.4 Link de agendamiento\r\n2.3.5 Comentarios adicionales \r\n\r\nal dar clic en siguiente debe habilitar el campo de adjuntos, para esta tipología se requiere que el adjunto sea opcional no lleva nombre puede denominarse otros adjuntos.\r\n\r\n\r\n**LINK DE DIRECCIONAMIENTO**: Se requiere que imagine entregue el link donde direcciona el aplicativo exactamente al segundo paso, es decir no debe pasar por la selección de la solicitud y el diligenciamiento del captcha.\r\n\r\n\r\n\r\n**FLUJO EN IMAGINE**:\r\n\r\nUna vez los proveedores realicen gestión de radicación a través del portal , el sistema realizará la apertura de un caso en Imagine Nativo uno por cada tipología. \r\n\r\nel cual debe seguir el flujo de respuesta a través del correo de cuentas médicas.\r\n",
    "visible": true
 },
 {
    "id": "CNTI-96-1",
    "title": "Validar rechazo Vulnerabilidad CNTI-96  en cuanto a unsafe-inline y unsafe-eval",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress":100,
    "startDate": "01/08/2025",
    "endDate": " 11/08/2025",
    "observations": "[01/08/2025]: El 31 de julio se recibió un rechazo a la respuesta de la  vulnerabilidad CNTI-96 mitigada anteriormente. Se acordó revisar el caso nuevamente y gestionar la situación con las personas encargadas del tema de seguridad (SSP) para obtener validación.\n[04/08/2025]: El día viernes se respondió indicando que es necesario validar con la persona encargada de infraestructura, ya que no contamos con el JIRA de aprobación solicitado.\n[11/08/2025]: Se revisará nuevamente con el cliente debido a inconformidad con la respuesta inicial, justificando técnicamente las medidas tomadas.\n[20/08/2025]: El 11 de agosto el requerimiento quedó resuelto. Se implementaron componentes de seguridad adicionales y el área de seguridad validó la solución.",
    "unit": "Varbo",
    "detail": "Equipo Imagine del área de Seguridad  no nos aceptan el tema de unsafe-inline y unsafe-eval por favor nos pueden indicar las aprobaciones de Seguridad que nos indican en el siguiente mensaje en qué momento se dieron si tienen la evidencia... pues nos indican que se debe continuar con la solución de fondo.",
    "visible": true
},
 {
    "id": "INTERNO-D10",
    "title": "Implementacion de almacenamiento temporal de imágenes",
    "assigned": "DANILO",
    "state": "En Test",
    "progress":85,
    "startDate": "01/08/2025",
    "endDate": "12/08/2025 ",
    "observations": "[04/08/2025]: El viernes 1 de agosto se trabajó parcialmente en la radicación ARL y autorizaciones, pero fue interrumpido por otras tareas.\n[11/08/2025]: Tarea pendiente de ejecución; se espera completarla en la jornada actual.\n[12/08/2025]: Se realiza implementación en ambiente de pruebas.",
    "unit": "Varbo",
    "detail": "Se detectó pérdida de imágenes al realizar cambios de infraestructura. Se propuso implementar un almacenamiento temporal de imágenes (buffer de contingencia por al menos 5 días) para evitar pérdida de información crítica en futuras contingencias.",
    "visible": true
},
 {
    "id": "MDSB-855985",
    "title": "Jiras día a día (Corrección de casos radicados del buzón ARL sin trazabilidad)",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress":100,
    "startDate": "31/07/2025 ",
    "endDate": "01/08/2025 ",
    "observations": "[01/08/2025]: Se identificaron 78 casos (de un total de 306 observados) que quedaron en estado incompleto debido a una falla en la trazabilidad del sistema. Se desarrolló un script para completar la asignación de tipología y restablecer su curso normal.",
    "unit": "Varbo",
    "detail": "A continuación se rpoortan dos inconsistencias encontradas en los casos del buzón ARL:\n\nSe identifica en el informe “Casos con una sola actividad 20250730” que llega al correo 86 casos del buzón ARL con una sola actividad con fechas desde el 20/06/2025, sin emabrgo al validar las bandejas de los funcionarios no registran casos de esa fecha (se anexa word con imagenes de la bandeja tomadas a las 1:50 pm de hoy); sin emabargo los casos continuan en estado pendiente ejemplo caso 39325562; al validar el caso no esta en la bandeja de ninguno de los funcionarios: por lo cual los casos de terminos se encuentran en estado vencido. Registran 66 casos del informe que no se encentran asignados.\n\nSe observa que algunos casos no estan guardando la trazabilidad de las asignaciones, ejemplo el caso 39327668 no indica quien lo asigno desde el buzón de ARL, ni indica el cambio de la tipologia, sin emabrgo otros casos del mismo tipo si muestra la información ejemplo 39400309.",
    "visible": true
},
 {
    "id": "GD772-126",
    "title": " Bloquear la radicación de facturas por primera vez Colsubsidio",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "04/08/2025",
    "endDate": "04/08/2025",
    "observations": "[04/08/2025]:Se realiza el bloqueo del NIT 860007336 (Colsubsidio) y se despliega en los ambientes de prueba (test) y producción.",
    "unit": "Varbo",
    "detail": "Se solicita bloquear la radicación de facturas por primera vez al NIT 860007336, Colsubsidio, lo anterior por cierre de EPS.",
    "visible": true
},
 {
    "id": "GD772-127",
    "title": "Bloqueos radicación prestadores,paz y salvo",
    "assigned": "JAIRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/08/2025",
    "endDate": "06/08/2025",
    "observations": "[05/08/2025]: Se esacla control de  cambios para ambiente de pruebas MDSB-859020. Control de cambios ejecutado con exito.\n[06/08/2025]: Desarrollo se encuentra en ambiente de test para pruebas y aprobación del cliente. \n[08/08/2025]: Se escala control de cambios MDSB-861215 para producción.\n[11/08/2025]: Control de cambios en proceso de Aprobación QA / PO / Jefatura. \n[13/08/2025]:Control de cambios aprobado por comité y se ejecutara el 13 de agosto a las 4 pm.\n[19/08/2025]:El 13 de agosto se ejecuta con éxito el control de cambios en producción.\n[20/08/2025]: El requerimiento fue migrado a producción el 14 de agosto y se encuentra estable en operación.",
    "unit": "Varbo",
    "detail": "Por cierre de  Varbo se requiere que se bloquee la radicación de primera vez y respuesta a glosa para este ramo EPS de los prestadores relacionados en adjunto, con dichos prestadores se cuenta con paz y salvo por todo concepto.",
    "visible": true
},
 {
    "id": "INTERNO-JA10",
    "title": "Mejoras Informe consolidado ARL",
    "assigned": "JAIRO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "11/08/2025",
    "endDate": " ",
    "observations": "[11/08/2025]: Estima iniciar con las mejoras. \n[13/08/2025]: Se pausa  para continuar con req GD772-123 Bloqueo de facturas. \n[20/08/2025]: No se ha iniciado el desarrollo, aunque se identificó que el informe actual presenta tiempos de descarga altos (13–21 minutos). Se mantiene pendiente por priorización.",
    "unit": "Varbo",
    "detail": "Se solicita la validación del informe debido a demoras identificadas en su tiempo de ejecución",
    "visible": true
},
 {
    "id": "INTERNO-JA11",
    "title": "Mejoras Informe consolidado SALUD",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": " ",
    "observations": " ",
    "unit": "Varbo",
    "detail": "Se solicita la validación del informe debido a demoras identificadas en su tiempo de ejecución",
    "visible": false
},
 {
    "id": "INTERNO-D11",
    "title": "Ajuste en Radicación Express",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/08/2025",
    "endDate": "01/08/2025",
    "observations": "[04/08/2025]:  El viernes 1 de agosto se detectaron causísticas no contempladas; se ajustó el modelo para mejorar la detección. Se validó el modelo, se reentrenó y se probaron registros.",
    "unit": "Varbo",
    "detail": "Se solicita la validación del informe debido a demoras identificadas en su tiempo de ejecución",
    "visible": true
},
 {
    "id": "INTERNO-D12",
    "title": "Automatización informe de reembolsos Salud",
    "assigned": "DANILO",
    "state": "Pendiente",
    "progress": 50,
    "startDate": "01/08/2025",
    "endDate": " ",
    "observations": "[04/08/2025]: El viernes 1 de agosto se construyó un script para envío diario de análisis a correos configurables. Aún requiere depuración.\n[11/08/2025]: Pendiente de mejora: generar el informe en PDF con información organizada y gráficos, reemplazando el archivo plano actual, Se retomara tan pronto finalice la Implementación de almacenamiento temporal de imágenes.",
    "unit": "Varbo",
    "detail": "Se requiere que el informe de reembolsos, que actualmente se genera, sea enviado diariamente con el respectivo análisis incluido",
    "visible": true
},
 {
    "id": "CNTI-488",
    "title": " Big Redirect Detected (Potential Sensitive Information Leak)",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "01/08/2025",
    "endDate": "05/08/2024",
    "observations": "[04/08/2025]: Se recibió información técnica sobre las vulnerabilidades (Redirect). No se han validado completamente pendiente de análisis. \n[06/08/2025]: Se resolvió la vulnerabilidad reportada en el manejo del error 302. La solución fue implementada el 05 de agosto y ya está en producción. Se enviaron las evidencias correspondientes.",
    "unit": "Varbo",
    "detail": "**Tipo:** Web\n**CVE/CWE:** 201\n**Protocolo:** TCP\n**Puerto:** 443\n**Sinopsis:** El servidor ha respondido con una redirección que parece proporcionar una respuesta de gran tamaño. Esto puede indicar que, aunque el servidor envió una redirección, también respondió con contenido en el cuerpo del mensaje (lo cual puede incluir detalles sensibles, información personal identificable –PII–, etc.).",
    "visible": true
},
 {
    "id": "INTERNO-JA12",
    "title": "Restringir la creación de usuarios en yii con igual correo",
    "assigned": "JAIRO",
    "state": "Paso a Producción",
    "progress": 95,
    "startDate": "08/08/2025",
    "endDate": "08/08/2025",
    "observations": "[06/08/2025]: Se definió implementar validación en Yii para prevenir creación de nuevos usuarios con correos existentes. Afectará solo nuevos registros.\n[11/08/2025]: El viernes 8 de agosto se implementó en el ambiente de pruebas (test) la restricción para la creación de usuarios con el mismo correo en YII. Se confirma paso a produccion.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
},
 {
    "id": "INTERNO-JA13",
    "title": "Validar recuperacipon de contraseña para el  usuario 101010",
    "assigned": "JAIRO",
    "state": "Pausado",
    "progress": 60,
    "startDate": "06/08/2025",
    "endDate": "",
    "observations": "\n[08/08/2025]: El 6 de agosto se realizó la validación y se identificó que, en el ambiente de pruebas (test), al momento de efectuar la recuperación de contraseña, el sistema redirige directamente al login. Este comportamiento será revisado en conjunto con Danilo.\n[11/08/2025]: La redirreciòn ya no se presenta, Funcionalidad operativa en otros entornos, pero sin retroalimentación visual en TEST. Pendiente revisión para evitar que el error pase a producción.",
    "unit": "Varbo",
    "detail": "",
    "visible": true
},
 {
    "id": "MDSB-856527",
    "title": "Jiras dia a dia (Error en cargue de adjuntos nativo)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/08/2025",
    "endDate": "05/08/2025",
    "observations": "[05/08/2025]:  La incidencia se originó debido a que el aplicativo reemplazaba los adjuntos al momento de su cargue, por coincidencias en los nombres de archivo. Como medida correctiva, se implementó la adición de un identificador único en el nombre de cada adjunto, lo que evita la sobrescritura y asegura que cada documento se almacene de forma independiente.",
    "unit": "Varbo",
    "detail": "**Descripcion**\nAl realizar el cargue de anexos al caso 39403117 por parte del usuarioCLAUDIA MARCELA VALDES a las 2025-07-30 15:38:16, se identifica que en el caso queda anexo un documento que NO se estaba cargando, ni se encuentra en mi equipo  al momento del cargue (es un documento totalmente ageno a la operación) este queda cargado bajo la imagen 03; sin embargo en ningún momento se realizo el cargue de esta información.\n\nSe realiza la validación del documento y se observa que corresponde al caso 39378390 el cual fue cargado por el usuario YAMILYS PAOLA URIBE a las 2025-07-30 15:38:21 , lo unico que coincide es la hora del cargue; esta situación ya habia sido reportada anteriormente ",
    "visible": true
},
 {
    "id": "INTERNO-JE7",
    "title": "Optimización de reporte General  De pendientes en Nativo",
    "assigned": "JESUS",
    "state": "En Proceso",
    "progress": 0,
    "startDate": "11/08/2025",
    "endDate": " ",
    "observations": "[06/08/2025]: Se identificó problema de rendimiento en el código. Se solicitará apoyo a Jairo para reutilizar funciones existentes y optimizar el informe.\n[08/08/2025]: La optimización se realizara en la nueva versión de nativo  tras realizar la Actualización nativo a PHP 8.\n[11/08/2025]: Inicia optimización del informe.",
    "unit": "Varbo",
    "detail": " Se identificó problema de rendimiento en el código.",
    "visible": true
},
 {
    "id": "MDSB-860939",
    "title": "jiras dia a dia (Inactivación de 266 usuarios en Nativo)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/08/2025",
    "endDate": "08/08/2025",
    "observations": "[08/08/2025]: Se realiza la inhabilitación de los usuarios solicitados.",
    "unit": "Varbo",
    "detail": " **Reporte:**\n**Inactivación de usuarios**\n\nCordial saludo, \n\nSe solicita por favor la inactivación de los usuarios relacionados en el listado, 266 usuarios; por favor validar puesto que anteriormente se había solicitado la inactivación de 130 de estos bajo el Jira GD772-63.\n\nImportante tener en cuenta que el usuario debe quedar: Bloqueado, inactivo, inhabilitado como se muestra en la imagen; sin emabrgo si se requeire posteriormente desde el modulo administrador debe poderse habilitar.",
    "visible": true
},
 {
    "id": "INTERNO-JE8",
    "title": "Actuallizaciòn nativo a PHP 8",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/08/2025",
    "endDate": "08/08/2025",
    "observations": "[08/08/2025]: Se está realizando la instalación de la nueva aplicación en el entorno local \n[11/08/2025]: El viernes 8 de Agosto se configuró entorno local y Docker con nueva versión de PHP",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
},
 {
    "id": "MDSB-861385",
    "title": "Jiras día a día (Reemplaza adjunto cargado en la radicación)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "08/08/2025",
    "endDate": "11/08/2025",
    "observations": "[11/08/2025]: Se identificó que el problema se debía a que, al cargar un nuevo archivo, este quedaba con el mismo nombre del archivo utilizado en la radicación, lo que provocaba su reemplazo. Como medida correctiva, se implementó la adición de un identificador único al nombre de cada archivo al momento de su cargue, con el fin de evitar coincidencias y sobrescritas.",
    "unit": "Varbo",
    "detail": "Usuario se comunica indicando que está subiendo informes ya ctas, al generar el caso y tratar de adjuntar el acta este no carga y le duplica uno de lso archivos sea acta o informe (8 veces) ",
    "visible": true
},
 {
    "id": "INTERNO-JE9",
    "title": "Control y Validación de Correos ARL vs Casos Radicados en Imagine",
    "assigned": "JESUS",
    "state": "En Proceso",
    "progress": 90,
    "startDate": "13/08/2024",
    "endDate": "14/08/2025",
    "observations": "[12/08/2025]: Se asigna el requerimiento y se solicita proporcionar una estimación para su desarrollo.\n[14/08/2025]: Se implementa un reporte vía correo que informa la cantidad de correos ingresados al buzón, los que fueron radicados en YII, los excluidos y la diferencia con error. Esta diferencia con error corresponde a los correos cuyo estado debe ser validado.\n[15/08/2025]: El paso a producción permanece pendiente debido a que, al momento de realizar el despliegue, se presentan bloqueos en la URL, \n[20/08/2025]: Actualmente se trabaja en el ajuste del query de validación, dado que se identificó una interpretación errónea en la exclusión de correos.",
    "unit": "Varbo",
    "detail": "**Objetivo del requerimiento**\r\nImplementar un control para la validación de correos enviados a la cuenta arlbolivar@segurosbolivar.com, comparando los correos recibidos con los casos radicados en el sistema Imagine para identificar discrepancias.\r\n________________________________________\r\n**Componentes principales**\r\n**1.\tExtracción de correos recibidos**\r\no\tContar correos radicados en la cuenta arlbolivar@segurosbolivar.com.\r\no\tObtener Remitente, Asunto y Fecha recibido.\r\no\tEjemplo dado en Google Apps Script usando GmailApp.search() para un rango de fecha y hora.\r\n**2.\tConsulta en Imagine**\r\no\tComparar contra la información de casos radicados usando la vista:\r\nyii/radicacion correo/consulta.\r\n**3.\tFiltro de remitentes válidos**\r\no\tValidar solo correos de cuentas/dominios registrados en:\r\nyii/administrador lector correos/ pestaña correos y dominios.\r\n**4.\tGenerar reporte consolidado**\r\no\tNueva opción en la aplicación: Control diario.\r\no\tMostrar datos desde hoy hasta 1 mes atrás.\r\no\tCuadro comparativo:\r\nBuzón ARL\tRadicación Yii\tExcluidos\tDiferencia\tValidar\r\n**5.\tFuncionalidad de validación detallada**\r\no\tSi en la columna “Validar” aparece Sí:\r\n\tAl hacer clic, mostrar Asunto, Destinatario y Fecha del correo con discrepancia.\r\n________________________________________\r\n**Criterios clave de validación**\r\n•\tComparación se hace por remitente/dominio autorizado.\r\n•\tConsolidado debe ser de 30 días hacia atrás.\r\n•\tDiferencia = Buzón ARL − (Radicación Yii + Excluidos).\r\n•\tDetalle visible solo cuando **Diferencia > 0.**\r\n",
    "visible": true
},
 {
    "id": "INTERNO-D13",
    "title": "Pruebas de carga en entorno simulado de producción",
    "assigned": "DANILO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "12/08/2025",
    "endDate": "13/08/2025",
    "observations": "[12/08/2025]:Se prepararon scripts para mantener usuarios activos y simular apertura/cierre de sesiones, consultas y consumo de API. Se adaptó el API para las pruebas, incluyendo pre-firmado de URL con Apache. Se programó la ejecución de la prueba integral para la tarde, con consumo de 500 imágenes en un escenario que replica las condiciones del servidor de producción.\n[20/08/2025]: El miércoles 13 de agosto se ejecutaron y entregaron los reportes con resultados y evidencias. Hubo un inconveniente con pérdida de archivos temporales, pero se repitió el proceso y quedó cerrado.",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
},
 {
    "id": "INTERNO-JE10",
    "title": "Adicionar usuario a Informe de Casos con una sola actividad",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 14/08/2025",
    "endDate": "14/08/2025",
    "observations": "[14/08/2025]: Se adiciona el campo 'usuario' al reporte recibido por correo de casos con una sola actividad.",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
},
 {
    "id": "GD772-81_1",
    "title": "Adición de validaciones para el diligenciamiento de la información de envío físico de calificaciones en ambiente de pruebas (test)",
    "assigned": "JESUS",
    "state": "Finalizado",
    "progress": 100,
    "startDate": " 14/08/2025",
    "endDate": "15/08/2025",
    "observations": "15/08/2025:Se implementa validaciònes en test para que no permita continuar cuando los campos de envio fìsico esten vacios. ",
    "unit": "Varbo",
    "detail": "**Requerimiento:**\nSe requiere implementar una validación para el diligenciamiento de los datos correspondientes al envío físico dentro del proceso de calificaciones, ya que, según las pruebas realizadas por el cliente, un caso fue marcado como “Envío físico” pero nunca se realizó el envío. Al validar, se evidenció que la información no quedó registrada en la tabla correspondiente.",
    "visible": true
},
 {
    "id": "MDSB-855049",
    "title": "ERROR CONTEO DE DIAS BANDEJA DE PENDIENTES VRS INFORME DE EFECTIVIDAD",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": " ",
    "unit": "Varbo",
    "detail": "**ERROR CONTEO DE DIAS BANDEJA DE PENDIENTES VRS INFORME DE EFECTIVIDAD**\r\nConfirmamos que tenemos errores en cuanto a la información que les registra a los funcionarios en el conteo de dias en gestión y la información que descarga en el informe de pendientes, solicitamos por favor revisen este error para poder tner información coherente en los dos escenarios, por ejemplo:\r\n\r\nCaso 39337969 al funcionario le registra en 5 dias en su bandeja, mientras que en el reporte de casos pendientes para el 28/07/2025 registraban 4 dias (adjunto imagine de la sesión del funcionario y archivo de casos pendientes para la fecha.\r\n\r\nCaso 39338023 al funcionario le registra en 5 dias en su bandeja, mientras que en el reporte de casos pendientes para el 28/07/2025 registraban 4 dias (adjunto imagine de la sesión del funcionario y archivo de casos pendientes para la fecha.\r\n\r\nCaso 39338305 al funcionario le registra en 5 dias en su bandeja, mientras que en el reporte de casos pendientes para el 28/07/2025 registraban 4 dias (adjunto imagine de la sesión del funcionario y archivo de casos pendientes para la fecha.",
    "visible": false
},
 {
    "id": "MDSB-862496",
    "title": "Reportan falla al finalizar radicacion de incapacidad (No muestra numero de radicado)",
    "assigned": "JESUS",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": " ",
    "unit": "Varbo",
    "detail": "**Reporte**\r\n\r\nUsuaria indica que no le arroja radicado en el proceso de radicación de incapacidad ",
    "visible": false
},
 {
    "id": "MDSB-864436",
    "title": "Optimización  informe prefactura 472",
    "assigned": "JESUS",
    "state": "En Proceso",
    "progress":50,
    "startDate": "15/08/2025",
    "endDate": " ",
    "observations": "[19/08/2025]: Se está ajustando el informe de prefactura 472 debido a que se identificaron varios errores en la lógica. \n[20/08/2025]: Se continuará con la validación y se espera que la optimización culmine en el transcurso del día de hoy.",
    "unit": "Varbo",
    "detail": "Se estan presentando demoras en la generacion del  informe de prefactura 472 por tanto se requiere optimzar dicho informe ",
    "visible": true
},
 {
    "id": "GD772-129",
    "title": "Ajuste facturas duplicadas Salud",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": " ",
    "observations": " ",
    "unit": "Varbo",
    "detail": "**AJUSTE FACTURAS DUPLICADAS**\nSe solicita identificar las facturas duplicadas, marcar si se deben  reprocesar las facturas debido a este incidente reportado por Sisalud salud.\n\n“Se informa que, para las siguientes facturas de SALUD, al realizar el envío para la radicación automática, se presenta el siguiente error:\n\"Mensaje controlado por manejo de errores del CORE – Error: timeout of 20000ms exceeded.\"\nSin embargo, al revisar directamente en SISALUD, las facturas sí aparecen como radicadas. Este error ya había sido reportado al área de tecnología, pero indicaron que no se presentaba ninguna anomalía. Por tal motivo, adjunto las respectivas evidencias.\n\n\n\nRelaciono ejemplo de como podría enviar información desde imagine.\n\nEJEMPLO\n\n{\n\"facturasProveedor\": {\n\"sr\": \"1234567890\",\n\"fechaRadicacion\": \"13032022\",\n\"tipoCuenta\": 6,\n\"municipio\": \"001\",\n\"departamento\": \"11\",\n\"tipoBeneficiario\": 3,\n\"tipoIdentificacion\": \"NT\",\n\"identificacion\": \"830039670\",\n\"facturasRadica\": [\n{\n\"sr\": \"1234567890\",\n\"consecutivo\": 1,\n\"autorizacion\": \"LM123456\",\n\"fechaFactura\": \"13032022\",\n\"numeroDocumento\":\"FAC123\",\n\"valorFactura\": 12345,\n\"tipoRegimen\": \"S\",\n\"reprocesar\": \"S\"\n},\n{\n\"sr\": \"1234567890\",\n\"consecutivo\": 2,\n\"autorizacion\": \"LM234567\",\n\"fechaFactura\": \"13032022\",\n\"numeroDocumento\":\"FAC124\",\n\"valorFactura\": 234567,\n\"tipoRegimen\": \"S\"\n}\n]\n}\n\n\n\nejemplo en hoja datos de entrada.",
    "visible": false
},
 {
    "id": "INTERNO-F3",
    "title": "Crear cuenta en GitHub con correo corporativo",
    "assigned": "FABIO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/08/2025 ",
    "endDate": "19/08/2025",
    "observations": "[19/08/2025]: Se crea cuenta (PruebasImagine)",
    "unit": "Varbo",
    "detail": " ",
    "visible": true
},
 {
    "id": "INTERNO-JA14",
    "title": "Restricción para Glosas menores a $6.000",
    "assigned": "JAIRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": " ",
    "unit": "Varbo",
    "detail": " Se identificó que el sistema no permite glosar facturas cuyo valor neto es inferior a $6.000, incluso si la factura original supera ese monto. Se revisó el caso y se determinó que debe ajustarse la validación para permitir Glosas en esos escenarios.",
    "visible": false
},
 {
    "id": "INTERNO-D14",
    "title": "Acceso Ambiente de desarrollo",
    "assigned": "DANILO",
    "state": "En Proceso",
    "progress": 20,
    "startDate": "20/08/2025",
    "endDate": "",
    "observations": "[20/08/2025]: Se radica ticket  MDSB-867281  donde se informa que no es posible establecer conexión desde la instancia de desarrollo imaginex-1_dev ",
    "unit": "Varbo",
    "detail": " Se identificaron problemas de acceso a discos (EBS y S3), lo que ha limitado avances en varios frentes. Se radicará un ticket para resolver la falta de conectividad y habilitar pruebas en desarrollo.",
    "visible": true
},
 {
    "id": "INTERNO-D15",
    "title": "Actualización de versiones (PHP, Apache y librerías) en dev",
    "assigned": "DANILO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": " ",
    "endDate": "",
    "observations": " ",
    "unit": "Varbo",
    "detail": " Una vez habilitado el ambiente de dev, se realizará la actualización a la nueva versión de PHP, junto con las librerías asociadas (ej. PostgreSQL, Apache). Se resaltó la importancia de revisar compatibilidad y replicar las librerías en la nueva versión.",
    "visible": false
},
 {
    "id": "GD772-130",
    "title": " Modalidad Teletrabajo Transnacional",
    "assigned": "JESUS",
    "state": "Estimar",
    "progress": 0,
    "startDate": " ",
    "endDate": "",  
    "observations": " ",
    "unit": "Varbo",
    "detail": " ",
    "visible": false
}
 ]
