[
  {
    "id": "SCTASK0316185",
    "title": "Actualizacion informacion beneficiario final",
    "assigned": "Brayan Diaz",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "10/10/2025",
    "endDate": "15/10/2025",
    "observations": "Se entrega el requerimiento de acuerdo con la solicitud del cliente",
    "unit": "Colmena",
    "detail": "Se solicita que al momento de capturar la informacion del formato de beneficiario final, el formulario que este marcado como NO tome los nuevos campos",
    "visible": true
  },
  {
    "id": "SCTASK0315640",
    "title": "Ajustes informe Zehux",
    "assigned": "Brayan Diaz",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/10/2025",
    "endDate": "",
    "observations": "se entrega en produccion modificacion de informe de la manera solicitada",
    "unit": "Colmena",
    "detail": "El archivo originalmente enviado por Imagine incluye el historial completo de devoluciones, incluyendo aquellas dirigidas a áreas como Configuración, Sistemas, entre otros. Es necesario depurar este documento, dejando únicamente las observaciones de devolución que correspondan a la Sucursal en cada caso. \nReemplazar el campo de Sucursal por Regionales",
    "visible": true
  },
  {
    "id": "SCTASK0339311",
    "title": "Cargue masivo de afiliaciones de contratos no vinculados",
    "assigned": "Brayan Diaz",
    "state": "Pruebas Cliente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "Se requiere la creacion de un (chek) para cargue de afiliaciones contratos no vinculados que permita seleccionar varios contratos y de esta manera me genere los planos de los contratos seleccionaos en un solo LOG para garantizar un solo cargue que evite las demoras que actualmente se presentan al cargar estos contratos.",
    "visible": true
  },
  {
    "id": "SCTASK0339314",
    "title": "Actualizacion campos telefonos",
    "assigned": "Brayan Diaz",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "CAMPO TELEFONOS \nSe requiere que en los casos donde los campos de teléfono para contratos dependientes y no vinculados  vengan vacíos y/o relacionen  información inconsistente como números repetidos o caracteres especiales se tome por defecto el numero de la empresa para evitar errores de cargue al momento de vincular contratos en APOLO.",
    "visible": true
  },
  {
    "id": "SCTASK0340882",
    "title": "Envio masivo de correos",
    "assigned": "Brayan Diaz",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "Solicitamos su atención con  con el envío masivo de correos electrónicos - adjuntamos correo formal",
    "visible": true
  },
  {
    "id": "",
    "title": "",
    "assigned": "Faver Lopez",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "",
    "visible": false
  },
  {
    "id": "AUT0_2",
    "title": "Lectura, clasificación y extracción de información desde imágenes de incapacidades",
    "assigned": "Danilo Ramirez",
    "state": "En Proceso",
    "progress": 45,
    "startDate": "27/10/2025",
    "endDate": "",
    "observations": "[28/10/2025]: Se han realizado las primeras extracciones con muy poco entrenamiento y ajustando regex como filtro inicial.\n[31/10/2025]: Se continúa trabajando en la extracción automatizada de información de documentos. Se prevé la entrega parcial de resultados durante la jornada, con la funcionalidad lista para validar en ambiente local.\n[05/11/2025]: El modelo ya identifica correctamente cuándo un documento corresponde a una incapacidad y cuándo no.\nAdemás, devuelve la información clave de la incapacidad, incluyendo el número de la hoja en la que se encuentra dentro del documento.\nSe implementó también el nuevo campo “Prórroga”, el cual está siendo extraído correctamente por el modelo durante el proceso de análisis.\nActualmente, se planea realizar la implementación en el ambiente de test para validar el comportamiento integral del desarrollo.\n[24/11/2025]: Se recibió información inicial y hubo primera reunión. Aún no se ha analizado la documentación recibida; avance estimado en 5%. Pendiente estructurar el análisis y organizar los insumos.\nSe presentó fallo por conflicto con una librería y cambios no deseados en la IP pública. Se desinstaló la VPN afectada. Hoy se destinará tiempo para intentar reinstalar paquetes o aprovechar el ambiente test existente.\n[26/11/2025]: Pendiente retomar los ajustes solicitados por Colmena. Se dedicará parte del día a trabajar con Jenry para avanzar, ya que no se pudo atender este requerimiento en días anteriores por priorización de otros temas.",
    "unit": "Colmena",
    "detail": "Requerimiento:\nSe necesita que el sistema identifique, clasifique y extraiga automáticamente la información contenida en las imágenes de incapacidades médicas  radicadas, para agilizar la validación y registro de estos documentos dentro del flujo de gestión de incapacidades.\n\nEl proceso debe utilizar modelos de inteligencia artificial y procesamiento de imágenes (OCR) para reconocer los tipos de documento incluidos en los archivos PDF (por ejemplo: incapacidades, historias clínicas, cédulas, otros anexos) y tomar únicamente las páginas que correspondan a incapacidades médicas, almacenando la información validada y su respectiva hoja de origen.\n\nJustificación:\nActualmente, los documentos  contienen múltiples tipos de imágenes dentro de un mismo archivo, lo que dificulta la extracción manual de la información requerida para el análisis de incapacidades.\nEste requerimiento busca automatizar la clasificación y extracción de datos relevantes, mejorando la precisión del proceso, reduciendo tiempos de validación y evitando errores humanos en la identificación de archivos.",
    "visible": true
  },
  {
    "id": "AUT0_1",
    "title": "Digitación Data SBS",
    "assigned": "Jhon Bermudez",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "28/10/2025",
    "endDate": "31/10/2025",
    "observations": "[28/10/2025] Se valida método de consulta de manera manual y se descubre que a partir del consumo de una URL se puede hacer la consulta completa con los resultados que la plataforma retorna de manera visual\n[29/10/2025] Se ajusta script para filtrar y trasformar la información de tal manera que sea útil para utilizarla\n[30/10/2025] Ajuste del scritp para mejorar el la respuesta\n[31/10/2025] Se ejecutan la lista de NIT´s pendientes",
    "unit": "Colmena",
    "detail": "Requerimiento:\nSe requiere desarrollar un proceso que permita ingresar a la plataforma SBSeguros utilizando credenciales de autenticación válidas, con el propósito de consultar, validar y extraer información asociada a un documento específico.\n\nEl proceso deberá realizar las siguientes acciones:\n\n1.  Autenticación: Ingresar a la plataforma SBSeguros empleando las credenciales de inicio de sesión autorizadas para el proceso de consulta.\n2. Validación de información: Verificar si el documento consultado cuenta con información registrada en la plataforma.\n\n3. Extracción de datos:\n\n*Desde la sección “Información Básica” o “RUT”, obtener y almacenar el código CIIU correspondiente.\n*Desde la sección “Información Financiera”, recuperar el valor reportado en el campo “Ingresos Mensuales”.\n\n4.Resultado del proceso: Registrar y/o devolver los datos obtenidos para su uso en procesos posteriores de validación o integración.",
    "visible": true
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Colmena",
    "detail": "",
    "visible": false
  }
]