[
  {
    "id": "Interno-H1",
    "title": "Automatización y migración de lógica a Python (Migración de código en donde se importa el lote tanto física como en bases de datos)",
    "assigned": "ALEJANDRO",
    "state": "En Test",
    "progress": 95,
    "startDate": "17/06/2025",
    "endDate": "19/06/2025",
    "observations": "[19/06/2025] Se produjeron ciertos errores en la fase de pruebas y se realizaron todas las correcciones para que el nuevo funcionamiento responda y se acople bien",
    "unit": "Cionpro",
    "detail": ""
  },
  {
    "id": "REQ-1-1",
    "title": "Tratamiento especial al radicar trámites de vejez (Revision de flujo y código)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "19/06/2025",
    "observations": "[19/06/2025] Se identifico el código a intervenir y con el que trabajar en el requerimiento",
    "unit": "Cionpro",
    "detail": "Se está a la espera de la solicitud formal por parte del cliente"
  },
  {
    "id": "Interno-H2",
    "title": "Automatización y migración de lógica a Python(Migración de código en donde se trata toda la lógica y activación de tareas de la indexación del lote)",
    "assigned": "ALEJANDRO",
    "state": "En Test",
    "progress":95,
    "startDate": "20/06/2025",
    "endDate": "25/06/2025",
    "observations": "[20/06/2025]: Identificación y paso del flujo para la funcionalidad de indexación de lotes de PHP a python\n[24/06/2025]: Se tiene identificado el código necesario para la migración y se avanza en ella. Se han tenido muchos requerimientos adicionales actualmente por lo que se retrasa un poco en su construcción\n[25/06/2025]: Se termina la migracion a python para el flujo de la funcionalidad de indexar lote y se realizaron pruebas de funcionalidad",
    "unit": "Cionpro",
    "detail": ""
  },
  {
    "id": "Interno-H3",
    "title": "Automatización y migración de lógica a Python (Acoplar lógica faltante en la migración de código)",
    "assigned": "ALEJANDRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "26/06/2025",
    "observations": " ",
    "unit": "Cionpro",
    "detail": ""
  },
  {
    "id": "REQ-1-2",
    "title": "Tratamiento especial al radicar trámites de vejez (Reunión con las partes interesadas para identificar los inputs de trabajo)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "Actividad: Reunión con las partes interesadas para identificar los inputs de trabajo.",
    "unit": "Cionpro",
    "detail": " Se está a la espera de la solicitud formal por parte del cliente"
  },
  {
    "id": "REQ-1-3",
    "title": "Tratamiento especial al radicar trámites de vejez (Fase de desarrollo para la creacion de código para la implementación del requerimiento)",
    "assigned": "ALEJANDRO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "[24/06/2025]: El requerimiento esta en pausa hasta que se identifique la viabilidad de la reforma pensional",
    "unit": "Cionpro",
    "detail": " Se está a la espera de la solicitud formal por parte del cliente"
  },
  {
    "id": "REQ-2-1",
    "title": "Creación de reporte de AUF para identificación de pagos (Creación de script para crear reporte de pagos de auxilios funerarios y la vista para su consumo)",
    "assigned": "ALEJANDRO",
    "state": "Pruebas Cionpro",
    "progress": 90,
    "startDate": "1/07/2025",
    "endDate": "1/07/2025",
    "observations": "[24/06/2025]: Se realiza reunión para la identificación de nuevos requisitos \n[01/07/2025]: Se realiza vista para el consumo y parte de la lógica para la creación del reporte, Se está a la espera de validar la información del reporte debido a que se nos envía 2 reportes con estructuras distintas.\n[02/07/2025]: Se realiza paso test el 1 de julio. \n[11/07/2025]: Se realiza reunión con las partes interesadas y se acuerda en agregar información obtenida de distintas fuentes al formulario.",
    "unit": "Cionpro",
    "detail": " Creación de Herramientas adicionales para el tratamiento de información y flujo en el módulo de auxilios funerarios"
  },
  {
    "id": "REQ-3-1",
    "title": "Cambios técnicos en aplicativo imagine para proceso de mesa de control documental solicitud de pensión (Reunión con las partes interesadas para identificación de requerimientos)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "[24/06/2025]: Se realiza reunión para realización de pruebas e identificación de requerimientos",
    "unit": "Cionpro",
    "detail": " Se está a la espera de la solicitud formal por parte del cliente"
  },
  {
    "id": "REQ-4",
    "title": "Migracion de servidor y actualizaciones de tecnologías (Acompañamiento de pruebas y validaciones con el cliente)",
    "assigned": "ALEJANDRO",
    "state": "En Proceso",
    "progress": 40,
    "startDate": "25/06/2025",
    "endDate": " ",
    "observations": "[25/06/2025]: Se realizan validaciones de pruebas de servicios generados desde Cionpro \n[26/06/2025]: Se realizan validaciones para pruebas de servicios generados desde Cionpro.\n[01/07/2025]: Se realizan validaciones para pruebas de servicios generados desde Cionpro.\n[09/07/2025]: Se realizan validaciones para pruebas de servicios generados desde Cionpro.",
    "unit": "Cionpro",
    "detail": " Migración de servicios y tecnologías para cumplir con requerimientos de seguridad y calidad"
  },
  {
    "id": "Interno-H4",
    "title": "Automatización y migración de lógica a python (Migración de código para la funcionalidad en donde se consume un web service para la asignación de casos a HRUA)",
    "assigned": "ALEJANDRO",
    "state": "En Test",
    "progress": 50,
    "startDate": "03/07/2025",
    "endDate": "07/07/2025",
    "observations": "[03/07/2025]: Se construye los modelos relacionados, el agente y se le asigna el trabajo que corresponde a la funcionalidad en PHP, faltan migrar características y realizar modificaciones.\n[07/07/2025]: Se migra la lógica faltante y se realiza una prueba básica de flujo debido a que se conecta y consume un servicio web que en el ambiente local no se puede probar, por lo que esta a la espera de pasarlo al ambiente de QA(Pruebas) para probar definitivamente todas las características",
    "unit": "Cionpro",
    "detail": " "
  },
  {
    "id": "REQ-3-2",
    "title": "Cambios técnicos en aplicativo imagine para proceso de mesa de control documental solicitud de pensión",
    "assigned": "ALEJANDRO",
    "state": "Pruebas Imagine",
    "progress": 75,
    "startDate": "26/06/2025",
    "endDate": "02/07/2025",
    "observations": "[24/06/2025] Se recibe requerimiento con detalles técnicos para la creación de un nuevo servicio que actualice el estado del caso en Imagine, la validación de documentos se realizara en Filenet y nos enviaran un servicio para cambiar el estado a documentos aprobados, se debe cerrar en Imagine la bandeja de validación documental de Mesa de Control Unificada.\n[25/06/2025]:Se brinda respuesta con los detalles técnicos que requiere Imagine para la implementación de este desarrollo, los cambios son significativos en la solicitud inicial ya que no se puede proceder con la estructura y servicio que el cliente solicita, se realiza el alcance para utilizar otro método y se envían dudas acerca del funcionamiento para estimar tiempo de ejecución.\nSe recibe respuesta por parte del cliente con la solución de las dudas mencionadas y solicita crear el método que se utilizara para este nuevo consumo.\n[26/06/2025]:Se envía cotización estimada en tiempo de ejecución y valor para la implementación del desarrollo, en este calculo se tiene en cuenta, tiempo de desarrollo, pruebas, posibles ajustes y paso a producción.\nSe crea el método en Imagine con la estructura requerida para la implementación del servicio, se reporta al cliente y se deja en QA para la implementación del desarrollo por parte del cliente.\n[02/07/2025]: Se modifica el método, en donde se le agrega validaciones para identificar casos que deben enviar eventos como el de normalización OK.\n[04/07/2025]:Se recibe información por parte del cliente con las pruebas en QA, internamente realizan acciones para el avance del requerimiento, Imagine ya realizo el entregable en pruebas.\nSe valida con el cliente via teams porque no hemos recibido el VoBo para el cobro y ejecución del desarrollo, sabíamos e incluirlo en el corte de facturación de este mes.\nSe recibe confirmación por parte del líder del proceso para realizar el cobro del desarrollo en un Ítem adicional en la factura de Servicios Previsionales para el corte del 20/07/2025.\n[09/07/2025]:El cliente solicita saber cuales son los estados que tenemos parametrizados en Imagine para el rechazo de documentos, se informa que solo tenemos unas causales genéricas y en el campo observación va el detalle puntual sobre cada documento, es una gestión uno a uno que no se encuentra parametrizada y es un valor agregado en la gestión de validación documental de acuerdo a nuestra experticia.\n[10/07/2025]:Nos encontramos a la espera de la programación para las pruebas punta a punta, por parte de Imagine estamos ok en el requerimiento inicial, se depende del desarrollo del cliente para realizar las pruebas.",
    "unit": "Cionpro",
    "detail": "Desarrollo de la mesa de validación documental con inteligencia artificial en Filenet  implica las siguiente es actividades:\r\nSe debe retirar la bandeja de imagine Validación Mesa de Control Unificada ya que la validación de documentos se realizará a través de filenet.\r\nDado que se requiere conservar otras funciones adicionales a la bandeja de validación en el software de imagine que depende de la validación documental, se les notificara a través del siguiente web service cada vez que una solicitud documental (Paquete de documentos relacionado a los diferentes riesgos) haya finalizado el proceso de validación.\r\n"
  },
  {
    "id": "REQ-2-2",
    "title": "Creación de reporte de AUF para identificación de pagos (**Creación de script para generar opción de consulta de pagos**)",
    "assigned": "ALEJANDRO",
    "state": "Pruebas Cionpro",
    "progress":90,
    "startDate": "1/07/2025",
    "endDate": "10/07/2025",
    "observations": "[09/07/2025]: Se Había pospuesto la creación del código y se retoma el día 8.\n[10/07/2025]: Se termina el desarrollo y las pruebas el 10 de julio con las modificaciones indicadas en la reunión.",
    "unit": "Cionpro",
    "detail": " Creación de Herramientas adicionales para el tratamiento de información y flujo en el módulo de auxilios funerarios"
  },
  {
    "id": "REQ-2-3",
    "title": "Creación de reporte de AUF para identificación de pagos (**Creación de script para generar opción en el de cargue y procesado de datos**)",
    "assigned": "ALEJANDRO",
    "state": "Pruebas Cionpro",
    "progress":75,
    "startDate": "2/07/2025",
    "endDate": "2/07/2025",
    "observations": "[02/07/2025]: Se realiza reunión el 1 de julio para la identificación de nuevos requisitos.\n[02/07/2025]: Se Crea vista y lógica para el cargue de documentos y procesamiento de datos.\n Se realizan pruebas de funcionamiento y se está a la espera de que el cliente realice pruebas.",
    "unit": "Cionpro",
    "detail": " Creación de Herramientas adicionales para el tratamiento de información y flujo en el módulo de auxilios funerarios"
  },
  {
    "id": "Interno-H5",
    "title": "Automatización y migración de lógica a python (**Migración de lógica para el cruce de datos existentes ya en las distintas tablas de pre radicación**)",
    "assigned": "ALEJANDRO",
    "state": "En Test",
    "progress":95,
    "startDate": "7/07/2025",
    "endDate": "7/07/2025",
    "observations": "[07/07/2025]: Se migra toda la lógica de la funcionalidad y se realizan pruebas.",
    "unit": "Cionpro",
    "detail": " "
  },
  {
    "id": "Interno-H6",
    "title": "Automatización y migración de lógica a python (**Análisis y obtención de documentos para iniciar con el proceso de clasificación de imágenes**)",
    "assigned": "ALEJANDRO",
    "state": "En Proceso",
    "progress":0,
    "startDate": " ",
    "endDate": " ",
    "observations": " ",
    "unit": "Cionpro",
    "detail": " "
  },
  {
    "id": "REQ-2-4",
    "title": "Creación de reporte de AUF para identificación de pagos (**Modificación de script para generar reporte de pagos de auxilios funerarios agregando distinta información y lógica para su construcción**)",
    "assigned": "ALEJANDRO",
    "state": "Pruebas Cionpro",
    "progress":90,
    "startDate": "09/07/2025",
    "endDate": "10/07/2025",
    "observations": "[10/07/2025]: Se termina el desarrollo y las pruebas. Se está en espera del visto bueno para pasar a producción",
    "unit": "Cionpro",
    "detail": "**Creación de reporte de AUF para identificación de pagos, creación de opción de cargue masivo para cambio de bandejas y creación de opción de consulta de pagos**\nCreación de Herramientas adicionales para el tratamiento de información y flujo en el módulo de auxilios funerarios"
  },
  {
    "id": "REQ-4-1",
    "title": "Migración de registros para tipos documentales gabinete 2 (Identificación y failitación al cliente de los tipos documnetales)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "09/07/2025",
    "endDate": "09/07/2025",
    "observations": "[09/07/2025]: Se indica al cliente los distintos tipos de documentación del gabinete 2",
    "unit": "Cionpro",
    "detail": ""
  }
]