[
  {
    "id": "Interno-H1",
    "title": "Automatización y migración de lógica a Python (Migración de código en donde se importa el lote tanto física como en bases de datos)",
    "assigned": "ALEJANDRO",
    "state": "En Test",
    "progress": 95,
    "startDate": "17/06/2025",
    "endDate": "19/06/2025",
    "observations": "[19/06/2025] Se produjeron ciertos errores en la fase de pruebas y se realizaron todas las correcciones para que el nuevo funcionamiento responda y se acople bien",
    "unit": "Cionpro",
    "detail": ""
  },
  {
    "id": "REQ-1-1",
    "title": "Tratamiento especial al radicar trámites de vejez (Revision de flujo y código)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "19/06/2025",
    "observations": "[19/06/2025] Se identifico el código a intervenir y con el que trabajar en el requerimiento",
    "unit": "Cionpro",
    "detail": "Se está a la espera de la solicitud formal por parte del cliente"
  },
  {
    "id": "Interno-H2",
    "title": "Automatización y migración de lógica a Python(Migración de código en donde se trata toda la lógica y activación de tareas de la indexación del lote)",
    "assigned": "ALEJANDRO",
    "state": "En Test",
    "progress":95,
    "startDate": "20/06/2025",
    "endDate": "25/06/2025",
    "observations": "[20/06/2025]: Identificación y paso del flujo para la funcionalidad de indexación de lotes de PHP a python\n[24/06/2025]: Se tiene identificado el código necesario para la migración y se avanza en ella. Se han tenido muchos requerimientos adicionales actualmente por lo que se retrasa un poco en su construcción\n[25/06/2025]: Se termina la migracion a python para el flujo de la funcionalidad de indexar lote y se realizaron pruebas de funcionalidad",
    "unit": "Cionpro",
    "detail": ""
  },
  {
    "id": "Interno-H3",
    "title": "Automatización y migración de lógica a Python (Acoplar lógica faltante en la migración de código)",
    "assigned": "ALEJANDRO",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "",
    "endDate": "26/06/2025",
    "observations": " ",
    "unit": "Cionpro",
    "detail": ""
  },
  {
    "id": "REQ-1-2",
    "title": "Tratamiento especial al radicar trámites de vejez (Reunión con las partes interesadas para identificar los inputs de trabajo)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "[24/06/2025]: Se reune con las partes interesadas, se identifican los requisitos, necesidades y material de trabajo, pero se suspende el requerimiento hasta nuevo aviso.",
    "unit": "Cionpro",
    "detail": " Se está a la espera de la solicitud formal por parte del cliente"
  },
  {
    "id": "REQ-1-3",
    "title": "Tratamiento especial al radicar trámites de vejez (Fase de desarrollo para la creacion de código para la implementación del requerimiento)",
    "assigned": "ALEJANDRO",
    "state": "Pausado",
    "progress": 0,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "[24/06/2025]: El requerimiento esta en pausa hasta que se identifique la viabilidad de la reforma pensional",
    "unit": "Cionpro",
    "detail": " Se está a la espera de la solicitud formal por parte del cliente"
  },
  {
    "id": "REQ-2-1",
    "title": "Creación de reporte de AUF para identificación de pagos (Creación de script para crear reporte de pagos de auxilios funerarios y la vista para su consumo)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "1/07/2025",
    "endDate": "15/07/2025",
    "observations": "[24/06/2025]: Se realiza reunión para la identificación de nuevos requisitos \n[01/07/2025]: Se realiza vista para el consumo y parte de la lógica para la creación del reporte, Se está a la espera de validar la información del reporte debido a que se nos envía 2 reportes con estructuras distintas.\n[02/07/2025]: Se realiza paso test el 1 de julio. \n[09/07/2025]: Se realiza reunión con las partes interesadas y se acuerda en agregar información obtenida de distintas fuentes al formulario.\n[15/07/2025]: Se realizaron aún más cambios propuestos por el usuario y correcciones de fallas en el funcionamiento y se realiza paso a producción.",
    "unit": "Cionpro",
    "detail": " Creación de Herramientas adicionales para el tratamiento de información y flujo en el módulo de auxilios funerarios"
  },
  {
    "id": "REQ-3-1",
    "title": "Cambios técnicos en aplicativo imagine para proceso de mesa de control documental solicitud de pensión (Reunión con las partes interesadas para identificación de requerimientos)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "24/06/2025",
    "observations": "[24/06/2025]: Se realiza reunión para realización de pruebas e identificación de requerimientos",
    "unit": "Cionpro",
    "detail": " Se está a la espera de la solicitud formal por parte del cliente"
  },
  {
    "id": "REQ-4-1",
    "title": "Migracion de servidor y actualizaciones de tecnologías (Acompañamiento de pruebas y validaciones con el cliente)",
    "assigned": "ALEJANDRO",
    "state": "En Proceso",
    "progress": 40,
    "startDate": "25/06/2025",
    "endDate": " ",
    "observations": "[25/06/2025]: Se realizan validaciones de pruebas de servicios generados desde Cionpro \n[26/06/2025]: Se realizan validaciones para pruebas de servicios generados desde Cionpro.\n[01/07/2025]: Se realizan validaciones para pruebas de servicios generados desde Cionpro.\n[09/07/2025]: Se realizan validaciones para pruebas de servicios generados desde Cionpro.",
    "unit": "Cionpro",
    "detail": " Migración de servicios y tecnologías para cumplir con requerimientos de seguridad y calidad"
  },
  {
    "id": "Interno-H4",
    "title": "Automatización y migración de lógica a python (Migración de código para la funcionalidad en donde se consume un web service para la asignación de casos a HRUA)",
    "assigned": "ALEJANDRO",
    "state": "En Test",
    "progress": 50,
    "startDate": "03/07/2025",
    "endDate": "07/07/2025",
    "observations": "[03/07/2025]: Se construye los modelos relacionados, el agente y se le asigna el trabajo que corresponde a la funcionalidad en PHP, faltan migrar características y realizar modificaciones.\n[07/07/2025]: Se migra la lógica faltante y se realiza una prueba básica de flujo debido a que se conecta y consume un servicio web que en el ambiente local no se puede probar, por lo que esta a la espera de pasarlo al ambiente de QA(Pruebas) para probar definitivamente todas las características",
    "unit": "Cionpro",
    "detail": " "
  },
  {
    "id": "REQ-3-2",
    "title": "Cambios técnicos en aplicativo imagine para proceso de mesa de control documental solicitud de pensión",
    "assigned": "ALEJANDRO",
    "state": "Pruebas Cionpro",
    "progress": 75,
    "startDate": "26/06/2025",
    "endDate": "02/07/2025",
    "observations": "[26/06/2025]: Se construye nuevo método de consumo y la lógica para tratamiento de trámites para cerrar mesa unificada.\n[26/06/2025]: Se cierra bandeja de mesa unificada.\n[26/06/2025]: Se realizan preubas de consumo al nuevo método del servicio.\n[02/07/2025]: Se añade código para realizar tratamientos de envío de eventos de normalización si el trámite lo permite.\n[02/07/2025]: Se inicia la fase de pruebas con una aún no satisfactoria.\n[03/07/2025]: Se realiza correcciones en el flujo y se realiza prueba con resultado satisfactorio, Se está a la espera de realizar pruebas junto con el cliente",
    "unit": "Cionpro",
    "detail": "Desarrollo de la mesa de validación documental con inteligencia artificial en Filenet  implica las siguiente es actividades:\r\nSe debe retirar la bandeja de imagine Validación Mesa de Control Unificada ya que la validación de documentos se realizará a través de filenet.\r\nDado que se requiere conservar otras funciones adicionales a la bandeja de validación en el software de imagine que depende de la validación documental, se les notificara a través del siguiente web service cada vez que una solicitud documental (Paquete de documentos relacionado a los diferentes riesgos) haya finalizado el proceso de validación.\r\n"
  },
  {
    "id": "REQ-2-2",
    "title": "Creación de reporte de AUF para identificación de pagos (**Creación de script para generar opción de consulta de pagos**)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress":100,
    "startDate": "1/07/2025",
    "endDate": "10/07/2025",
    "observations": "[09/07/2025]: Se Había pospuesto la creación del código y se retoma el día 8.\n[10/07/2025]: Se termina el desarrollo y las pruebas el 10 de julio con las modificaciones indicadas en la reunión.\n[15/07/2025]: Se realizaron aún más cambios propuestos por el usuario y correcciones de fallas en el funcionamiento y se realiza paso a producción.",
    "unit": "Cionpro",
    "detail": " Creación de Herramientas adicionales para el tratamiento de información y flujo en el módulo de auxilios funerarios"
  },
  {
    "id": "REQ-2-3",
    "title": "Creación de reporte de AUF para identificación de pagos (**Creación de script para generar opción en el de cargue y procesado de datos**)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress":100,
    "startDate": "2/07/2025",
    "endDate": "2/07/2025",
    "observations": "[02/07/2025]: Se realiza reunión el 1 de julio para la identificación de nuevos requisitos.\n[02/07/2025]: Se Crea vista y lógica para el cargue de documentos y procesamiento de datos.\n Se realizan pruebas de funcionamiento y se está a la espera de que el cliente realice pruebas.\n[15/07/2025]: Se realizaron aún más cambios propuestos por el usuario y correcciones de fallas en el funcionamiento y se realiza paso a producción.",
    "unit": "Cionpro",
    "detail": " Creación de Herramientas adicionales para el tratamiento de información y flujo en el módulo de auxilios funerarios"
  },
  {
    "id": "Interno-H5",
    "title": "Automatización y migración de lógica a python (**Migración de lógica para el cruce de datos existentes ya en las distintas tablas de pre radicación**)",
    "assigned": "ALEJANDRO",
    "state": "En Test",
    "progress":95,
    "startDate": "7/07/2025",
    "endDate": "7/07/2025",
    "observations": "[07/07/2025]: Se migra toda la lógica de la funcionalidad y se realizan pruebas.",
    "unit": "Cionpro",
    "detail": " "
  },
  {
    "id": "Interno-H6",
    "title": "Automatización y migración de lógica a python (**Análisis y obtención de documentos para iniciar con el proceso de clasificación de imágenes**)",
    "assigned": "ALEJANDRO",
    "state": "En Test",
    "progress":50,
    "startDate": "16/07/2025 ",
    "endDate": " ",
    "observations": "[16/07/2025]: Se identifican los documentos a clasificar. Se empieza con la actividad de elección y la forma en que se le dará tratamiento a los documentos.\n[17/07/2025]: Se crean queries y scripts necesarios para la descarga y conversión a pdf desde el repositorio S3 de los archivos necesarios para el entrenamiento del modelo. ",
    "unit": "Cionpro",
    "detail": " "
  },
  {
    "id": "REQ-2-4",
    "title": "Creación de reporte de AUF para identificación de pagos (**Modificación de script para generar reporte de pagos de auxilios funerarios agregando distinta información y lógica para su construcción**)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress":100,
    "startDate": "09/07/2025",
    "endDate": "10/07/2025",
    "observations": "[10/07/2025]: Se termina el desarrollo y las pruebas. Se está en espera del visto bueno para pasar a producción.\n[15/07/2025]: Se realizaron aún más cambios propuestos por el usuario y correcciones de fallas en el funcionamiento y se realiza paso a producción.",
    "unit": "Cionpro",
    "detail": "**Creación de reporte de AUF para identificación de pagos, creación de opción de cargue masivo para cambio de bandejas y creación de opción de consulta de pagos**\nCreación de Herramientas adicionales para el tratamiento de información y flujo en el módulo de auxilios funerarios"
  },
  {
    "id": "REQ-4-1",
    "title": "Migración de registros para tipos documentales gabinete 2 (Identificación y failitación al cliente de los tipos documnetales)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "09/07/2025",
    "endDate": "09/07/2025",
    "observations": "[09/07/2025]: Se indica al cliente los distintos tipos de documentación del gabinete 2",
    "unit": "Cionpro",
    "detail": ""
  },
  {
    "id": "Interno-H7",
    "title": "Automatización y migración de lógica a python (Creación de script para entrenamiento del modelo de clasificación)",
    "assigned": "ALEJANDRO",
    "state": "En Proceso",
    "progress": 75,
    "startDate": "17/07/2025",
    "endDate": " ",
    "observations":"[17/07/2025]: Se realiza reunión con Danilo para identificar enfoque de manejo de dependencias y entre otros temas.\n[18/07/2025]: Se construye con ayuda de la IA varios scripts que se usaran como modelo e inferencia del proyecto. No se han probado ni tampoco se han acoplado al sistema de agentes.\n[28/07/2025]: Se había detenido la actividad hasta tener todos los recursos al menos en el sistema local para trabajar el modelo de entrenamiento, en este caso faltaba los archivos. \n[28/07/2025]: Se realizan correcciones, pruebas y generación de los primeros 5 recorridos completos por todo el dataset de entrenamiento y se obtiene un modelo con 84% de fiabilidad. Cada recorrido tarda alrededor de 2 horas y genera un esfuerzo moderado al PC, por lo que las demás actividades se ven un poco afectadas, se espera conseguir un modelo de más de 90% de fiabilidad y por lo que serán necesario más entrenamiento, análisis y recorridos por toda la data.\n[29/07/2025]: Se siguen ejecutando el entrenamiento para la búsqueda de un modelo más fiable.",
    "unit": "Cionpro",
    "detail": ""
  },
  {
    "id": "REQ-3-3",
    "title": "Cambios técnicos en aplicativo imagine para proceso de mesa de control documental solicitud de pensión(Creación de otro método para consumo necesario para tratamiento de trámites de pruebas de protección)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado" ,
    "progress": 100,
    "startDate": "16/07/2025",
    "endDate": "16/07/2025",
    "observations": "[16/07/2025]: Se realiza nuevo método de consumo para cerrar trámites con procesos documentales abiertos y asi, Cionpro pueda ser pruebas de cierre de mesa unificada documental sin necesidad de tener procesos abiertos y con documentos.",
    "unit": "Cionpro",
    "detail": "Desarrollo de la mesa de validación documental con inteligencia artificial en Filenet  implica las siguiente es actividades:\r\nSe debe retirar la bandeja de imagine Validación Mesa de Control Unificada ya que la validación de documentos se realizará a través de filenet.\r\nDado que se requiere conservar otras funciones adicionales a la bandeja de validación en el software de imagine que depende de la validación documental, se les notificara a través del siguiente web service cada vez que una solicitud documental (Paquete de documentos relacionado a los diferentes riesgos) haya finalizado el proceso de validación.\r\n"
  },
  {
    "id": "REQ-5-1",
    "title": "Proyecto relacionado con las inconsistencias norma 2381",
    "assigned": "ALEJANDRO",
    "state": "Finalizado" ,
    "progress": 100,
    "startDate": "11/07/2025",
    "endDate": "11/07/2025",
    "observations": "[09/07/2025]: Se identifica los métodos de consumo posibles, su funcionamiento y se plasma junto con las respuestas a las dudas del cliente en un informe",
    "unit": "Cionpro",
    "detail": " "
  },
  {
    "id": "REQ-6-1",
    "title": "Análisis y corrección de procesos de cargue e identificación de pagos de tipo de riesgo AUX",
    "assigned": "ALEJANDRO",
    "state": "Finalizado" ,
    "progress": 100,
    "startDate": "18/07/2025",
    "endDate": "23/07/2025",
    "observations": "[17/07/2025]: Se realiza reunión para identificar las inconsistencias. Se está a la espera de datos de prueba y de análisis de los procesos para la verificación de los mismos.[21/07/2025]: Se Identificaron lógicas erróneas en el código que se corrigieron y otras lógicas de negocio que no, debido a que primero se deben de socializar los resultados antes de poder pensar en una solución.\n[23/07/2025]: Se genera informe de la situación, recomendaciones y procesos a seguir para brindar solución.\n[23/07/2025]: Se pasa los cambios que corregían errores a producción.",
    "unit": "Cionpro",
    "detail": " "
  },
  {
    "id": "Interno-2-1",
    "title": "Requerimiento de infraestructura para habilitar monitoreo y encapsulamiento a través de contenedores de aplicaciones ( Informe de requerimientos al área encargada, instalación y prueba de funcionamiento de librerías de monitoreo y de contenedores)",
    "assigned": "ALEJANDRO",
    "state": "En Proceso" ,
    "progress": 30,
    "startDate": "24/07/2025",
    "endDate": " ",
    "observations": "[24/07/2025]: Se genera informe para la instalación de dependencias al área encargada, incluyendo información técnica y necesidades en las siguientes solicitudes de Cionpro: SR1267449, SR1267909, SR1267937",
    "unit": "Cionpro",
    "detail": "Instalación de dependencias, scripts y demas  para dos procesos, uno de auditoria de accesos y otro de encapsulación de aplicaciones a través de contenedores docker "
  },
  {
    "id": "REQ-7-1",
    "title": "Mejoras en los modulos de Imagine (Reunión con las partes interesadas e identificación de requerimientos)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado" ,
    "progress": 100,
    "startDate": "22/07/2025",
    "endDate": "22/07/2025",
    "observations": "[22/07/2025]: Se realiza reunión para la identificación de requerimientos y necesidades del cliente.\n[23/07/2025]: Se comparte archivo de la solicitud.",
    "unit": "Cionpro",
    "detail": "Solicitud de Cionpro para mejoras IMAGINE en el módulo de Auxilios funerarios"
  },
  {
    "id": "Interno-H8",
    "title": "Automatización y migración de lógica a python (Ejecuci[on y correcci[on de script y descarga de recursos necesarios para el entrenamiento del modelo de clasificacion)",
    "assigned": "ALEJANDRO",
    "state": "Finalizado" ,
    "progress": 100,
    "startDate": "25/07/2025",
    "endDate": "28/07/2025",
    "observations": "[25/07/2025]: Se realiza la descarga de 80000 archivos no sin antes reestructurar el script y acoplarlo para no sobrecargar los procesos y que funcionara.\n[26/07/2025]: Se empieza proceso de carga en local, todo esto debido a que no se puede generar el modelo de entrenamiento en el servidor por capacidad.\n[28/07/2025]: Se termina el proceso de carga en local.",
    "unit": "Cionpro",
    "detail": " "
  },
  {
    "id": "REQ-8-1",
    "title": "Definición y cambio de flujo en la activación agente - investigación (Análisis de requerimientos, código y modificación de módulo para cumplirnecesidades)",
    "assigned": "ALEJANDRO",
    "state": "En Proceso" ,
    "progress": 20,
    "startDate": "30/07/2025",
    "endDate": " ",
    "observations": "[30/07/2025]: Se inicia el proceso de análisis para la parte de modificación de cargue y se informa de lo encontrado",
    "unit": "Cionpro",
    "detail": " Modificación del flujo, cargue y almacenamiento de datos de la fase de investigación. Además, de envió de esa información a filenet "
  }
]