[
  {
    "id": "1",
    "title": "Migración Gestión Documental, Ajustar módulos",
    "assigned": "Faver",
    "state": "Pausado",
    "progress": 5,
    "startDate": "10/01/2025",
    "endDate": "",
    "observations": "Se encuentra pausado por el momendo debido a temas de definición de contrato con el cliente",
    "unit": "Yuta",
    "detail": "Sistema Operativo, PHP",
    "visible": true
  },
  {
    "id": "1-1",
    "title": "Pruebas Migración Gestión Documental",
    "assigned": "Natalia",
    "state": "Pausado",
    "progress": 0,
    "startDate": "10/01/2025",
    "endDate": "",
    "observations": "Se encuentra pausado por el momendo debido a temas de definición de contrato con el cliente",
    "unit": "Yuta",
    "detail": "Realizar pruebas con el fin de validar el correcto funcionamiento del aplicativo",
    "visible": true
  },
  {
    "id": "2",
    "title": "Migración Legalizaciones y Anticipos Ajustar módulos",
    "assigned": "Faver",
    "state": "Pausado",
    "progress": 60,
    "startDate": "10/01/2025",
    "endDate": "",
    "observations": "Se encuentra pausado por el momendo debido a temas de definición de contrato con el cliente",
    "unit": "Yuta",
    "detail": "Sistema Operativo, PHP",
    "visible": true
  },
  {
    "id": "2-1",
    "title": "Pruebas Migración Leg y Anticipos",
    "assigned": "Natalia",
    "state": "Pausado",
    "progress": 60,
    "startDate": "10/01/2025",
    "endDate": "",
    "observations": "Se encuentra pausado por el momendo debido a temas de definición de contrato con el cliente",
    "unit": "Yuta",
    "detail": "Realizar pruebas con el fin de validar el correcto funcionamiento del aplicativo",
    "visible": true
  },
  {
    "id": "9",
    "title": "Reporte y validación de 9 incidentes via email",
    "assigned": "Natalia",
    "state": "Pausado",
    "progress": 50,
    "startDate": "10/01/2025",
    "endDate": "",
    "observations": "Se encuentra pausado por el momendo debido a temas de definición de contrato con el cliente",
    "unit": "Yuta",
    "detail": "Se realiza reporte de 9 incidentes luego de pruebas realizadas en el aplicativo\n Se valida y a la fecha han sido solucionados 5 incidentes",
    "visible": true
  },
  {
    "id": "3",
    "title": "Migración Virtualización, Ajustar módulos",
    "assigned": "Faver",
    "state": "Pausado",
    "progress": 0,
    "startDate": "10/01/2025",
    "endDate": "",
    "observations": "Se encuentra pausado por el momendo debido a temas de definición de contrato con el cliente",
    "unit": "Yuta",
    "detail": "Sistema Operativo, PHP",
    "visible": true
  },
  {
    "id": "3-1",
    "title": "Pruebas Migración Virtualización",
    "assigned": "Natalia",
    "state": "Pausado",
    "progress": 0,
    "startDate": "10/01/2025",
    "endDate": "",
    "observations": "Se encuentra pausado por el momendo debido a temas de definición de contrato con el cliente",
    "unit": "Yuta",
    "detail": "Realizar pruebas con el fin de validar el correcto funcionamiento del aplicativo",
    "visible": true
  },
  {
    "id": "4",
    "title": "Incluir en la operación de anexos el API de pendiente catt",
    "assigned": "Wilson",
    "state": "Finalizado",
    "progress": 90,
    "startDate": "24/06/2025",
    "endDate": "",
    "observations": "\"Estamos a la espera de la instalación de una librería para conexión a PCO, pero es Tuya quien hace dicha instalación, pero aún no hay fecha.\n[11/07/2025]: se tuvo una reunión en la cual realizaron una ampliación de requerimiento para que los anexos que no tengan una solicitud se queden en cola dos o tres días máximo, y cuando llegue la solicitud se indexen\"",
    "unit": "Yuta",
    "detail": "Crear un cliente en nodejs que una vez que se detecten los tipos de anexo envíe vía API el detalle de acuerdo a cada solicitud.\n\n\n",
    "visible": true
  },
  {
    "id": "5",
    "title": "El código de oficina no debe ser obligatorio para indexar documentos desde la API",
    "assigned": "Wilson",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "",
    "observations": "[27/06/2025]: Se realizó modificación del codigo de oficina como opcional",
    "unit": "Yuta",
    "detail": "El viernes 11 de julio, se tuvo una reunión en la cual realizaron una ampliación de requerimiento para que los anexos que no tengan una solicitud se queden en cola dos o tres días máximo, y cuando llegue la solicitud se indexen\"",
    "visible": true
  },
  {
    "id": "6",
    "title": "Actualizar documentación para la operación de anexos",
    "assigned": "Wilson",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "",
    "observations": "[27/06/2025]: Se realizaron ajustes necesarios y se modificó el documento con respecto a mensajes de error",
    "unit": "Yuta",
    "detail": "",
    "visible": true
  },
  {
    "id": "7",
    "title": "Se requiere una nueva operación que reciba la solicitud y sus anexos",
    "assigned": "Wilson",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "24/06/2025",
    "endDate": "",
    "observations": "[24/07/2025]: Este pundo depende del cliente que se construye con el punto 1. la funcionalidad de envio a pendientes serviria para ambos servicios.\n[13/08/2025]: en el momento el cliente se encuentra haciendo pruebas de la indexación de anexos, y la cola de espera.\nEn cuanto el 3 punto, estamos en espera de la instalación de una libreria para el consumo de un servicio de Soap, esto ya que por medio de métodos manuales no fue posible para todos los casos. Apenas tenga la autorización lo único que haría falta es desarrollar el cliente y traer los datos que se requieren para indexar la solicitud y sus anexos.\nTambién en la reunión de entrega surgieron unas validaciones adicionales, pero de esa parte no nos han enviado el requerimiento ya que depende de definiciones de ellos.\n[20/08/2025]: con respecto a el desarrollo del Api, se realizó lo requerido, sin embargo surgió un cambio muy necesario al recibir los documentos, es el siguiente: \"Espero que te encuentres bien. Después de revisar la duda planteada, te cuento que:\nEl control para la operación de .zip\nSi la solicitud existe - no se vuelve a indexar\nSi los anexos existen – no se vuelven a indexar\nSi los anexos no existen – se adicionan a los documentos.\nEn caso de que todos los documentos existan devolver:  No se requieren agregar nuevamente los documentos.\nSi, se agrega al menos un documento: Los anexos faltantes fueron agregados a la solicitud.\nSi, todos se agregan: Proceso exitoso.\"\nVoy a agregar la lógica para estas validaciones y realizar pruebas nuevamente con la usuaria, con esto daríamos por finalizado este desarrollo, solo quedaría actualizar la documentación y el paso a producción.\n[22/08/2025]: en cuanto al Api, se realizó la entrega del último método con todos los ajustes y validaciones requeridas, adicionalmente se entregó la documentación técnica al día\nQueda la implementación por parte de ellos, pruebas de integración y paso a producción.\n[27/08/2025]: Se revisa en conjunto con el cliente  de funcionamiento del ultimo método, punto 4, se realizan ajustes de forma en la generación de mensajes de éxito y se ajusta documentación \nSe realiza ajuste para q reciba solamente documentación de la solicitud sin anexo, esto en caso de falla al momento de la generación de los anexos.",
    "unit": "Yuta",
    "detail": "Este proceso en una unica operación, la cual debe consumir el API de pendientes para registrar los documentos enviados",
    "visible": true
  },
  {
    "id": "8",
    "title": "Quitar conexiones y modificar método para recibir los datos nuevos:",
    "assigned": "Wilson",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "",
    "endDate": "",
    "observations": "[14/08/2025]: En cuanto a los desarrollo del Api, ayer definieron que no vamos a realizar la conexión si no que ellos nos envían los datos necesarios, les expliqué la lógica al respecto y como nos deben enviar los datos, surge el cambio en el servicio para recibir y validar los datos.\nEn este caso no quisieron avalar la librería solicitada y para poder poner la que nos ofrecieron nos tocaba migrar todo el Api.\nEn este caso ellos deben validar y enviar la información del producto a ingresar, realmente no es mucho lo que deben hacer para consultar y traer los datos que requerimos\nEn otras palabras es algo que genera un impacto muy bajo de quien lo deba hacer.",
    "unit": "Yuta",
    "detail": "Ddefinieron que no vamos a realizar la conexión si no que ellos nos envían los datos necesarios,",
    "visible": true
  },
  {
    "id": "101",
    "title": "Consulta Solicitudes Pendientes por Validar Venta Cartera Junio",
    "assigned": "Faver",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "",
    "observations": "Se realiza validación en el sistema y se envía respuesta al usuario solicitante",
    "unit": "Yuta",
    "detail": "Se requiere que con la base de datos que comparten, identificar si tienen documento de solicitud de crédito en Imagine",
    "visible": true
  },
  {
    "id": "111",
    "title": "Validación Clientes con autorización tratamiento de datos",
    "assigned": "Faver",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "19/06/2025",
    "endDate": "",
    "observations": "Se realiza validación en el sistema y se envía respuesta al usuario solicitante",
    "unit": "Yuta",
    "detail": "Validación de 36665 clientes, por medio de archivo adjunto, donde se pueda identificar que clientes cuentan con una autorización de tratamiento de datos personales",
    "visible": true
  },
  {
    "id": "121",
    "title": "Nueva operación que reciba solicitud y anexos",
    "assigned": "Faver",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "20/06/2025",
    "endDate": "",
    "observations": "Esta pendiente de aprobación por Tuya",
    "unit": "Yuta",
    "detail": "En la opción de Consulta Área de crédito, validar si es posible, donde se realiza la comparación que se pueda discriminar cuando en una misma familia el cliente tenga varias solicitudes.",
    "visible": true
  },
  {
    "id": "131",
    "title": "Crear opción para generación informe Morosos",
    "assigned": "Faver",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "20/06/2025",
    "endDate": "",
    "observations": "Esta pendiente de aprobación por Tuya",
    "unit": "Yuta",
    "detail": "Usuario envía archivo con clientes mororos de créditos, para validar soportes existentes en Imagine para los números de cédula enviados. Los documentos son Solicitud de crédito o actualización de datos del deudor y Anexo1 aceptación, autorización.",
    "visible": true
  },
  {
    "id": "141",
    "title": "Realizar trazabilidad de las solicitudes que anulan y desanulan de los documentos en los anexos.",
    "assigned": "Faver",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "25/06/2025",
    "endDate": "",
    "observations": "Esta pendiente de aprobación por Tuya",
    "unit": "Yuta",
    "detail": "Hoy en día se cuenta con un log de solo 10 días, pero en el nuevo requerimiento se solicita que no tenga tiempo límite.",
    "visible": true
  },
  {
    "id": "151",
    "title": "Retirar candado consulta",
    "assigned": "Faver",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "25/06/2025",
    "endDate": "",
    "observations": "Esta pendiente de aprobación por Tuya",
    "unit": "Yuta",
    "detail": "Se solicita retirar el candado que se tiene actualmente en la consulta inicial, debido a que dicha opción no se encuentra actualizada y se tiene “consulta área de crédito“ para realizar el proceso de comparación",
    "visible": true
  },
  {
    "id": "161",
    "title": "Nueva opción consulta área crédito",
    "assigned": "Faver",
    "state": "Pendiente",
    "progress": 0,
    "startDate": "25/06/2025",
    "endDate": "",
    "observations": "Esta pendiente de aprobación por Tuya",
    "unit": "Yuta",
    "detail": "Se debe crear un nuevo método en el API en el cual se recibe archivo .zip y adicional el listado de tipos de documento que contiene de manera que se agregue un nuevo lote con un documento principal y sus anexos y adicionalmente se reporte a PCO vía API REST los documentos según configuración.",
    "visible": true
  },
  {
    "id": "171",
    "title": "Solicitud jhon Humberto",
    "assigned": "Faver",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/07/2025",
    "endDate": "17/07/2025",
    "observations": "[16/07/2025]: se tuvo reunión en la cual dieron contexto de las pruebas que realizaron y que les esta fallando\n[17/07/2025]: Se realiza validaciones, se determina que en las p ruebas que realizaron se esta recibiendo codigos no parametrizados para la solicitud que tratan de procesar. ",
    "unit": "Yuta",
    "detail": "Ayudar a Jhon Humberto para validar una solicitud en Ambiente de pruebas por que tiene malo el causal desde PCO",
    "visible": true
  },
  {
    "id": "181",
    "title": "Consulta solicitudes Venta Cartera",
    "assigned": "Faver",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/07/2025",
    "endDate": "17/07/2025",
    "observations": "[16/07/2025]: se tuvo reunión para validación con el usuario para validar bien la informaciòn que requieren.\n[17/07/2025]: luego de validar la información que se brindo en la reunión se genero el informe y se envío al usuario solicitante",
    "unit": "Yuta",
    "detail": "Se requiere que con la base de datos que comparten, identificar si tienen documento de solicitud de crédito en Imagine",
    "visible": true
  },
  {
    "id": "191",
    "title": "Urgente FGA y FNG Solicitud soportes y base morosos",
    "assigned": "Faver",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "14/07/2025",
    "endDate": "15/07/2025",
    "observations": "",
    "unit": "Yuta",
    "detail": "Generar por favor link de descarga de documentos que requeire el equipo de operaiones para un proceso de la compañia. Adjuntan archivo",
    "visible": true
  },
  {
    "id": "201",
    "title": "Creación Ofiicna ",
    "assigned": "Natalia",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "22/07/2025",
    "endDate": "22/07/2025",
    "observations": "",
    "unit": "Yuta",
    "detail": "Se solicita creación de nueva oficina por apertura de nueva sede",
    "visible": true
  },
  {
    "id": "211",
    "title": "Solicitud de encriptar un cliente secret que se usa consumcir un Api, es para solventar un riesgo de vulnerabilidad",
    "assigned": "Faver",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "",
    "endDate": "22/07/2025",
    "observations": "",
    "unit": "Yuta",
    "detail": "Es una solicitud para mitigar una vulnerabilidad en un client secret, este se usa para consumir las APIs, por politicas de seguridad se pidio que no se almacene en texto plano, se debe encriptar para evitar la exposición del valor real del secret.",
    "visible": true
  },
  {
    "id": "221",
    "title": "Solicitud de validación de unos host de servidores linux de producción, preguntan que si son necesario para funcionar o que si se pueden quitar.",
    "assigned": "Faver",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "18/07/2025",
    "endDate": "23/07/2025",
    "observations": "[22/07/2025]: se valida la solicitud del cliente, se socializa con Don Hernan y Jenry, y se les indica que nosotros solo debemos confirmar si se usa o si pueden retirarlo, ya que no deberia estar configurado, ya que ellos tienen unas configuraciones ya establecidas para los nombres de host en los servidores.",
    "unit": "Yuta",
    "detail": "Es un reporte que nos realizan desde infraestructura que en los ambientes productivos se tiene asociado a la IP local de lo servidores un hostname personalizado, nos indican que si no es necesario para nuestros procesos deben retirarlo.",
    "visible": true
  },
  {
    "id": "231",
    "title": "Solicitud soportes y bases de morosos a corte 23 julio",
    "assigned": "Faver y \nNatalia",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "23/07/2025",
    "endDate": "28/07/2025",
    "observations": "[25/07/2025]: Este requerimiento no se pudo validar dado atender hoy debido a que se ha realizado el acompañamiento y seguimiento en Colpatria por la novedad presentada",
    "unit": "Yuta",
    "detail": "Solicitud de usuario para generar base de morosos...como este es un reporte que se genera dos veces al mes, ya se tiene el query para generar la información",
    "visible": true
  },
  {
    "id": "241",
    "title": "Solicitud soportes y bases de morosos a corte 31 julio",
    "assigned": "Faver y \nNatalia",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "05/08/2025",
    "endDate": "06/08/2025",
    "observations": "",
    "unit": "Yuta",
    "detail": "Solicitud de usuario para generar base de morosos...como este es un reporte que se genera dos veces al mes, ya se tiene el query para generar la información",
    "visible": true
  },
  {
    "id": "251",
    "title": "Certificados digitales",
    "assigned": "Faver y \nNatalia",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "13/08/2025",
    "endDate": "14/08/2025",
    "observations": "[14/08/2025]: Se informa que el día 13 de agosto, se hizo el cambio de los certificados,  pero un certificado estaba mal, ya se reporto y esperamos nos envien de nuevo para realizar el ajuste antes del 16 de agosto",
    "unit": "Yuta",
    "detail": "certificados digitales para los aplicativos de virtualizacion y legalizaciones para el día 13 de agosto con tecnología",
    "visible": true
  },
  {
    "id": "261",
    "title": "Base de datos para recolección de extractos bancarios",
    "assigned": "Faver",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "15/08/2025",
    "endDate": "20/08/2025",
    "observations": "[19/08/2025]: se realiza sesión para la generaciónn de la información pero estaba quedando muy pesado el archivo, ya que eran demasiados registros,  por lo que la entrega se va a realizar por paquetes para evitar problemas con la red\n[20/08/2025]: se realiza generación de varios paquetes para entregar información al usuario.\n",
    "unit": "Yuta",
    "detail": "Nos solitan entregar un paquete con los extractos bancarios de 10mil solicitudes, para un proceso del cliente de un modelo que van a probar",
    "visible": true
  },
  {
    "id": "271",
    "title": "solicitud para generar un informe para temas de venta de cartea",
    "assigned": "Faver",
    "state": "Finalizado",
    "progress": 100,
    "startDate": "22/08/2025",
    "endDate": "25/08/2025",
    "observations": "",
    "unit": "Yuta",
    "detail": "Realizar consulta de clientes del mes de junio.",
    "visible": true
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Yuta",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Yuta",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Yuta",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Yuta",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Yuta",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Yuta",
    "detail": "",
    "visible": false
  },
  {
    "id": "",
    "title": "",
    "assigned": "",
    "state": "",
    "progress": 0,
    "startDate": "",
    "endDate": "",
    "observations": "",
    "unit": "Yuta",
    "detail": "",
    "visible": false
  }
]